[{"title":"Legal Officer (0.7eft)","dataCreated":"2021-04-19","region":"Wellington","city":"Wellington","employer":"PSA Te Pūkenga Here Tikanga Mahi","phone":"(027) 2137185","contactName":"Liz Byron","expires":"2021-05-20","type":"part time","description":"Legal Officer (0.7fte) Vacancy\nThe PSA Te Pūkenga Here Tikanga Mahi is the largest union in New Zealand, Aotearoa and is an innovative and dynamic organisation employing 180 staff throughout New Zealand. We have more than 78,000 members working in central and local government, health and community services. The focus of the PSA is to advance the rights and conditions of members through building collectivity in the workplace.  The PSA takes a strategic approach to building unionism.\nThe PSA has a vacancy for an Legal Officer to join our 3-person legal team. This is a part-time 0.7fte permanent position preferably based in our Wellington office.\nThe Legal Officer (0.7 fte) will be expected to practice in all aspects of employment law, including  providing advice, presenting internal legal training sessions, attending mediation, and appearing in the Employment Relations Authority and the Employment Court when necessary.   We are looking for a person who is politically astute and supportive of the union movement, experienced in the application of employment law, committed to improving the quality of members’ working lives and is able to travel throughout New Zealand.   The legal officer will have the ability to hold a current practising certificate.\nWe are looking for someone who can work well with other members of the legal team and with other PSA staff. \nThe PSA is committed to honouring the principles of Te Tiriti o Waitangi pursuant to the purpose and objects of the union. Knowledge of te reo and tikanga Māori will be considered an asset.\nThe PSA is also an EEO employer.\nPlease download the following documents if you would like to apply:\nLegal Officer JD October 2020\nPSA Application Form\nFor any queries you can contact Liz Byron, Executive Assistant to the National Secretaries on 04-816 5036 or email liz.byron@psa.org.nz.\nApplications close 5.00pm on Friday 30 April 2021."},{"title":"Solicitor","dataCreated":"2021-04-15","region":"Wellington","city":"Wellington","employer":"FIRST Union","phone":"(09) 6228436","contactName":"Jo Wilson","expires":"2021-05-16","type":"full time","description":"The union is looking to appoint a full-time fixed-term solicitor based out of the Wellington office from 26 April 2021 to fill in for a staff member who is on secondment until October.  The purpose of the role is to work constructively with the legal team and provide legal advice and representation to FIRST Union and union members in respect to employment-related matters and in the case of the union to general legal matters.\n \nGiven the fixed term nature of the role our ideal candidate is lawyer with at least 2 years PQE or relevant experience in employment law. Experience working in a trade union environment would be a benefit as is demonstrated commitment to workers’ rights.\n \nPRIMARY OBJECTIVES\n• Provide legal advice and representation to FIRST Union and union members in respect to employment-related matters and in the case of the union to general legal matters.\n• Participate in the Union’s law reform work.\n• Assist in the development of and provision of skills and knowledge training and information resources for union officials, delegates and members. \nSPECIFIC RESPONSIBILITIES\nProvide legal advice and representation to FIRST Union, it’s staff and union members in respect to employment-related matters and in the case of the union to general legal matters. \n• Provide guidance and assistance to organisers and other industrial staff with respect to legal aspects of their roles.\n• Assistance with the development and learning of organisers and other industrial staff with respect to legal matters both through formal training and assistance with day to day matters.\n• Participate, with guidance from the legal services coordinator, in managing the legal work of the union with respect to the resources available. \n*Represent the union and its members in proceedings before the Employment Relations Authority and Employment Court\n• Provide employment law advice to union officials and members and general legal advice to the union\n• Provide advocacy in mediation where the circumstances indicate that legal knowledge or dispute resolution skills are required or where t assistance the development of industrial staff. \n• Provide general legal services to the Union, including (but not limited to):\n   • Assisting where union officials are arrested or criminally charged in the course of their duties; and\n   • Assisting with matters relating to leases of union owned or occupied premises etc.\n• Allocate work between yourself and any other provider of legal services to the union in consultation with the legal services coordinator (note the general secretary will be the final decision maker in regards to allocation of legal cases.\n Participate in the Union’s law reform work.\n• Undertake law reform work on behalf of the Union as directed by the General Secretary.\n• Prepare and present submissions and papers to Parliamentary Select Committees, professional conferences and other relevant bodies or gatherings in respect of the union’s policies.\n• Participate in union, government or industry working parties on law reform issues.\nAssist in the development of and provision of skills and knowledge training and information resources for union officials, delegates and members. \n• Act as a mentor/professional supervisor to union officials required to provide advice and representation on employment relationship issues, in particular in the Member Support Centre (note this is not a line management role).\n• Assist in the development of and provision of skills and knowledge training and information resources for union officials, delegates and members\n• Provide legal information to, and assist with the ongoing legal information of union officials, delegates and members, through the Union’s education programme and its publications.\n \nGeneral Requirements \n• Prepare reports for the General Secretary, National Management Committee and National Executive as required\n• Attend and participate in staff, planning and other union meetings as required\n• Contribute to union publications\n• Comply with all FIRST Union policies and procedures, including the Staff Kaupapa\n• Participate in ongoing training and professional development\n• Develop and maintain relationships with other employment law practitioners and unionists responsible for law reform or employment law to assist in your ongoing professional development and maintenance of best practice legal methods\n \nQualifications Required \nAn LLB and admission as a solicitor in New Zealand. \nAll applications should be emailed to Jo Wilson at jo.wilson@firstunion.org.nz by 5pm on 20 April 2021."},{"title":"Inhouse - Legal Advisor","dataCreated":"2021-03-29","region":"Auckland","city":"Auckland City","employer":"Not Found","phone":"(021) 1378205","contactName":"Chris Martin","expires":"2021-04-29","type":"full time","description":"• Consult with High Profile Clients\n• Enjoy the Variety in Your New Role\n• A Fun and Engaged Team\nAbout the role:\nOur client provides Trust, Legal and Accounting Advisory Services to the property sector. \nIn this role you will:\n• Manage the supervision of property investment schemes across retail and wholesale investors.\n• Ensure compliance with contractual and regulatory obligations and to represent the best interests of investors and beneficiaries.\nSkills & experience:\nThe ideal candidate for this role will have a legal and property background with at least 2-3 years' experience.  \nBenefits\nYou will be working with likeminded team made up of lawyers and accountants who love the positive impact they can make by safeguarding New Zealand's financial services industry.\nOther reasons to work for them include:\n• A broad range of duties that span across general management, legal and consulting work.\n• A flexible approach to work which is based on delivering outcomes rather than hours in the office.\n• Long standing and stable clients with deep client relationships.\n• A leading reputation in the market\n• A fun and engaged team who all get along well. \nAbout the Company\nThis organisation has sought to both monitor compliance and support clients with their understanding of compliance regimes. A willingness to work with parties on solutions while seeking the best outcomes for stakeholders has also been a feature of this organisation's DNA.\nHow to Apply\nFor a confidential discussion please call Chris Martin on 021 137 8205 or email Chris.Martin@findrecruitment .co.nz."},{"title":"In-house Solicitor opportunity in Hawkes Bay","dataCreated":"2021-04-20","region":"Auckland","city":"Auckland City","employer":"Legal Personnel (2020) Limited","phone":"Not Found","contactName":"Legal Personnel (2020) Limited","expires":"2021-05-21","type":"full time","description":"Are you looking for a new role that you can really make your own?  This is a newly created position that will work closely with the team and with external counsel.\nWe are looking for someone with residential conveyancing and commercial experience. You will be familiar with:\n• Basic and complicated S&P docs\n• Construction\n• Subdivisions\n• Large scale Developments\n• Drafting leases\n• Providing general commercial advice\nIdeally, you will be a go-getter with a positive attitude to bring to a great team.\nI would love to hear from you if you have the experience and if this is something that interests you.  Simply email *****@legalpersonnel.co.nz or call 09 359 9244\n**NOTE: If you are looking to move to other regions, I also have roles in Tauranga and New Plymouth.\nAdditional information\n• Join a supportive and social team\n• Make the most of a newly created role in a growing business\n• Work flexible hours if you need to"},{"title":"In-house Solicitor opportunity in Hawkes Bay","dataCreated":"2021-04-20","region":"Hawke's Bay","city":"Napier","employer":"Legal Personnel","phone":"Not Found","contactName":"Legal Personnel","expires":"2021-05-21","type":"full time","description":"Location:\nHawkes Bay\nAll Hawkes Bay\nWork Type:\nFull Time\nSalary:\nto\nReference Number:\n1075909-1\nContact Details:\nSarah Bartlett\nProfession:\nLegal - Professional > Solicitor – Construction\nCompany:\nDate Posted:\n19 April 2021"},{"title":"In-house Solicitor opportunity in Hawkes Bay","dataCreated":"2021-04-20","region":"Auckland","city":"Auckland City","employer":"Legal Personnel (2020) Limited","phone":"Not Found","contactName":"Legal Personnel (2020) Limited","expires":"2021-05-21","type":"full time","description":"Are you looking for a new role that you can really make your own?  This is a newly created position that will work closely with the team and with external counsel.\nWe are looking for someone with residential conveyancing and commercial experience. You will be familiar with:\n• Basic and complicated S&P docs\n• Construction\n• Subdivisions\n• Large scale Developments\n• Drafting leases\n• Providing general commercial advice\nIdeally, you will be a go-getter with a positive attitude to bring to a great team.\nI would love to hear from you if you have the experience and if this is something that interests you.  Simply email *****@legalpersonnel.co.nz or call 09 359 9244\n**NOTE: If you are looking to move to other regions, I also have roles in Tauranga and New Plymouth.\nAdditional information\n• Join a supportive and social team\n• Make the most of a newly created role in a growing business\n• Work flexible hours if you need to"},{"title":"Legal Advisor - 6 month fixed-term opportunity","dataCreated":"2021-04-20","region":"Auckland","city":"Auckland City","employer":"Unitec","phone":"Not Found","contactName":"Unitec","expires":"2021-05-21","type":"full time","description":"At Unitec, we're passionate about the power of education to positively change the lives of our students, their whānau and wider communities. This is an exciting time to join our organisation, as the vocational education sector moves through a significant transformation period.\nWe have an opportunity for an achievement-focused lawyer to join our team on a 6 month fixed-term basis. This is a part time role for up to 25-30 hours per week (work hours are negotiable). The role will work alongside an experienced Senior Counsel, where you will have the opportunity to develop your legal skills within the ever-evolving education landscape.\nYou will have 3-5 years post-qualification experience, gained within either a comparable in-house environment or a reputable law firm. You will bring sound commercial contract skills and experience. Official Information and Privacy legislation experience is desirable.\nYou'll quickly establish yourself as a trusted legal advisor, and take a collaborative, practical and pragmatic approach. You will work closely with the Legal team at Manukau Institute of Technology (MIT) to form synergies from an overall Tāmaki Makaurau perspective.\nIn addition, you'll demonstrate:\n• Excellent interpersonal skills and the ability to engage well at all levels\n• A commercially astute and pragmatic approach\n• Solid communication and negotiation skills\n• Experience within dispute processes (litigation /arbitration / mediation) would be advantageous\n• Hold a Bachelor of Laws and a current NZ practising certificate as a Barrister and Solicitor\nProactive by nature, you'll be comfortable thinking one step ahead. You will identify legal and reputational risks and ensure they are reported and mitigated.\nYou will be joining a supportive team environment, and be based on our beautiful green Mt Albert campus. You'll receive free carparking, and have access to an on-site gym and childcare facility. If you would like to make a difference within a progressive organisation that encourages forward thinking and recognises success, please apply on-line."},{"title":"Contract In-house Legal Advisor","dataCreated":"2021-04-20","region":"Auckland","city":"Manukau City","employer":"Not Found","phone":"(021) 1378205","contactName":"Chris Martin","expires":"2021-05-21","type":"full time","description":"• 6-8 Week Contract\n• South Auckland Location\n• Immediate Start\nAbout the role:\nYou will be working as a contractor under the supervision of this Manufacture's Directors with oversight from their outsourced and highly regarded Legal Firm.  This project will involve organisation and categorisation of key agreements and contracts.  You will review for inconsistencies, missing clauses and potential contractual problem areas.  Once this review is complete you will work with an external legal firm who will take responsibility for the finished articles.  It is expected that this project will take 6-8 weeks.\nSkills & experience:\n• Legal experience with exposure to reviewing contracts and agreements.\n• Attention to detail and strong organisational skills.\n• Strong communication and relationship management skills.\n• Be available to start immediately.\nAbout the Company:\nThis firm focuses on Manufacturing for the construction industry in South Auckland.  They have a down-to-earth culture and are riding the success of their innovative products. \nHow to Apply\nTo apply for this position, submit your CV by following the link below. For a confidential discussion please call Chris Martin on 021 137 8205 or email chris.martin@findrecruitment.co.nz."},{"title":"Senior Counsel","dataCreated":"2021-04-16","region":"Auckland","city":"Auckland City","employer":"ANZ","phone":"Not Found","contactName":"ANZ","expires":"2021-05-17","type":"full time","description":"• Provide legal advice to ANZ’s Pacific businesses\nAbout The Role\nWe have an exciting opportunity for a lawyer to join our award winning and highly regarded Legal Group in New Zealand.\nANZ operates in 10 countries across the Pacific and this role focuses on working with those ANZ businesses to deliver their strategies.  Reporting to the Associate General Counsel – Pacific (who is based in Auckland, New Zealand), you will work closely with fellow New Zealand based lawyers who support ANZ Pacific as well as business stakeholders in both the Pacific and New Zealand.  Your legal advice will cover the wide range of products and services which ANZ offers to its Retail and Commercial customers in the Pacific.\nYou will be responsible for delivering quality, timely, commercially relevant and cost-effective legal advice.  You will need to ensure legal risks are clearly set out and understood by stakeholders, mitigated and that ANZ’s governance requirements are followed.\nIn this role, you will be:\n• A key participant in shaping a world where people and communities thrive\n• Join an organisation that prides itself on inclusion and diversity of people and thoughts\n• Work for an award winning and highly regarded legal team that values collaboration and innovation\nRole Location:Auckland, New Zealand\nRole Type:12 month fixed term contract\nAbout You\nTo grow and be successful in this role, you will ideally bring the following:\n• Minimum Bachelor of Laws qualification and a current New Zealand practising certificate with at least 8 years post qualification experience in a common law jurisdiction\n• Strong experience in banking and finance\n• Proven problem-solving ability and ability to provide commercial solutions-based legal services, while maintaining robust independence of legal advice\n• Demonstrable ability to gain the respect of, and influence, internal and external stakeholders.\n• Ability to work with ambiguity and to manage competing priorities\n• Excellent verbal and written communication skills in English, ability to advocate and influence and strong drafting skills\nAbout ANZ\nOur purpose is to shape a world where people and communities thrive.  That’s why we strive to create a balanced, sustainable economy in which everyone can take part and build a better life.  By helping people make the most of what they have, we transform ideas, hard work and ambition into reality.\nEveryone at ANZ has the opportunity to grow and learn.  At ANZ, we believe in the inherent strength of a vibrant, diverse and inclusive workforce where the backgrounds, perspectives and life experiences of our people help us to forge strong connections with all our customers, innovate and make better decisions for our business.\nThe ANZ values are the foundation of how we work and support our customers.\nIntegrity – Are honest and fair\nCollaboration – Work together for the customer\nAccountability – Take ownership and get things done\nRespect – Care for all those we serve\nExcellence – Challenge ourselves to be better\nWe work flexibly at ANZ. Talk to us about how this role could be flexible for you.\nANZ recognises the importance of flexible working, watch our Global Stories to see how ANZ aims to meet the needs of our customers and to attract and retain the best people in a changing world https://www.youtube.com/watch?v=aP5k74hROfw&feature=youtu.be)\nTo find out more about working at ANZ or to view other opportunities visit http://www.anz.co.nz/careers\nYou may apply for this role by visiting ANZ Careers and search for the reference number NEW044276.\nApplications close Monday, 12 April 2021.\n#GD4.1"},{"title":"Principal Legal Advisor Litigation","dataCreated":"2021-04-13","region":"Auckland","city":"Auckland City","employer":"WorkSafe New Zealand","phone":"Not Found","contactName":"WorkSafe New Zealand","expires":"2021-05-14","type":"full time","description":"• Help shape health and safety case law\n• Provide thought leadership in litigation\n• Auckland or Wellington based\nWorkSafe New Zealand | Mahi Haumaru Aotearoa are seeking a Principal Legal Advisor (Litigation) to join our Legal Group.  The Legal Group provides legal advice and support across WorkSafe, including to its Chief Executive, Executive Leadership Team, and the Board.  A significant part of our work involves prosecutions under health and safety legislation.\nIn this role, you'll have the opportunity to be involved in litigation that shapes case law in health and safety.  Reporting to the Chief Legal Advisor, you will be responsible for:\n• providing thought leadership in WorkSafe's litigation activity across our Auckland and Wellington offices\n• conducting contentious and often complex prosecutions\n• providing advanced technical legal advice\n• contributing to the development of systems and processes to enhance the Group's effectiveness.\nIdeally you will have:\n• extensive experience as a criminal litigator - preferably including in the area of health and safety (or a proven passion and motivation to make a difference in this area).\n• the ability to identify and proactively respond to emerging issues.\n• the capacity to contribute to the legal team at a senior level and to act as a mentor to others.\n• a current practising certificate with admission as a Barrister and Solicitor of the High Court.\n• a Level 3 classification under the Crown Law Office Framework for Prosecutor Classification of In-house Lawyers (or meet the requirements to obtain such classification).\nAbout WorkSafe New Zealand\nWorkSafe New Zealand, Mahi Haumaru Aotearoa, is the primary workplace health and safety regulator - our vision is that everyone who goes to work comes home healthy and safe.  Our people are passionate about our vision and embrace and demonstrate our WorkSafe Values - Ngā Mātāpono:\n• Whakakotahi - we're united in a strong purpose\n• Kōrero mai - we engage meaningfully\n• Tiakina mai - we're entrusted with a duty of care.\nWorkSafe offer a range of benefits including free life, trauma and income protection insurances, discounts on health insurance and eye care, four weeks annual leave plus three days WorkSafe leave, and learning and professional development opportunities. We operate on a flexible by default basis, allowing you and your manager to create a flexible work experience that supports you and the business to succeed.\nThere are a range of networks you can become part of, such as our Te Rōpū Atuapiko Rainbow Network, WorkSafe Wahine Women's Network and our Kapa Haka group.\nHow to apply\nClick the apply link, complete an application form and submit a copy of your CV and cover letter.\nFor further information please contact *******@worksafe.govt.nz with any queries, or to find out more about WorkSafe New Zealand go to www.worksafe.govt.nz\nApplications close on Monday 26 April 2021.\n​"},{"title":"Legal & Compliance Officer","dataCreated":"2021-04-13","region":"Auckland","city":"Auckland City","employer":"Aon Corporation","phone":"Not Found","contactName":"Aon Corporation","expires":"2021-05-14","type":"full time","description":"• Play a key part in driving compliance with regulation\n• Be an integral part of a highly respected team\n• Long-term career progression available\nThe Opportunity\nAon currently has a rare opportunity to join our Auckland CBD head office as a Legal & Compliance Officer reporting into Senior Legal and Compliance Counsel.\nThis varied role would see you joining our Legal & Compliance team where you will provide support regarding basic legal drafting, corporate governance, risk management, and compliance assurance.\nIn addition, you would be accountable for:\n• Assisting with the implementation of key risk and compliance workstreams\n• Monitoring organisational operations and providing compliance information regarding legal and regulatory requirements\n• Analysing and reporting on breaches and complaints, then presenting findings to governance committees and management\n• Assisting with Anti-Money Laundering (AML) compliance, including reviewing monthly reporting and escalating matters as appropriate\n• Building effective working relationships with internal and external stakeholders across Asia Pacific and maintaining current knowledge of developments within compliance and risk management\n• Assisting in the drafting and negotiation of a range of straight forward everyday commercial contracts.\nAbout you\nTo be successful in this role, you would ideally have some Legal and/or Compliance experience in a commercial environment, preferably within financial services. You should be comfortable working on compliance, risk, or assurance programmes and have a working knowledge of NZ regulations. We are also looking for someone who has legal drafting experience (or would be willing to learn).\nYou should also demonstrate the following:\n• The ability to identify systemic issues and coordinate an appropriate response\n• An ability to partner with the business to influence a culture of compliance and risk awareness\n• Excellent written and verbal communication skills\n• Effective report writing and presentation skills, including presenting to senior stakeholders\n• An analytical mindset and the ability to work under pressure to manage conflicting deadlines.\nA law degree, while advantageous, is not a requirement for this role.\nIf you are looking for an opportunity to advance your legal and compliance career with a global insurance brand, apply today!\nAon Culture & Benefits\nAt Aon, we provide colleagues with the support to make a positive impact together with ongoing opportunities for development, including the support of a team which will continually inspire you to achieve your best.\nWe currently have approximately 900 employees in New Zealand. Globally, we have an employee base of 50,000 people, working across 120 countries. This allows us to build the best teams and gather the best thinking from around the world to deliver quality solutions and service locally.\nAon is an equal opportunity employer and we invite you to be part of an organisation that has a diverse workplace, values continuous learning and supports many charities and environmental initiatives."},{"title":"Principal Legal Advisor Litigation","dataCreated":"2021-04-13","region":"Wellington","city":"Wellington","employer":"WorkSafe New Zealand","phone":"Not Found","contactName":"WorkSafe New Zealand","expires":"2021-05-14","type":"full time","description":"• Help shape health and safety case law\n• Provide thought leadership in litigation\n• Auckland or Wellington based\nWorkSafe New Zealand | Mahi Haumaru Aotearoa are seeking a Principal Legal Advisor (Litigation) to join our Legal Group.  The Legal Group provides legal advice and support across WorkSafe, including to its Chief Executive, Executive Leadership Team, and the Board.  A significant part of our work involves prosecutions under health and safety legislation.\nIn this role, you'll have the opportunity to be involved in litigation that shapes case law in health and safety.  Reporting to the Chief Legal Advisor, you will be responsible for:\n• providing thought leadership in WorkSafe's litigation activity across our Auckland and Wellington offices\n• conducting contentious and often complex prosecutions\n• providing advanced technical legal advice\n• contributing to the development of systems and processes to enhance the Group's effectiveness.\nIdeally you will have:\n• extensive experience as a criminal litigator - preferably including in the area of health and safety (or a proven passion and motivation to make a difference in this area).\n• the ability to identify and proactively respond to emerging issues.\n• the capacity to contribute to the legal team at a senior level and to act as a mentor to others.\n• a current practising certificate with admission as a Barrister and Solicitor of the High Court.\n• a Level 3 classification under the Crown Law Office Framework for Prosecutor Classification of In-house Lawyers (or meet the requirements to obtain such classification).\nAbout WorkSafe New Zealand\nWorkSafe New Zealand, Mahi Haumaru Aotearoa, is the primary workplace health and safety regulator - our vision is that everyone who goes to work comes home healthy and safe.  Our people are passionate about our vision and embrace and demonstrate our WorkSafe Values - Ngā Mātāpono:\n• Whakakotahi - we're united in a strong purpose\n• Kōrero mai - we engage meaningfully\n• Tiakina mai - we're entrusted with a duty of care.\nWorkSafe offer a range of benefits including free life, trauma and income protection insurances, discounts on health insurance and eye care, four weeks annual leave plus three days WorkSafe leave, and learning and professional development opportunities. We operate on a flexible by default basis, allowing you and your manager to create a flexible work experience that supports you and the business to succeed.\nThere are a range of networks you can become part of, such as our Te Rōpū Atuapiko Rainbow Network, WorkSafe Wahine Women's Network and our Kapa Haka group.\nHow to apply\nClick the apply link, complete an application form and submit a copy of your CV and cover letter.\nFor further information please contact *******@worksafe.govt.nz with any queries, or to find out more about WorkSafe New Zealand go to www.worksafe.govt.nz\nApplications close on Monday 26 April 2021.\n​"},{"title":"Legal Counsel - Hastings","dataCreated":"2021-04-11","region":"Hawke's Bay","city":"Hastings","employer":"T&G Global","phone":"Not Found","contactName":"T&G Global","expires":"2021-05-12","type":"full time","description":"A bit about us\nCome and grow your world with T&G! We are fresh food lovers who constantly strive to grow our world by maintaining year-round freshness and provide a healthier lifestyle for everyone we share the planet with.\nAs one of New Zealand's largest vertically integrated growing, packing, shipping and marketing companies, we have the people, structure and brands to further support the global communities which we operate in and provide a return for all stakeholders.\nAbout the position\nIn this in-house role you will provide timely and commercially sound legal advice to the business and assist the business with property and commercial transactions including management of the company's orchard leases. Based in Hawke's Bay, you will be significantly involved in T&G's apples business and provide advice and support to the Operations team. This is a varied role where you will be involved in the following:\n• Drafting and providing advice on interpretation of existing leases, renewal of leases, rent reviews and commercial contracts\n• Maintain a contract register and ensure compliance with commercial terms and conditions of commercial contracts\n• OIO Applications and reporting - drafting (with external advice as needed) OIO applications and report annually on T&G's current conditions of consent\n• Assist the property and procurement team with new contracts and interpretation of existing contracts\n• Assist the Legal Counsel with general corporate, commercial and operational legal matters\nWhat we are looking for\nOur ideal candidate will be a team player with a proactive attitude. You will be able to demonstrate the following:\n• LLB degree with a current practising certificate and a minimum of 2 years PQE demonstrated commercial and property experience\n• Excellent statutory interpretation and legal research skills along with analytical and problem-solving skills\n• Strong statutory compliance/risk management\n• Strong attention to detail and an enquiring analytical approach to problem solving\n• Conceptual and critical thinking\n• Excellent time management skills and the ability to meet deadlines\n• Experience in Microsoft applications including Word and Excel\nOur mindsets are: Grounded, Resilient, Open & Winning. We are looking for someone who can embody these mindsets, someone who is passionate about taking ownership of their role and wanting to make a difference at T&G."},{"title":"Legal Advisor - Hastings","dataCreated":"2021-04-10","region":"Hawke's Bay","city":"Hastings","employer":"Turners & Growers (T&G Global)","phone":"Not Found","contactName":"Turners & Growers (T&G Global)","expires":"2021-05-11","type":"full time","description":"A bit about us\nCome and grow your world with T&G!  We are fresh food lovers who constantly strive to grow our world by maintaining year-round freshness and provide a healthier lifestyle for everyone we share the planet with.\nAs one of New Zealand's largest vertically integrated growing, packing, shipping and marketing companies, we have the people, structure and brands to further support the global communities which we operate in and provide a return for all stakeholders.\nAbout the position\nReporting to the Legal Counsel, r you will provide timely and commercially sound legal advice to the business and assist the business with property and commercial transactions including management of the company's orchard leases.  Based in Hawke's Bay, you will be significantly involved in T&G's apples business and provide advice and support to the Operations team.    This is a varied role where you will be involved in the following:\n• Drafting and providing advice on interpretation of existing leases, renewal of leases, rent reviews and commercial contracts\n• Maintain a contract register and ensure compliance with commercial terms and conditions of commercial contracts\n• OIO Applications and reporting - drafting (with external advice as needed) OIO applications and report annually on T&G's current conditions of consent\n• Assist the property and procurement team with new contracts and interpretation of existing contracts\n• Assist the Legal Counsel with general corporate, commercial and operational legal matters\nWhat we are looking for\nOur ideal candidate will be a team player with a proactive attitude.  You will be able to demonstrate the following:\n• LLB degree with a current practising certificate and a minimum of 5 years PQE demonstrated commercial and property experience\n• Excellent statutory interpretation and legal research skills along with analytical and problem-solving skills\n• Strong statutory compliance/risk management\n• Strong attention to detail and an enquiring analytical approach to problem solving\n• Conceptual and critical thinking\n• Excellent time management skills and the ability to meet deadlines\n• Experience in Microsoft applications including Word and Excel\nOur mindsets are: Grounded, Resilient, Open & Winning.  We are looking for someone who can embody these mindsets, someone who is passionate about taking ownership of their role and wanting to make a difference at T&G."},{"title":"Legal Advisor","dataCreated":"2021-04-08","region":"Auckland","city":"Auckland City","employer":"Institution of Professional Engineers New Zealand","phone":"Not Found","contactName":"Institution of Professional Engineers New Zealand","expires":"2021-05-09","type":"full time","description":"Engineering New Zealand’s legal team manages the organisation’s professional discipline process, investigating complaints made about engineers. The team also provides day-to-day in-house legal services, works with government departments on projects of national significance, and understands the challenges of delivering to widening public expectations. In 2019 the team was awarded the Chapman Tripp In-house Team of the Year for their innovative and transformative work.\nEngineering New Zealand is the professional home for all engineers in New Zealand. But it’s not your average membership organisation. We’re committed to thinking differently, always challenging the norm, and creating beautiful experiences for our people, members and stakeholders.\nOur team is growing and we have a new opportunity for a well-rounded early-stage lawyer. We've also recently promoted some of our people and are seeking a Senior Legal Advisor, this role has been advertised separately.\nThis interesting and challenging role encompasses complaints management, general legal advice, and taking a leading role in other projects that arise, such as Engineering New Zealand’s services supporting the resolution of outstanding earthquake insurance claims in Greater Christchurch.\nReporting to the Legal Manager and supported by a stellar team, you will receive first-class mentoring on which to build your legal career.\nIf this is of interest to you, you will be well-placed if you possess\n•  Exemplary written and oral communication skills\n•  Outstanding relationship management skills\n•  Empathy and pragmatism\n•  A collaborative approach to your work\n•  Adaptability and flexibility\n•  Ability to see the bigger picture\nEngineering New Zealand offers fabulous new offices in a great part of the CBD. The successful candidate will enjoy competitive remuneration along with genuine work/life balance.\nAPPLY NOW, including a cover letter, CV, and a copy of your academic transcript or contact **@engineeringnz.org to find out more about this opportunity."},{"title":"Legal Counsel/Senior Legal Counsel","dataCreated":"2021-04-08","region":"Canterbury","city":"Christchurch City","employer":"Tait Communications","phone":"Not Found","contactName":"Tait Communications","expires":"2021-05-09","type":"full time","description":"Tait Communications have an exciting opportunity in their Christchurch Head Office, for a Legal Counsel/Senior Legal Counsel to join the Legal and Commercial team on a fixed-term basis, to cover a parental leave.\nThis is a cross-functional role with a global focus, working as part of a team that is responsible for providing both commercial and legal support for business as usual activities, as well as specific projects.\nReporting to the General Counsel, this role will provide opportunities to learn, take on responsibility for a variety of tasks, engage with a range of functions across the organisation, and work closely with our Management and Leadership teams. To find out more about the role, please view the attached job description.\nWe're open to considering candidates with a range of experiences, whether in the early stages of your career development post completing your Bachelor of Law, or at a more senior level there is scope to tailor the role to suit your skills and experience.\nThe ideal candidate will be someone who has good practical legal skills, is willing and able to learn, can comfortably communicate with stakeholders at all levels of the business, and has a positive, can-do attitude.\nWe are open to discussing flexible working patterns, however as this is a busy role, to be successful a minimum 30-hour week working pattern is preferred.\nAbout the company\nOur clients protect communities, power cities, move citizens, harness resources and save lives all over the world. We work with them to create and support the critical communication solutions they depend on to do their jobs.\nWhile the corporate functions are mainly based in Christchurch, New Zealand, the company prides itself on its international customer base and global support network with regional offices in Brisbane (Australia), Cambridge (UK), and Houston (USA), and a network of sales/support offices, dealers, system integrators and consultants across many other parts of the world.\nFor more information about the company, our products and solutions offered to our customers, please visit our website www.taitradio.com\nIf this sounds like you, apply now with your CV and cover letter.\nApplications will close Wednesday, 21 April 2021."},{"title":"Community Solicitor","dataCreated":"2021-03-30","region":"Bay Of Plenty","city":"Rotorua","employer":"QJumpers Recruitment Services","phone":"Not Found","contactName":"QJumpers Recruitment Services","expires":"2021-04-29","type":"full time","description":"This is your opportunity to give back to our surrounding communities in a fulfilling and very important legal capacity. \nRotorua District Community Law Centre is a member of our national body Community Law Centres o Aotearoa (CLCA). We provide community law services Rotorua through to Taupō to fulfil the unmet legal needs of people in this the region.\nWe are seeking a Solicitor to join our small team in Rotorua. While the position is nominally full-time we are open to considering part-time for the right applicant. \nResponsibilities:\n  • Provide free legal advice, assistance, representation, information and education to clients throughout the Rotorua/Murupara/Taupo areas. \n  • Develop a positive working relationship with your clients that is cognisant of Te Tiriti Waitangi partnerships and respectful of ethnicity, gender, beliefs, age, background, socio economic status and individual differences.\n  • Provide a proactive high quality legal service to clients and ensure their needs are fully understood and their issue is progressed in a professional, ethical and timely manner.\n  • Manage a full case load efficiently and effectively.\n  • Refer clients appropriately to assist in meeting their legal needs if they cannot be met by Rotorua District Community Law Centre services.\n  • Assist with legal education programmes which includes preparation and presentation of information to the public at legal education seminars.\n  • Guidance and support of legal staff along with collaboration, cooperation and maintaining effective team relationships.\n  • Networking and promotion - raising the profile of the RDCLC services in our communities. \nAbout you:\n  • Hold a New Zealand recognised law degree and current practising certificate.\n  • Good generalist post-graduation legal experience, ideally in employment law. \n  • Proven ability to value diversity, work with people of different backgrounds and abilities and support people in an empowering and non-judgemental way. \n  • Current driver's licence with a reliable vehicle. \n  • Use your qualifications, knowledge and experience to make a real difference for people by accessing justice. \nYou are welcome to contact Ellie Herbert, Manager, Rotorua District Community Law Centre on (07) 348 8060 or ellie.herbert@rdclc.co.nz for a confidential and no obligation discussion about this role. \nOtherwise please apply online or email your CV to kathryn@qjumpers.co.nz."}]