{"title":"Legal Advisor","dataCreated":"2021-04-08","region":"Auckland","city":"Auckland City","employer":"Institution of Professional Engineers New Zealand","phone":"Not Found","contactName":"Institution of Professional Engineers New Zealand","expires":"2021-05-09","type":"full time","description":"Engineering New Zealand’s legal team manages the organisation’s professional discipline process, investigating complaints made about engineers. The team also provides day-to-day in-house legal services, works with government departments on projects of national significance, and understands the challenges of delivering to widening public expectations. In 2019 the team was awarded the Chapman Tripp In-house Team of the Year for their innovative and transformative work.\nEngineering New Zealand is the professional home for all engineers in New Zealand. But it’s not your average membership organisation. We’re committed to thinking differently, always challenging the norm, and creating beautiful experiences for our people, members and stakeholders.\nOur team is growing and we have a new opportunity for a well-rounded early-stage lawyer. We've also recently promoted some of our people and are seeking a Senior Legal Advisor, this role has been advertised separately.\nThis interesting and challenging role encompasses complaints management, general legal advice, and taking a leading role in other projects that arise, such as Engineering New Zealand’s services supporting the resolution of outstanding earthquake insurance claims in Greater Christchurch.\nReporting to the Legal Manager and supported by a stellar team, you will receive first-class mentoring on which to build your legal career.\nIf this is of interest to you, you will be well-placed if you possess\n•  Exemplary written and oral communication skills\n•  Outstanding relationship management skills\n•  Empathy and pragmatism\n•  A collaborative approach to your work\n•  Adaptability and flexibility\n•  Ability to see the bigger picture\nEngineering New Zealand offers fabulous new offices in a great part of the CBD. The successful candidate will enjoy competitive remuneration along with genuine work/life balance.\nAPPLY NOW, including a cover letter, CV, and a copy of your academic transcript or contact **@engineeringnz.org to find out more about this opportunity."}