{"title":"Community Solicitor","dataCreated":"2021-03-30","region":"Bay Of Plenty","city":"Rotorua","employer":"QJumpers Recruitment Services","phone":"Not Found","contactName":"QJumpers Recruitment Services","expires":"2021-04-29","type":"full time","description":"This is your opportunity to give back to our surrounding communities in a fulfilling and very important legal capacity. \nRotorua District Community Law Centre is a member of our national body Community Law Centres o Aotearoa (CLCA). We provide community law services Rotorua through to Taupō to fulfil the unmet legal needs of people in this the region.\nWe are seeking a Solicitor to join our small team in Rotorua. While the position is nominally full-time we are open to considering part-time for the right applicant. \nResponsibilities:\n  • Provide free legal advice, assistance, representation, information and education to clients throughout the Rotorua/Murupara/Taupo areas. \n  • Develop a positive working relationship with your clients that is cognisant of Te Tiriti Waitangi partnerships and respectful of ethnicity, gender, beliefs, age, background, socio economic status and individual differences.\n  • Provide a proactive high quality legal service to clients and ensure their needs are fully understood and their issue is progressed in a professional, ethical and timely manner.\n  • Manage a full case load efficiently and effectively.\n  • Refer clients appropriately to assist in meeting their legal needs if they cannot be met by Rotorua District Community Law Centre services.\n  • Assist with legal education programmes which includes preparation and presentation of information to the public at legal education seminars.\n  • Guidance and support of legal staff along with collaboration, cooperation and maintaining effective team relationships.\n  • Networking and promotion - raising the profile of the RDCLC services in our communities. \nAbout you:\n  • Hold a New Zealand recognised law degree and current practising certificate.\n  • Good generalist post-graduation legal experience, ideally in employment law. \n  • Proven ability to value diversity, work with people of different backgrounds and abilities and support people in an empowering and non-judgemental way. \n  • Current driver's licence with a reliable vehicle. \n  • Use your qualifications, knowledge and experience to make a real difference for people by accessing justice. \nYou are welcome to contact Ellie Herbert, Manager, Rotorua District Community Law Centre on (07) 348 8060 or ellie.herbert@rdclc.co.nz for a confidential and no obligation discussion about this role. \nOtherwise please apply online or email your CV to kathryn@qjumpers.co.nz."}