{"title":"Legal Advisor - Hastings","dataCreated":"2021-04-10","region":"Hawke's Bay","city":"Hastings","employer":"Turners & Growers (T&G Global)","phone":"Not Found","contactName":"Turners & Growers (T&G Global)","expires":"2021-05-11","type":"full time","description":"A bit about us\nCome and grow your world with T&G!  We are fresh food lovers who constantly strive to grow our world by maintaining year-round freshness and provide a healthier lifestyle for everyone we share the planet with.\nAs one of New Zealand's largest vertically integrated growing, packing, shipping and marketing companies, we have the people, structure and brands to further support the global communities which we operate in and provide a return for all stakeholders.\nAbout the position\nReporting to the Legal Counsel, r you will provide timely and commercially sound legal advice to the business and assist the business with property and commercial transactions including management of the company's orchard leases.  Based in Hawke's Bay, you will be significantly involved in T&G's apples business and provide advice and support to the Operations team.    This is a varied role where you will be involved in the following:\n• Drafting and providing advice on interpretation of existing leases, renewal of leases, rent reviews and commercial contracts\n• Maintain a contract register and ensure compliance with commercial terms and conditions of commercial contracts\n• OIO Applications and reporting - drafting (with external advice as needed) OIO applications and report annually on T&G's current conditions of consent\n• Assist the property and procurement team with new contracts and interpretation of existing contracts\n• Assist the Legal Counsel with general corporate, commercial and operational legal matters\nWhat we are looking for\nOur ideal candidate will be a team player with a proactive attitude.  You will be able to demonstrate the following:\n• LLB degree with a current practising certificate and a minimum of 5 years PQE demonstrated commercial and property experience\n• Excellent statutory interpretation and legal research skills along with analytical and problem-solving skills\n• Strong statutory compliance/risk management\n• Strong attention to detail and an enquiring analytical approach to problem solving\n• Conceptual and critical thinking\n• Excellent time management skills and the ability to meet deadlines\n• Experience in Microsoft applications including Word and Excel\nOur mindsets are: Grounded, Resilient, Open & Winning.  We are looking for someone who can embody these mindsets, someone who is passionate about taking ownership of their role and wanting to make a difference at T&G."}