{"title":"Legal Advisor - 6 month fixed-term opportunity","dataCreated":"2021-04-20","region":"Auckland","city":"Auckland City","employer":"Unitec","phone":"Not Found","contactName":"Unitec","expires":"2021-05-21","type":"full time","description":"At Unitec, we're passionate about the power of education to positively change the lives of our students, their whānau and wider communities. This is an exciting time to join our organisation, as the vocational education sector moves through a significant transformation period.\nWe have an opportunity for an achievement-focused lawyer to join our team on a 6 month fixed-term basis. This is a part time role for up to 25-30 hours per week (work hours are negotiable). The role will work alongside an experienced Senior Counsel, where you will have the opportunity to develop your legal skills within the ever-evolving education landscape.\nYou will have 3-5 years post-qualification experience, gained within either a comparable in-house environment or a reputable law firm. You will bring sound commercial contract skills and experience. Official Information and Privacy legislation experience is desirable.\nYou'll quickly establish yourself as a trusted legal advisor, and take a collaborative, practical and pragmatic approach. You will work closely with the Legal team at Manukau Institute of Technology (MIT) to form synergies from an overall Tāmaki Makaurau perspective.\nIn addition, you'll demonstrate:\n• Excellent interpersonal skills and the ability to engage well at all levels\n• A commercially astute and pragmatic approach\n• Solid communication and negotiation skills\n• Experience within dispute processes (litigation /arbitration / mediation) would be advantageous\n• Hold a Bachelor of Laws and a current NZ practising certificate as a Barrister and Solicitor\nProactive by nature, you'll be comfortable thinking one step ahead. You will identify legal and reputational risks and ensure they are reported and mitigated.\nYou will be joining a supportive team environment, and be based on our beautiful green Mt Albert campus. You'll receive free carparking, and have access to an on-site gym and childcare facility. If you would like to make a difference within a progressive organisation that encourages forward thinking and recognises success, please apply on-line."}