{"title":"Legal & Compliance Officer","dataCreated":"2021-04-13","region":"Auckland","city":"Auckland City","employer":"Aon Corporation","phone":"Not Found","contactName":"Aon Corporation","expires":"2021-05-14","type":"full time","description":"• Play a key part in driving compliance with regulation\n• Be an integral part of a highly respected team\n• Long-term career progression available\nThe Opportunity\nAon currently has a rare opportunity to join our Auckland CBD head office as a Legal & Compliance Officer reporting into Senior Legal and Compliance Counsel.\nThis varied role would see you joining our Legal & Compliance team where you will provide support regarding basic legal drafting, corporate governance, risk management, and compliance assurance.\nIn addition, you would be accountable for:\n• Assisting with the implementation of key risk and compliance workstreams\n• Monitoring organisational operations and providing compliance information regarding legal and regulatory requirements\n• Analysing and reporting on breaches and complaints, then presenting findings to governance committees and management\n• Assisting with Anti-Money Laundering (AML) compliance, including reviewing monthly reporting and escalating matters as appropriate\n• Building effective working relationships with internal and external stakeholders across Asia Pacific and maintaining current knowledge of developments within compliance and risk management\n• Assisting in the drafting and negotiation of a range of straight forward everyday commercial contracts.\nAbout you\nTo be successful in this role, you would ideally have some Legal and/or Compliance experience in a commercial environment, preferably within financial services. You should be comfortable working on compliance, risk, or assurance programmes and have a working knowledge of NZ regulations. We are also looking for someone who has legal drafting experience (or would be willing to learn).\nYou should also demonstrate the following:\n• The ability to identify systemic issues and coordinate an appropriate response\n• An ability to partner with the business to influence a culture of compliance and risk awareness\n• Excellent written and verbal communication skills\n• Effective report writing and presentation skills, including presenting to senior stakeholders\n• An analytical mindset and the ability to work under pressure to manage conflicting deadlines.\nA law degree, while advantageous, is not a requirement for this role.\nIf you are looking for an opportunity to advance your legal and compliance career with a global insurance brand, apply today!\nAon Culture & Benefits\nAt Aon, we provide colleagues with the support to make a positive impact together with ongoing opportunities for development, including the support of a team which will continually inspire you to achieve your best.\nWe currently have approximately 900 employees in New Zealand. Globally, we have an employee base of 50,000 people, working across 120 countries. This allows us to build the best teams and gather the best thinking from around the world to deliver quality solutions and service locally.\nAon is an equal opportunity employer and we invite you to be part of an organisation that has a diverse workplace, values continuous learning and supports many charities and environmental initiatives."}