{"title":"Legal Officer (0.7eft)","dataCreated":"2021-04-19","region":"Wellington","city":"Wellington","employer":"PSA Te Pūkenga Here Tikanga Mahi","phone":"(027) 2137185","contactName":"Liz Byron","expires":"2021-05-20","type":"part time","description":"Legal Officer (0.7fte) Vacancy\nThe PSA Te Pūkenga Here Tikanga Mahi is the largest union in New Zealand, Aotearoa and is an innovative and dynamic organisation employing 180 staff throughout New Zealand. We have more than 78,000 members working in central and local government, health and community services. The focus of the PSA is to advance the rights and conditions of members through building collectivity in the workplace.  The PSA takes a strategic approach to building unionism.\nThe PSA has a vacancy for an Legal Officer to join our 3-person legal team. This is a part-time 0.7fte permanent position preferably based in our Wellington office.\nThe Legal Officer (0.7 fte) will be expected to practice in all aspects of employment law, including  providing advice, presenting internal legal training sessions, attending mediation, and appearing in the Employment Relations Authority and the Employment Court when necessary.   We are looking for a person who is politically astute and supportive of the union movement, experienced in the application of employment law, committed to improving the quality of members’ working lives and is able to travel throughout New Zealand.   The legal officer will have the ability to hold a current practising certificate.\nWe are looking for someone who can work well with other members of the legal team and with other PSA staff. \nThe PSA is committed to honouring the principles of Te Tiriti o Waitangi pursuant to the purpose and objects of the union. Knowledge of te reo and tikanga Māori will be considered an asset.\nThe PSA is also an EEO employer.\nPlease download the following documents if you would like to apply:\nLegal Officer JD October 2020\nPSA Application Form\nFor any queries you can contact Liz Byron, Executive Assistant to the National Secretaries on 04-816 5036 or email liz.byron@psa.org.nz.\nApplications close 5.00pm on Friday 30 April 2021."}