{"title":"Solicitor","dataCreated":"2021-04-15","region":"Wellington","city":"Wellington","employer":"FIRST Union","phone":"(09) 6228436","contactName":"Jo Wilson","expires":"2021-05-16","type":"full time","description":"The union is looking to appoint a full-time fixed-term solicitor based out of the Wellington office from 26 April 2021 to fill in for a staff member who is on secondment until October.  The purpose of the role is to work constructively with the legal team and provide legal advice and representation to FIRST Union and union members in respect to employment-related matters and in the case of the union to general legal matters.\n \nGiven the fixed term nature of the role our ideal candidate is lawyer with at least 2 years PQE or relevant experience in employment law. Experience working in a trade union environment would be a benefit as is demonstrated commitment to workers’ rights.\n \nPRIMARY OBJECTIVES\n• Provide legal advice and representation to FIRST Union and union members in respect to employment-related matters and in the case of the union to general legal matters.\n• Participate in the Union’s law reform work.\n• Assist in the development of and provision of skills and knowledge training and information resources for union officials, delegates and members. \nSPECIFIC RESPONSIBILITIES\nProvide legal advice and representation to FIRST Union, it’s staff and union members in respect to employment-related matters and in the case of the union to general legal matters. \n• Provide guidance and assistance to organisers and other industrial staff with respect to legal aspects of their roles.\n• Assistance with the development and learning of organisers and other industrial staff with respect to legal matters both through formal training and assistance with day to day matters.\n• Participate, with guidance from the legal services coordinator, in managing the legal work of the union with respect to the resources available. \n*Represent the union and its members in proceedings before the Employment Relations Authority and Employment Court\n• Provide employment law advice to union officials and members and general legal advice to the union\n• Provide advocacy in mediation where the circumstances indicate that legal knowledge or dispute resolution skills are required or where t assistance the development of industrial staff. \n• Provide general legal services to the Union, including (but not limited to):\n   • Assisting where union officials are arrested or criminally charged in the course of their duties; and\n   • Assisting with matters relating to leases of union owned or occupied premises etc.\n• Allocate work between yourself and any other provider of legal services to the union in consultation with the legal services coordinator (note the general secretary will be the final decision maker in regards to allocation of legal cases.\n Participate in the Union’s law reform work.\n• Undertake law reform work on behalf of the Union as directed by the General Secretary.\n• Prepare and present submissions and papers to Parliamentary Select Committees, professional conferences and other relevant bodies or gatherings in respect of the union’s policies.\n• Participate in union, government or industry working parties on law reform issues.\nAssist in the development of and provision of skills and knowledge training and information resources for union officials, delegates and members. \n• Act as a mentor/professional supervisor to union officials required to provide advice and representation on employment relationship issues, in particular in the Member Support Centre (note this is not a line management role).\n• Assist in the development of and provision of skills and knowledge training and information resources for union officials, delegates and members\n• Provide legal information to, and assist with the ongoing legal information of union officials, delegates and members, through the Union’s education programme and its publications.\n \nGeneral Requirements \n• Prepare reports for the General Secretary, National Management Committee and National Executive as required\n• Attend and participate in staff, planning and other union meetings as required\n• Contribute to union publications\n• Comply with all FIRST Union policies and procedures, including the Staff Kaupapa\n• Participate in ongoing training and professional development\n• Develop and maintain relationships with other employment law practitioners and unionists responsible for law reform or employment law to assist in your ongoing professional development and maintenance of best practice legal methods\n \nQualifications Required \nAn LLB and admission as a solicitor in New Zealand. \nAll applications should be emailed to Jo Wilson at jo.wilson@firstunion.org.nz by 5pm on 20 April 2021."}