{"title":"Senior Counsel","dataCreated":"2021-04-16","region":"Auckland","city":"Auckland City","employer":"ANZ","phone":"Not Found","contactName":"ANZ","expires":"2021-05-17","type":"full time","description":"• Provide legal advice to ANZ’s Pacific businesses\nAbout The Role\nWe have an exciting opportunity for a lawyer to join our award winning and highly regarded Legal Group in New Zealand.\nANZ operates in 10 countries across the Pacific and this role focuses on working with those ANZ businesses to deliver their strategies.  Reporting to the Associate General Counsel – Pacific (who is based in Auckland, New Zealand), you will work closely with fellow New Zealand based lawyers who support ANZ Pacific as well as business stakeholders in both the Pacific and New Zealand.  Your legal advice will cover the wide range of products and services which ANZ offers to its Retail and Commercial customers in the Pacific.\nYou will be responsible for delivering quality, timely, commercially relevant and cost-effective legal advice.  You will need to ensure legal risks are clearly set out and understood by stakeholders, mitigated and that ANZ’s governance requirements are followed.\nIn this role, you will be:\n• A key participant in shaping a world where people and communities thrive\n• Join an organisation that prides itself on inclusion and diversity of people and thoughts\n• Work for an award winning and highly regarded legal team that values collaboration and innovation\nRole Location:Auckland, New Zealand\nRole Type:12 month fixed term contract\nAbout You\nTo grow and be successful in this role, you will ideally bring the following:\n• Minimum Bachelor of Laws qualification and a current New Zealand practising certificate with at least 8 years post qualification experience in a common law jurisdiction\n• Strong experience in banking and finance\n• Proven problem-solving ability and ability to provide commercial solutions-based legal services, while maintaining robust independence of legal advice\n• Demonstrable ability to gain the respect of, and influence, internal and external stakeholders.\n• Ability to work with ambiguity and to manage competing priorities\n• Excellent verbal and written communication skills in English, ability to advocate and influence and strong drafting skills\nAbout ANZ\nOur purpose is to shape a world where people and communities thrive.  That’s why we strive to create a balanced, sustainable economy in which everyone can take part and build a better life.  By helping people make the most of what they have, we transform ideas, hard work and ambition into reality.\nEveryone at ANZ has the opportunity to grow and learn.  At ANZ, we believe in the inherent strength of a vibrant, diverse and inclusive workforce where the backgrounds, perspectives and life experiences of our people help us to forge strong connections with all our customers, innovate and make better decisions for our business.\nThe ANZ values are the foundation of how we work and support our customers.\nIntegrity – Are honest and fair\nCollaboration – Work together for the customer\nAccountability – Take ownership and get things done\nRespect – Care for all those we serve\nExcellence – Challenge ourselves to be better\nWe work flexibly at ANZ. Talk to us about how this role could be flexible for you.\nANZ recognises the importance of flexible working, watch our Global Stories to see how ANZ aims to meet the needs of our customers and to attract and retain the best people in a changing world https://www.youtube.com/watch?v=aP5k74hROfw&feature=youtu.be)\nTo find out more about working at ANZ or to view other opportunities visit http://www.anz.co.nz/careers\nYou may apply for this role by visiting ANZ Careers and search for the reference number NEW044276.\nApplications close Monday, 12 April 2021.\n#GD4.1"}