{"title":"Principal Legal Advisor Litigation","dataCreated":"2021-04-13","region":"Auckland","city":"Auckland City","employer":"WorkSafe New Zealand","phone":"Not Found","contactName":"WorkSafe New Zealand","expires":"2021-05-14","type":"full time","description":"• Help shape health and safety case law\n• Provide thought leadership in litigation\n• Auckland or Wellington based\nWorkSafe New Zealand | Mahi Haumaru Aotearoa are seeking a Principal Legal Advisor (Litigation) to join our Legal Group.  The Legal Group provides legal advice and support across WorkSafe, including to its Chief Executive, Executive Leadership Team, and the Board.  A significant part of our work involves prosecutions under health and safety legislation.\nIn this role, you'll have the opportunity to be involved in litigation that shapes case law in health and safety.  Reporting to the Chief Legal Advisor, you will be responsible for:\n• providing thought leadership in WorkSafe's litigation activity across our Auckland and Wellington offices\n• conducting contentious and often complex prosecutions\n• providing advanced technical legal advice\n• contributing to the development of systems and processes to enhance the Group's effectiveness.\nIdeally you will have:\n• extensive experience as a criminal litigator - preferably including in the area of health and safety (or a proven passion and motivation to make a difference in this area).\n• the ability to identify and proactively respond to emerging issues.\n• the capacity to contribute to the legal team at a senior level and to act as a mentor to others.\n• a current practising certificate with admission as a Barrister and Solicitor of the High Court.\n• a Level 3 classification under the Crown Law Office Framework for Prosecutor Classification of In-house Lawyers (or meet the requirements to obtain such classification).\nAbout WorkSafe New Zealand\nWorkSafe New Zealand, Mahi Haumaru Aotearoa, is the primary workplace health and safety regulator - our vision is that everyone who goes to work comes home healthy and safe.  Our people are passionate about our vision and embrace and demonstrate our WorkSafe Values - Ngā Mātāpono:\n• Whakakotahi - we're united in a strong purpose\n• Kōrero mai - we engage meaningfully\n• Tiakina mai - we're entrusted with a duty of care.\nWorkSafe offer a range of benefits including free life, trauma and income protection insurances, discounts on health insurance and eye care, four weeks annual leave plus three days WorkSafe leave, and learning and professional development opportunities. We operate on a flexible by default basis, allowing you and your manager to create a flexible work experience that supports you and the business to succeed.\nThere are a range of networks you can become part of, such as our Te Rōpū Atuapiko Rainbow Network, WorkSafe Wahine Women's Network and our Kapa Haka group.\nHow to apply\nClick the apply link, complete an application form and submit a copy of your CV and cover letter.\nFor further information please contact *******@worksafe.govt.nz with any queries, or to find out more about WorkSafe New Zealand go to www.worksafe.govt.nz\nApplications close on Monday 26 April 2021.\n​"}