{"title":"Legal Counsel/Senior Legal Counsel","dataCreated":"2021-04-08","region":"Canterbury","city":"Christchurch City","employer":"Tait Communications","phone":"Not Found","contactName":"Tait Communications","expires":"2021-05-09","type":"full time","description":"Tait Communications have an exciting opportunity in their Christchurch Head Office, for a Legal Counsel/Senior Legal Counsel to join the Legal and Commercial team on a fixed-term basis, to cover a parental leave.\nThis is a cross-functional role with a global focus, working as part of a team that is responsible for providing both commercial and legal support for business as usual activities, as well as specific projects.\nReporting to the General Counsel, this role will provide opportunities to learn, take on responsibility for a variety of tasks, engage with a range of functions across the organisation, and work closely with our Management and Leadership teams. To find out more about the role, please view the attached job description.\nWe're open to considering candidates with a range of experiences, whether in the early stages of your career development post completing your Bachelor of Law, or at a more senior level there is scope to tailor the role to suit your skills and experience.\nThe ideal candidate will be someone who has good practical legal skills, is willing and able to learn, can comfortably communicate with stakeholders at all levels of the business, and has a positive, can-do attitude.\nWe are open to discussing flexible working patterns, however as this is a busy role, to be successful a minimum 30-hour week working pattern is preferred.\nAbout the company\nOur clients protect communities, power cities, move citizens, harness resources and save lives all over the world. We work with them to create and support the critical communication solutions they depend on to do their jobs.\nWhile the corporate functions are mainly based in Christchurch, New Zealand, the company prides itself on its international customer base and global support network with regional offices in Brisbane (Australia), Cambridge (UK), and Houston (USA), and a network of sales/support offices, dealers, system integrators and consultants across many other parts of the world.\nFor more information about the company, our products and solutions offered to our customers, please visit our website www.taitradio.com\nIf this sounds like you, apply now with your CV and cover letter.\nApplications will close Wednesday, 21 April 2021."}