{"title":"Casual Labourer","salary":"Not Found","dataCreated":"2021-04-13","city":"Otago","area":"Rest of Otago","employer":"OceanaGold (New Zealand) Ltd","validThrough":"2021-05-14","type":"Casual/Vacation","description":"Work at Macraes - NZ’s largest Gold Mine\nCasual, fixed-term opportunity\nKickstart your career in the mining industry\nThe role:\nWe currently are seeking Casual Labourers to join the Open Pit team at Macraes. This is a fixed-term entry level position into the mining industry and would suit an energetic and motivated person willing to put their hand to a variety of tasks.\nKey tasks and responsibilities:\nGate-keeping duties\nAssisting with fencing\nPlacement of signage\nGeneral work duties\nThe successful candidate will have:\na current full class 1 driver’s licence\nthe ability to follow procedures with good attention to detail\na,high level of safety awareness.\nWho are we?\nCheck us out - https://youtu.be/_HHGRMz5rcM \nAbout the company:\nOceanaGold Corporation is a mid-tier, multinational gold producer with assets in the Philippines, New Zealand and the United States. On the North Island of New Zealand, the Company operates the high-grade Waihi Gold Mine while on the South Island; the Company operates the country’s largest gold mine, the Macraes Goldfield.\nAt OceanaGold, health and safety are paramount to the success of our business as are employees who engage in behaviours that align with our values.\nOGC VALUES: RESPECT | ONE TEAM | CONTRIBUTE | KNOWLEDGE\nOceanaGold is committed to providing equal employment opportunities.\nIf you share the same values and have what we are looking for, please apply online now via our website: www.careers.oceanagold.com\nApplications close Tuesday, 27 April 2021. Shortlisting will commence immediately.\nApplicants must be eligible to work in New Zealand.\nDue to COVID 19 border restrictions in New Zealand we are unable to consider applicants outside of New Zealand who are not NZ citizens or permanent residents.\nNO APPLICATIONS FROM EMPLOYMENT AGENCIES WILL BE ACCEPTED"}