{"title":"Traffic Planner","salary":"Not Found","dataCreated":"2021-04-05","city":"Auckland","area":"Manukau & East Auckland","employer":"Northpower Ltd","validThrough":"2021-05-06","type":"Full Time","description":"About us\nNorthpower is an electricity and fibre network provider for Whangarei and Kaipara, with more than 60,000 connected customers. We also provide contracting services to our partners - other network owners and operators across the North Island.\nWe have over 1,300 staff working together across 13 locations to keep the power on and the lights going for our customers.\nThe role\nReporting the Traffic Management Supervisor, you’ll be responsible for providing temporary traffic management design services, management of subcontractors and wider support to the Traffic Planning Team. This role will see you in the creation and submission of Traffic Plans, ensuring they are accurate and contain key information.\nWhat we're offering\nThe opportunity to work for a purposeful, essential organisation in a critical safety leadership position\nAn environment where innovation and quick adaptation is forefront\nA company who puts our people at the heart of the organisation and is committed to safety leadership at all levels\nThe chance to work with a company who puts our people at the heart of the organisation and is committed to safety\nCompetitive remuneration, an in-house wellbeing programme and initiatives including group discounted medical insurance\nWho we're looking for\nIdeally you’ll have Traffic Management in-field experience, STMS Level 2 or 3 and have completed the TTM planner workshop. You will be comfortable liasing with multiple people and departments, confident with an eye on the bigger picture, while able to attend to the detail.\nWe're looking for an individual who can demonstrate the following:\nExperience with TMP Design, Invarion software, Myworksite and Submitica\nExcellent communication skills, written and verbal including negotiation skills\nGood interpersonal and relationship building skills\nA high attention to detail, time management and adaptability\nAbility to be flexible when required.\nGet in touch!\nIf this sounds like you, we'd love your application today.\nDue to current border restrictions, unfortunately applications from international candidates or those without the right to work in New Zealand cannot be considered. \nNorthpower has an in-house recruitment team who manage recruitment for all our vacancies.  If you're interested in a role with us we would encourage you to apply directly online to us, as we don't accept candidates via agency (unless the role is advertised by the agency at our request)."}