{"title":"Trainee Subtransmission Cable Jointer","salary":"Not Found","dataCreated":"2021-03-22","city":"Auckland","area":"Manukau & East Auckland","employer":"Northpower Ltd","validThrough":"2021-04-21","type":"Full Time","description":"Are you an experienced Cable Jointer looking for a new challenge?\nDo you have experience installing &amp; repairing LV/HV cable joints?\nKeen on a role with a proven company and a great team?\nAbout us\nNorthpower is an electricity and fibre network provider for Whangarei and Kaipara, with more than 60,000 connected customers. We also provide contracting services to our partners – other network owners and operators across the North Island.\nWe have over 1,300 staff working together across 13 locations to keep the power on and the lights going for our customers.\nThe role\nAs a Trainee Subtransmission Cable Jointer with Northpower, you will learn the joint process of lead wiping, oil insulated cable repairs working on voltages above 33kv on different networks and working towards becoming a qualified Subtransmission Cable Jointer.\nDay to day duties include the terminations within zone substations, supervision of contractors and crews while adhering to best practice and all compliance with health, safety, environmental and regulatory requirements.\nWhat we’re offering\nAn opportunity to gain new skills within the electricity distribution industry\nAn interesting role within a great team\nThe chance to work with a company who puts our people at the heart of the organisation and is committed to safety\nCompetitive remuneration, an in-house wellbeing programme and initiatives including group discounted medical insurance\nWho we’re looking for\nTo be considered for this role you’ll need to be an experienced Cable Jointer at Distribution level with EWRB registration and a current practising licence, along with a current drivers licence (Class 1), a class 2 drivers licence is advantageous.\nYou will need to demonstrate the following:\nExperience with installing and repairing LV/HV cable joints and terminations for PILC and XLPE cables operating up to 33kV.\nSound technical knowledge of cables and local network systems, procedures and standards\nGreat verbal and written communication skills, with basic technology knowledge\nA strong commitment to health and safety\nA great attitude and a willingness to be part of a team\nGet in touch!\nWe’d love to hear from team players who fit the above criteria and have a great ‘can do’ attitude\nApplications close Friday 9th April 2021\nDue to current border restrictions, unfortunately applications from international candidates or those without the right to work in New Zealand cannot be considered."}