{"title":"Civil Engineer","salary":"Not Found","dataCreated":"2021-03-25","city":"Otago","area":"Rest of Otago","employer":"OceanaGold (New Zealand) Ltd","validThrough":"2021-04-24","type":"Full Time","description":"Competitive salary and Southern Cross medical insurance\nPermanent Projects role\nThe role\nThe purpose of the role will be to provide high quality support to the Senior Project Engineer. Working within a close-knit team across site tailings storage facilities, public roads and parts of the site water system, you will gain valuable experience to support the design, scheduling and monitoring of civil and mechanical works for NZ’s largest active gold producing mine.\nKey tasks and responsibilities:\nEnsure designs are appropriate to the level of sign-off required and are available/maintained for construction works\nSchedule construction work to meet operational capabilities and business requirements\nReport Construction progress within required timeframes and key variations are noted\nEstablish and maintain infrastructure maintenance plan\nSafe performance of all work and associated functions\nAssist in budget and project cost estimation\nSpecify water pumping and pipeline design\nThe successful candidate will have the following:\nBE or NZCE (civil) qualifications\nAt least one year of civil construction experience, preferably in a bulk civil or road construction\nFormal training or Qualifications in MS Project or Primavera desirable\nFull and current driver's licence, ability to drive manual vehicles is preferred\nAbout the company\nOceanaGold Corporation is a mid-tier, multinational gold producer with assets in the Philippines, New Zealand and the United States. On the North Island of New Zealand, the Company operates the high-grade Waihi Gold Mine while on the South Island; the Company operates the country’s largest gold mine, the Macraes Goldfield.\nAt OceanaGold, health and safety are paramount to the success of our business as are employees who engage in behaviours that align with our values. Macraes is a smoke free site.\nOGC VALUES: RESPECT | ONE TEAM | CONTRIBUTE | KNOWLEDGE\nOceanaGold is committed to providing equal employment opportunities.\nIf you share the same values and have what we are looking for, please apply online now via our website: www.careers.oceanagold.com\nApplications close Friday, 9 April 2021. Shortlisting will commence immediately.\nApplicants must be eligible to work and currently reside in New Zealand.\nNO APPLICATIONS FROM EMPLOYMENT AGENCIES WILL BE ACCEPTED"}