{"title":"Jumbo & Loader Operators","salary":"Not Found","dataCreated":"2021-04-20","city":"West Coast","area":"Rest of West Coast","employer":"Federation Mining","validThrough":"2021-05-20","type":"Full Time","description":"Federation Mining\n is currently planning the development of the historic gold mine that once stood at Waiuta. Driving 3.3km twin tunnels from the Snowy Valley, we plan to meet the ore body where the old timers left it back in 1951. Located approximately 25 km from Reefton, the site will have a small surface infrastructure footprint and will employ a local workforce with support from specialist contractors. \n \nAn opportunity for a \nJumbo Operator &amp; a Loader Operator\n to join our unique project, operating our brand new Epiroc ST18 Loader and M2D Boomer leading a small team and overseeing the safe operations across site has become available. The role will report to the Mine Superintendent and be based at the project site near Reefton on a 7/7 rotating day/night roster arrangement on a Fixed Term contract till the end of 2022.\n \nDuties will include, but are not limited to: \n \nSafe operation of jumbos, loaders and other mobile equipment\n \nInstallation of ground support in accordance with Ground Control Management Plan\n \nBoring of development excavation profiles to desired profile and in accordance to the Mine Safety and Inspection Act and Regulations\n \nProvision of expertise in the installation &amp;/or maintenance of underground services, development charge-up &amp; other tasks as required\n \nComplying with issued plans and communicating with crew and cross shifts\n \nEnsure that work quality is high and that all controls are used and adhered to\n \nUndertaking additional / alternative responsibilities as reasonably assigned by the Mine Superintendent.\n \nParticipate and lead safety and environmental verification activities and inspections \n \nSupporting the safe and timely delivery of the mine and tunnelling schedule \n \nCompletion of pre-starts, care &amp; maintenance of vehicles\n \nAdditional/alternative responsibilities as reasonably assigned by the shift boss or Mine Superintendent.\n \nIdeally, you will posses the below skill set:\n \n5+ years Mine operations experience \n \nBroad experience in underground operations \n \nNZ Statutory certifications  \n \nCurrent Jumbo ticket\n \nCurrent First Aid Qualifications \n \nSatisfactory completion of a underground suitable pre-employment medical including drug and alcohol testing, and clean police clearance is part of the recruitment process. Federation Mining has a zero tolerance for drugs and alcohol and daily testing will be mandatory onsite.  Federation Mining is a smoke free workplace.\nApplicants should have NZ residency or a valid NZ work visa to be considered for any position and a clean police record. A current valid manual NZ Drivers License with a clean record is essential for all roles."}