{"title":"Design Planner (Substations)","salary":"Not Found","dataCreated":"2021-04-08","city":"Waikato","area":"Hamilton","employer":"WEL Networks","validThrough":"2021-05-08","type":"Full Time","description":"Develop your technical and design skills\nGrow and thrive in an innovative utility network\nFull medical, life and income protection insurance\nAbout WEL Networks\nWith around 270 employees, owned by and working for the community, WEL Networks has been serving the Waikato for 100 years, distributing power from the national grid, connecting over 160,000 people to electricity services.\nBased in Hamilton, we play an essential role in the region's economic and social development by identifying and investing in new technologies that will modernise our network and future-proof our region. We're excited to be broadening our horizons as we diversify from a traditional lines company into a multi-utility.\nAs the world is going through a period of significant change and adjusting to a new normal, so too is WEL Networks. With the energy landscape changing at pace, through the acceleration of Electrification, Solar, Batteries, and EVs driving changing customer expectations, we are focussing now more than ever on unlocking our energy potential and realising our vision: to create an innovative energy future.\nWe are looking for skilled, innovative and enthusiastic individuals to join our team in supporting the company through this exciting new chapter and into the future.\nAbout the role\nAs a Design Planner, you will join our Works Planning team to support the reliable, efficient and safe operation of our distribution network by providing specialised technical advice, and structured planning for the construction and maintenance of our Substation assets.\nResponsibilities:\nDeliver conceptual and detailed design solutions for WEL's infrastructure\nProvide structure planning support\nOffer technical guidance and support the effective use of technical information\nLiaise and engage with a variety of stakeholders\nSkills and experience:\nAn appropriate technical qualification - electrical trade qualification, NZCE equivalent, or equivalent experience\nIdeally five years' experience in the distribution network environment - knowledge of the WEL distribution network would be an advantage\nA proven commitment to safety in your work\nStaff benefits\nAt WEL, we look after our people - with medical, life and income protection insurance, a variety of flexible working options, the safest equipment and plenty of upskilling opportunities. We will also help you with relocation expenses when moving into the Waikato.\nWe are committed to making sure our people go home safe every day, and with a drug and alcohol free worksite we will require you to take a drug and alcohol test before you join us.\nHow to apply\nAt WEL we value diversity and innovation, and want extraordinary people with vision to join us. It is important to us that we get to experience a little bit of the 'real you' in your application. Apply now with your CV and please take the time in a cover letter to tell us what really floats your boat - what sets you apart, why you want to be a part of our team and some of your proudest achievements.\nPlease review the position description for more details by copy and pasting this link into your browser: https://expressonline.haineslink.co.nz/pdfs/681091_JobDesc.pdf\nIf this opportunity sounds like the right fit for you, please apply! \nApplications close Sunday, 25 April 2021."}