{"title":"Commercial Manager- Future Generation","salary":"Not Found","dataCreated":"2021-04-08","city":"Auckland","area":"Auckland Central","employer":"Genesis","validThrough":"2021-05-08","type":"Full Time","description":"About the role:\nAt Genesis we have a healthy obsession with energy. We share New Zealand's aspiration for a low-carbon economy and believe the electricity industry will play an important role in reducing emissions in other high-emissions sectors.\nTo help empower New Zealand's sustainable future, we have a newly created role Commercial Manager-Future Generation to support and drive the execution of the Genesis Future-gen Strategy. Reporting into the General Manager-Future Generation you'll be responsible for supporting the analysis, recommendation and negotiation of new commercial renewable electricity and gas storage opportunities.\nKey responsibilities:\nIdentify and mature the pipeline of new commercial options for Genesis to successfully drive execution of the Future-gen Strategy.\nLead portfolio analysis of renewable electricity and gas flex/storage opportunities.\nLead development / drafting of robust business cases to support individual commercial opportunities and facilitate decision-making.\nLead negotiation of some individual commercial opportunities, with support and guidance from the General Manager Future Generation and Chief Trading Officer.\nSupport the General Manager Future Generation and Chief Trading Officer in leading the Executive, and Board if necessary, through the decision-making process.\nOversee the successful transition of finalised commercial opportunities into operations and the Wholesale portfolio.\nSupport wider Wholesale Markets segment in development, negotiation and execution of commercial opportunities.\nDevelop and maintain strong networks with energy industry representatives and key stakeholders in the area of project development and acquisitions to promote Genesis.\nAbout you:\nCirca 5-10 years' experience within the energy industry.\nProven track record in commercial negotiations and deal structuring for significant value deals.\nProven commercial acumen and deep understanding of value drivers in energy businesses.\nInvestment banking and corporate governance experience is preferred.\nExceptional communication skills and demonstrated experience working cross functionally to deliver strategic goals.\nHigh level of financial literacy and modelling skills.\nRelevant Tertiary level qualifications in Commerce, Finance, Business or Engineering.\nYou'll be motivated by driving outcomes in a fast-paced, complex and dynamic environment. A collaborative, proactive and engaging style will be key in enabling you to work alongside the wider business and external parties.\nOur culture:\nExcitingly, Genesis and the wider industry is evolving rapidly and the ability to deliver a reliable and resilient energy system will bring significant changes.\nGenesis is proud to be an inclusive workplace; we celebrate difference and diversity and aim to empower our employees. We're a business built on innovation and optimism; a place where we value our people and provide opportunities for them to build outstanding careers and a better New Zealand.\nCreate your world of tomorrow, at Genesis."}