{"title":"Heavy Duty Diesel Mechanic | Goldfields","salary":"Up to $75p/h + Super on all hours","dataCreated":"2021-04-14","city":"Auckland","area":"","employer":"Mader Contracting","validThrough":"2021-05-14","type":"Casual/Vacation","description":"Mader Group \n- the mechanically minded specialists in preventative maintenance. Today we work across the globe, deploying over 1,400 highly skilled and dynamic employees throughout the major mining regions of Australia, Asia, Africa and the Americas. Only made possible through sourcing and retaining the best workforce\n\\n\nAbout the Role\n\\n\nMader Goldfields has unmatched flexibility &amp; variety that helps builds a career around your lifestyle. Whether you want to know when your home next on a 2/1 roster or cruise around 130 sites through the red dirt, the choice is yours with options available from 2/1 - 6/1.\n\\n\n\\n\nFIFO from Perth &gt; Goldfields, Western Australia with relocation assistance up to $20,000  and accommodation available\n\\n\nWorking on but not limited to Liebherr, Hitachi, Komatsu, CAT, and more!\n\\n\nLong term mine site with fantastic camp site and facilities\n\\n\nFortnightly pay\n\\n\nWhether you’re looking for a rostered FIFO position or wanting more flexibility around your roster - the choice is yours with field service positions ranging from even time to 6/1!\n\\n\n\\n\nMader Benefits:\n\\n\n\\n\nTop industry rates with pay reviews at 3 months\n\\n\nFlexible rosters tailored to you (perfect for families or travel lovers)\n\\n\nAdvanced trade specific training and leadership programs\n\\n\nInternational opportunities across the USA, Asia, Africa and Canada\n\\n\nSuperannuation paid on all hours worked\n\\n\nSalary Sacrificing\n\\n\nMates of Mader referral bonuses up to $3,000\n\\n\n\\n\nSkills &amp; Experience:\n\\n\n\\n\nMinimum 2 years' experience on drills \n\\n\nAustralian recognised Trade Certificate\n\\n\nAustralian working rights\n\\n\nValid manual driver's license\n\\n\nStrong commitment to safety\n\\n\n\\n\nMader is proud to be an equal opportunity employer. We celebrate diversity encourage Indigenous, Torres Strait Islander and Female applicants to apply.\n\\n\nApply online or email CV directly to claudia.mazza@madergroup.com.au or call Claudia Mazza on +61 436 379 141 [link removed].\n\\n\nFind your fit with Mader."}