{"title":"Casual Bunker/Tanker Operator","salary":"Not Found","dataCreated":"2021-04-13","city":"Tasman","area":"Nelson","employer":"SGS New Zealand","validThrough":"2021-05-13","type":"Contract/Temp","description":"Company Description\nSGS is the world's leading inspection, verification, testing and certification company. We are recognised as the global benchmark for quality and integrity. With more than 89,000 employees, we operate a network of more than 2,600 offices and laboratories around the world.\n \nJob Description\nPRIMARY RESPONSIBILITIES\nTo provide assistance with bulk tanker discharges, bunkering vessels and terminal duties as requested by the Branch Manager.\n \nSPECIFIC RESPONSIBILITIES\n \nCompletes bunkering tasks on the wharf at various locations to ensure vessels are fueled in accordance with best practice and customer’s expectations\n \nCompletes all tasks in a manner that is safe to all personnel and the environment\n \nAssists with discharging bulk fuel tankers berthed at Port Nelson or other ports as required\n \nUndertakes terminal duties, such as, sample taking and testing, weed spraying, valve greasing, tank dipping, hose testing and pipeline test monitoring at branch and client sites as required\n \nWorks with the Branch Manager to maximise business returns whilst minimising exposure and risk for the company\n \nEnsures all activities are carried out with regard to and recognition of Health and Safety requirements and personal safety\n \nUndertakes any other reasonable work requests relevant to your position.\n \nCompletes all SGS NZ Ltd mandated training requirements as required\n \nHas confidence handling fuels and lubricants.\n \nWill be confident working with fuel transfer pumps, oil transfer pumps, and metered pumps\n \nQualifications\nREQUIRED SKILLS\n \nHolds a current unrestricted New Zealand Driving License\n \nIs confident towing and reversing trailers\n \nGood written and verbal communication skills, information seeking, efficiency and organization skills\n \nAble to accurately read gauges and record numbers\n \nA mechanical aptitude would be an advantage\n \nAwareness and commitment to Health &amp; Safety and understanding of H&amp;S practices\n \nComputer literacy in Microsoft Office/Excel would be advantageous\n \nFirst Aid Certificate, Forklift License, Load Slinging/Dog-man experience/certificate and Fire Extinguisher certificate would be an advantage\n \nAdditional Information\nWork is undertaken primarily in Nelson and Picton with occasional opportunities to work at other locations in New Zealand"}