{"title":"Network Coordinators","salary":"Not Found","dataCreated":"2021-04-16","city":"Otago","area":"Rest of Otago","employer":"Aurora Energy","validThrough":"2021-05-16","type":"Full Time","description":"About Us\nAurora Energy is New Zealand’s seventh-largest electricity distribution company, supplying power to more than 90,000 homes, schools, farms and businesses in Dunedin, Central Otago and Queenstown Lakes. We’re in a major phase of network renewal that touches nearly every part of the community. \nThe Role\nThe Network Coordinator is responsible for directing, monitoring and coordinating the operation of Aurora’s electricity distribution network from the 24/7 Network Operations Centre. The Network Coordinator ensures the operations on the Aurora network comply with all operational and safety standards and practices.\nReporting directly to the Network Operations Manager, we have day shift opportunity based in our Cromwell office and a shift roster role opportunity based in either Dunedin or Cromwell as part of Aurora’s 24/7 Network Operations Centre.\nYou will work closely with the Network Operations Centre Team Leader and Network Operations Manager in coordinating and optimising the performance of the distribution network while ensuring operational and safety practices are maintained and delivered to the highest standards.\nRole Requirements\n  \nExperience applying systematic controls or protocols.\n  \nA team focus\n  \nKnowledge of the operation of a distribution network.\n  \nExcellent communication skills – clear and precise communicator, including the ability to interact      effectively with people.\n  \nAn ability to analyse data and make timely decisions\n  \nComputer literate with an ability to use various software packages\nApply\nWe see diversity as a strength and welcome applications from anyone who has what it takes, regardless of gender, ethnicity or background. \nClick the ‘Apply Now’ button to submit your application.\nTo learn more about Aurora Energy please visit our website: .\nFor a copy of the Job Description visit <a href=\\"}