{"title":"Live Line Mechanic","salary":"Not Found","dataCreated":"2021-03-23","city":"Waikato","area":"Hamilton","employer":"WEL Networks","validThrough":"2021-04-22","type":"Full Time","description":"Specialised in working on live power lines?\nLead a team in an innovative utility network\nFull medical and life insurance\nAbout WEL Networks\nWith around 270 employees, owned by and working for the community, WEL Networks has been serving the Waikato for 100 years, distributing power from the national grid, connecting over 160,000 people to electricity services.\nBased in Hamilton, we play an essential role in the region's economic and social development by identifying and investing in new technologies that will modernise our network and future-proof our region. We're excited to be broadening our horizons as we diversify from a traditional lines company into a multi-utility.\nAs the world is going through a period of significant change and adjusting to a new normal, so too is WEL Networks. With the energy landscape changing at pace, through the acceleration of Electrification, Solar, Batteries, and EVs driving changing customer expectations, we are focussing now more than ever on unlocking our energy potential and realising our vision: to create an innovative energy future.\nWe are looking for skilled, innovative and enthusiastic individuals to join our team in supporting the company through this exciting new chapter and into the future.\nAbout the role\nAs a Live Line (Glove and Barrier) Mechanic, you will join our Live Line team, to provide services to WEL's overhead network including repairs, maintenance and construction.\nResponsibilities:\nMaintain 400V, 11,000V and 33,000V overhead lines and underground cables\nConstruct new electrical reticulation in accordance with regulations, standards and policies\nFault find and reactively repair network outages\nParticipate in our on-call faults roster and work unscheduled overtime when required\nSkills and experience:\nProven leadership skills\nAn uncompromising commitment to workplace safety\nCurrent line mechanic registration and Live Line certification\nElectricity distribution industry knowledge and experience\nBasic computer skills\nStaff benefits\nAt WEL, we look after our people - from full medical and life insurance cover, and a variety of flexible working options, to the safest equipment and plenty of upskilling opportunities. We will also help you with relocation expenses when moving into the Waikato.\nWe are committed to making sure our people go home safe every day, and with a drug and alcohol free worksite we will require you to take a drug and alcohol test before you join us.\nHow to apply\nAt WEL we value diversity and innovation, and want extraordinary people with vision to join us. It is important to us that we get to experience a little bit of the 'real you' in your application. Apply now with your CV and please take the time in a cover letter to tell us what really floats your boat - what sets you apart, why you want to be a part of our team and some of your proudest achievements.\nPlease review the position description for more details by copy and pasting this link into your browser: https://expressonline.haineslink.co.nz/pdfs/679482_JobDesc.pdf\nIf this opportunity sounds like the right fit for you, please apply!\nApplications close Tuesday, 6 April 2021.\nAlthough we are really keen to fill this role - it is crucial we find the right fit for WEL, so we are prepared to close applications early or leave the role open until we find the right person."}