{"title":"Charge Hand - Line Mechanic","salary":"$33 - $38/hr + applicable allowances","dataCreated":"2021-04-09","city":"Canterbury","area":"Timaru & South Canterbury","employer":"NETcon Limited","validThrough":"2021-05-09","type":"Full Time","description":"As a Charge Hand, you are responsible for “keeping the power on” by building and maintaining the Equipment.  This means guiding and mentoring others within your allocated resource pool and getting the job done safely, efficiently and effectively whilst working with weather and location conditions and resolving issues and challenges on-site to ensure the work is completed to a quality standard in the timeframe available.\n  \nWhat’s involved:\n \nCarry out construction &amp; maintenance work on both Aerial and underground Lines.\nCarry out system switching &amp; isolation as directed.\nBe available for fault repairs either as an “On Call Faults man” or to assist with faults work.\nParticipate in the Standby/Callout roster.\nEnsure familiarity with NZQA / ESITO requirements and all aspects of trainee responsibilities.\nAssist in planning and preparation of work, communicating work needs, planned outcomes and measuring progress.\nCompleting Job Packs - Processing and recording accurately progress and deviations\nSupport other field staff and the wider organisation's team members, creating a positive culture, sharing information, knowledge and expertise.\nAssist in developing new ways of working that enhance delivery.\nWe will be looking for someone who is:\n \nEWRB Registered Level 4 Line Mechanic with a current practicing license.\n4 – 6 years’ experience in the electrical distribution industry is preferable.\nLive line, glove &amp; barrier qualifications and experience is an advantage.\nEligible to work in New Zealand, with New Zealand citizenship or New Zealand permanent residency.\nCurrent NZ Drivers License, Class 4 preferred (minimum Class 2).\nNETcon requires all successful applicants to complete pre-employment checks which include a medical test, drug and alcohol test and a Ministry of Justice check.\n  \n Apply by submitting a covering letter and CV, telling us why this position should be yours.  All applications will be treated with the strictest confidence."}