{"title":"Project Manager","salary":"Not Found","dataCreated":"2021-04-01","city":"Bay of Plenty","area":"Tauranga","employer":"TRILITY Pty Ltd","validThrough":"2021-05-01","type":"Full Time","description":"Are you looking to take your Project Management career to the next level? Do you enjoy a variety of work environments and the challenge of beating deadlines?\n  \nWe are looking for an experienced Project Manager who can take ownership of this challenging and rewarding combined role and manage project delivery across our Modular solutions delivery business units. To be successful in the role, it is preferred that you have 10 years of relevant experience and in-depth, demonstratable knowledge of project and contract management.\n  \nThis is a permanent, full-time role based at our Mount Maunganui site and will involve a combination of field, workshop, and office-based work. The role offers a competitive remuneration and is best suited to someone who understands that overtime may be required in order to achieve project schedules and customer deadlines.\n  \nKey Responsibilities\n  \nReporting to the Manager Modular Solutions &amp; Supply Chain, the key responsibilities of the role are:\n \nManage the project delivery, including cost controls of projects\nEnsure that each project is delivered on time, on budget, and achieves the expected profit target\nTo undertake a ‘client facing’ role\nManage project risk\nManage change, including variations under that contract and design changes\nMaintaining a project schedule\nTo optimise the company’s commercial interests\nPreparation and maintenance of cost forecasts and monthly financial reports\nEnhance good working relationships with the client, partners, and subcontract staff\nWhat we are looking for\n  \nDemanding impressive leadership and communication skills, this role also requires:\n  \nProfessional/technical skills, knowledge, and experience\n \nPreferred 10+ years relative experience\nGood understanding of the various water treatment technologies\nIn-depth knowledge of various forms of contract &amp; contract management practices\nDemonstrated track record in successful project delivery\nSound knowledge of procurement and buying processes\nGood interdisciplinary engineering knowledge, particularly with regards to M&amp;E, Process engineering and Civil construction\nGood working knowledge of Workplace Health &amp; Safety (WHS), Environment, Quality &amp; legislation\nCommercial acumen and demonstrated financial management and budgeting skills\nPersonal competencies\n \nHigh levels of initiative and drive\nAbility to make decisions with minimal direction and guidance\nSound judgement in relation to commercial and contractual issues\nEffective communication and interpersonal skills\nAbility to effectively manage client interfaces and stakeholder relationships\nSound report writing skills\nWhile not essential, the following will be highly regarded\n \nPostgraduate qualifications in Project Management\nRegistered with the AIPM as a practitioner\nProcess contracting experience\nUnderstanding of operational constraints on both water and wastewater treatment plants\nProcurement negotiation skills\nWhy TRILITY?\n  \nTRILITY is an established industry leader, solely dedicated to the delivery of water, wastewater and reuse solutions across New Zealand and Australia’s municipal, industrial and resource sectors. This leadership draws on more than 25 years’ experience of providing high-quality solutions for our public and private sector clients, including financing, design and construction, operations and maintenance, asset management, utility services, and equipment solutions. Our capabilities span the full life cycle of water, delivering services to millions of people every day.\n  \nWhat we have to offer you\n \nGreat people\nFlexible working and leave options\nCareer development opportunities with a growing company\nWellbeing Program &amp; EAP (Employee Assistance Program)\nModern offices and workshops or ability to work from home\nPositive environment where team and individual efforts are recognised\nTo apply\n  \nIf you are looking for a fast-paced, diverse role, then please submit your application, including a cover letter and resume, via the Seek apply button by COB Friday, 16 April 2021.\n  \nFor further information on TRILITY, please view our website at www.TRILITY.com.au\n  \nTRILITY is an Equal Employment Opportunity employer who seeks to increase the diversity of its workforce. We encourage people from any background/culture, age, gender, sexual orientation, or people with an impairment to apply for this role."}