{"title":"Senior Project Manager - Owner Scope (Fixed Term 3 years)","salary":"Not Found","dataCreated":"2021-04-06","city":"Waikato","area":"Taupo","employer":"Contact Energy","validThrough":"2021-05-06","type":"Full Time","description":"Company Description\nKo wai mātou | About us   \nOur purpose is to put our energy where it matters, to decarbonise the New Zealand energy sector and promote #changematters.       \nWe are committed to delivering market leading performance to shareholders and value to our customers. We will add value to the resources that we are stewards of in turn ensuring the sustainability of our business.  We work closely with iwi, our neighbours, contractors and our local communities to develop projects that deliver wider benefits beyond the obvious.   \nTo support these aspirations, we are excited to be one of few energy companies in the world embarking on a new geothermal project. Tauhara Geothermal Station will be a 150 MW geothermal plant, New Zealand’s most significant renewable investment. This is only the first part of a broader pipeline of geothermal projects which include ensuring ongoing generation from the Wairakei Geothermal Field and further investments on the Tauhara field, so we are not short of market leading renewable projects for you to get involved in.    \nJob Description\nTe Whiwhinga mahi | The opportunity \nThis role is not for the faint hearted. As the Project Manager of Contact’s scope of works for the Tauhara your remit will be wide; you will be responsible for all the above ground geothermal steamfield facilities including cross country pipelines, separation plant, pump stations, electrical and controls systems and all other ancillary requirements outside of the EPC Power Station scope. The role will be one of the most challenging of the project. Let us paint a picture of some of the work you will be responsible for: \n \nLead the implementation and effectively deliver Contact’s scope of work as part of the project in accordance with the project mandate. \nCoordinate, direct and motivate your team and contractors to achieve industry best practice safety outcomes across the project.  \nManage all activities from scoping and design management through to procurement, tendering, construction and commissioning.  \n \nKo wai koe | About you \nYou will be a natural influencer. You will be famous for your communication style and ability to take people on a journey – even if it gets rocky from time to time. We have made a conscious decision to align our project principles with a universal approach to this role all roles across the programme. \n \nYou’ll be a part of a team that takes true pride in delivery. Self-starting, highly motivated and outcome driven - you’ll ensure delivery on time, to budget and with an eye on the overall life of the plant.  \nYou’ll understand that projects are more than just an individual, they require a village of committed and skilled people. You’ll be a team player, always willing to lend a hand, quick with praise, considerate with feedback, respectful of those around you and the contribution they make in their own capacity.   \nYou’ll recognise that the project will leave a lasting legacy for Contact, the community and for New Zealand. You’ll maintain a view on the bigger picture and work within your sphere to deliver wider benefits where available.  \n \nQualifications\nLike any opportunity, there are some key attributes that we would like to add to our bench strength. You will have plenty of examples where you have been involved in: \n \nLarge scale, extensive project management experience in a complex environment. \nExperience in engineering design and construction management in the power generation and ideally geothermal sector. \nDemonstrated ability to build and maintain relationships with key stakeholders including strengths in influencing, conflict management and negotiation. \nCuriosity and comfort in working ‘in the grey’ \nWillingness to canvas diversity of thought. \nRelevant degree in engineering or equivalent qualifications and appropriate professional registration. \n \nAdditional Information\nFinally, we are after like-minded individuals to join our Tauhara team who will buy into our team principles: \n \nWe are a cohesive team - authentic, collaborative and inclusive \nWe take pride in our work and want to enjoy the project journey  \nWe will create enduring value for Contact and New Zealand \nIf you have read this far, you don't need us to tell you this kind of opportunity won't stay in the market for long - hit the apply now button! \nContact Energy is committed to being an inclusive employer. We want people to be themselves, after all, they can't be anyone else!\nPlease note, only candidates with the right to live and work in New Zealand will be considered for this role."}