{"title":"Mechanical Fitter/Turner","salary":"Not Found","dataCreated":"2021-03-24","city":"Tasman","area":"Nelson","employer":"Private Advertiser","validThrough":"2021-04-24","type":"Full Time","description":"This company is an industry leader in the service and repair of electrical and mechanical rotating equipment and machinery. They pride themselves on delivery and superior customer service. They specialise in armature/motor rewinding, the repair and servicing of electric motors, generators, pumps, fans, gearboxes and associated plant and equipment.\nWe are looking to interview candidate who have the following experience:\n \nThe understanding of basic function of all types of rotating equipment and machines used in industry. \nAssemble and disassemble such rotating equipment.\nA full understanding of the replacement of bearing and seals in industrial equipment..\nAssessment of the condition of mechanical components and the repair of those components.\nAttend onsite to conduct assessments, onsite maintenance and repairs.\nWe will be really keen to interview those who are experience in (or willing to learn) the essential electrical functions we carry out in our workshops. \n \nConduct static and dynamic tests to electrical equipment\nA willingness to assist rewind electric motors and generators.\nCRITERIA:\n \nRelevant trade qualifications or proven experience.\nExperience in the maintenance and repair of industrial equipment and machines.\nExperience with onsite maintenance work. \nAbility and willingness to travel, at times with short notice, within the South Island.\nQUALITIES:\n \nDedication to working in a safe manner at all times\nCalm and focused demeanour with a keen eye for detail\nGood communication skills – verbal, written and listening\nFlexible and adaptable customer service focused attitude\nOrganisational and time management skills\nAbility to work in a team environment, whilst meeting tight deadlines\nFollow company policy, procedures, and training regimes\nRemuneration will be commensurate with the qualifications and experience of the successful candidate.\nApplications will close at the company's discretion and all applications will be treated in the strictest confidence.\nfor more information please visit   www,trindservice.co.nz \nApply through Seek with your CV and contact details."}