{"title":"System Control Operators","salary":"Not Found","dataCreated":"2021-04-15","city":"Hawkes Bay","area":"Hastings","employer":"Unison Networks Limited","validThrough":"2021-05-15","type":"Full Time","description":"Unison owns, operates and maintains an extensive network that supplies electricity to more than 100,000 homes and businesses in the Hawkes Bay, Taupo and Rotorua regions. Being a leader in innovation and asset management, Unison is preparing itself for a changing energy future. This new future will rely not only on advanced technologies, systems and artificial intelligence, but also having competent people with the right skills and attitude.\n  \nPivotal to achieving this vision is Unison's 24/7 Network Operations Centre (NOC) - a team of System Control Operators (SCO) and support engineers. The role of the SCO requires quick thinking, problem solving and responding to a variety of events in real-time.\n  \nThe System Control Operator is responsible for:\n  \nReal-time operation of the network:\n \nCoordinating planned and unplanned switching on the network.\nControlling access to high voltage network.\nProviding first response coordination for Emergency Management.\nEnsuring maintenance of prescribed supply limits and protection of system equipment.\nConstantly monitoring loadings and implementing load control as required.\nMonitoring and reporting the functionality of system equipment.\nUtilisation of smart grid real time data to optimise the network and to increase operational efficiency.\nAccurately collating information through historical and analytical reports.\nMonitoring and managing Unisons' building and site security, including remote device security.\nCourteously receiving customer complaints and enquiris 24/7.\nEffectively handling faults and outages on the Network.\n  \nPreparing for and managing shutdowns during planned maintenance activities.\n  \nPreparing and building capability for flexible network services of the future.\n  \nWe have numerous roles available so if this sounds like you, then please apply now. \n  \nAre you interested in this role but are from outside the electrical industry? We would love to hear from you to see how this role could work for you.\n  \nUnison is proud to be an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We also understand that great performance comes from great people. As a valued team member, you will receive ongoing training and development as well as a host of benefits including great remuneration, health insurance, and subsidies to enjoy an active and healthy lifestyle.\n  \nIf you tick the boxes then we would love to hear from you. Apply now!\n  \nApplications Close: 3 May 2021"}