{"title":"Team Leader Customer Connections","salary":"Not Found","dataCreated":"2021-04-19","city":"Canterbury","area":"Timaru & South Canterbury","employer":"Fluid Engineering","validThrough":"2021-05-19","type":"Full Time","description":"Alpine Energy is at an exciting stage of its transformational journey. Due to industry growth and a desire to seek continuous improvement, they are adding significant head count to their team. With the values of Integrity, Safety, Accountability all built on a Foundation of Respect underpinning their journey, Alpine is growing to improve work programme delivery and strengthening their asset management strategies. \nFluid Recruitment is proud to exclusively partner with Alpine Energy in their search for their Team Leader Customer Connections. \nIn this new role you will be leading a five strong team responsible for managing new connections to the network in accordance with industry best practice, ensuring they align with Alpine's strategic objectives and are delivered on time and within budget. In doing so, you will provide support to your team in liaising with a range of customers, advising on technical issues and implementing project management strategies. You will ensure that project progress is being reported and communicated effectively across the business and ensuring that each stage is achieved within a timely manner. With strong communication skills you will enjoy leading a team and empowering others to develop and achieve.\nReporting to the Customer Connections Manager, you will be supporting an experienced manager in ensuring day to day functions are optimised. Bringing an understanding of design, you will be someone who can be hands on but is able to see the bigger picture and bring a level of commercial acumen to your approach. You may come from a range of backgrounds. While experience with design or estimation of distribution is desirable, you may also come from a commercial background that has seen you heavily involved in scoping technical work, providing estimates or providing project management oversight. A tertiary or trade qualification (electrical) will be seen as highly desirable. \nAlpine Energy is at an exciting stage of its transformational journey making now a great time to jump on board. Within a modern office, you will be joining a modern working environment that fosters collaboration and productivity. With regular team events and a strong connection to the South Canterbury community, Alpine take a people first approach. A range of benefits are on offer including generous relocation support to help enable your move. \nFor a confidential discussion around this position please call Tom Stevens. Alternatively, please submit your resume and details the 'apply' button.\nAll shortlisted candidates will receive a full position description to review.\nTom Stevens \nConsultant - Energy \nFluid Recruitment \n03 467 7227 \nwww.fluidrecruitment.co.nz"}