{"title":"Site Manager - Expressions of Interest","salary":"$90,000 - $100,000","dataCreated":"2021-03-22","city":"Otago","area":"Queenstown & Wanaka","employer":"Sodexo","validThrough":"2021-04-21","type":"Full Time","description":"Job Description\nRelocation to Queensland, Australia or FIFO from New Zealand \nDue to growth within the Energy &amp; Resources Sector we are seeking expression of interests from hospitality industry professionals within the hotel/resort or remote site sector to bring their site operational management experience to Sodexo.\nOur Site Managers work in regional and remote Australia within the Energy &amp; resources Sector. They are responsible for the day to day quality and high safety standards in delivering our on-site operations across all functions of site which include catering, housekeeping, accommodation management, industrial cleaning and facilities maintenance.\nIf successful, you may choose to Fly-In-Fly-Out on a 2:1 roster, from New Zealand to our Greater Australia remote sites or Relocate to Queensland Australia for further opportunities.\nYou must be a New Zealand Citizen, Australian Citizen or Australian Permanent Resident or have full working rights in Australia to apply.\nWho we are looking for?\nIf you have previous experience in hospitality management looking after a multi-service venue, facilities management, remote site village management or leadership experience in a similar role we want to hear from you!\nTo be successful, you will need:\n \nManagement experience within the hotel/resort/ hospitality industry looking after food and beverage, housekeeping/accommodation, font of house/administration\nGeneral understanding and experience with facilities maintenance/management\nPrevious accountability for financial budgets, P&amp;Ls and allocation of resources\nDemonstrated experience managing and building multiple stakeholder relationships\nProven ability to deliver on agreed in-scope contract requirements in a timely and efficient manner without compromising on safety\nPrevious experience coaching and mentoring a team, performance management, recruitment, retention and rostering for a casual and full-time workforce\nStrong knowledge of HACCP and Food Safety is highly regarded but not essential\nPrevious remote site experience within the Energy &amp; Resources Sector I s highly regarded but not essential\nWhat's in it for you?\nWe are currently offering full time roles with competitive salaries for experienced managers within the hospitality or facilities management industry who wish to relocate to Queensland, Australia or Fly- in fly-out from New Zealand plus uniforms, recognition/rewards, employee discounts and development opportunities!  The salary range on offer for these roles, subject to experience is $90,000,00 - $100,000.00\nRelocation to Queensland Australia \n \nFull time Roster: 14 days on, 7 days off 11 hour shifts\nFirst flight from New Zealand to site provided by Sodexo\nUp to $2,000 of relocation assistance\nAccommodation and meals provided while on site\nDrive-in, Drive-out or Fly-in, Fly-out from site pending on location\nFly-in, Fly-out from New Zealand\n \nFull time Roster: 14 days on, 7 days off 10 hour shifts\nFirst flight from New Zealand to site provided by Sodexo\n$7,000 travel allowance\nAccommodation and meals provided while on site\nHow to apply?\nIf you are interested in joining the Sodexo team and you meet the minimum criteria above, please apply with your resume detailing relevant employment history and availability.\nShortlisted applicants will be contacted via email initially, with Microsoft TEAMS on line interviews then scheduled.\nAbout Sodexo\nSodexo provides a range of services at remote locations across Australia, servicing both on-shore and off-shore sites, in difficult and challenging environments. At Sodexo, our Energy &amp; Resources segment serves four markets: Mining, Offshore &amp; Marine, Onshore Energy, and Engineering &amp; Construction Projects. Our growing team of employees is dedicated to improving productivity, building meaningful client relationships, reducing on-site problems and improving quality of life for the thousands of Australians who call our remote sites home.\nAdditional Information\nSodexo is a contract services company and employment is conditional to Sodexo’s ability to maintain the client contract and its service levels. All employees are subject to a police check and a Working with Children check (where applicable)"}