{"title":"Power Systems Technician","salary":"Not Found","dataCreated":"2021-03-31","city":"Otago","area":"Rest of Otago","employer":"PowerNet","validThrough":"2021-05-01","type":"Full Time","description":"At PowerNet, our people are committed to providing safe, efficient and reliable supply of electricity to businesses and communities across the lower South Island. We are an industry leader and as such, our progression and innovation is at the forefront of our business where we are committed to learning more about emerging technologies and the impact this will have on our customers, communities and network.\n  \nWe have an outstanding opportunity to join the PowerNet team in the exciting and rewarding role of Power Systems Technician, based out of our Balclutha Depot. In this full time role, you will be responsible for the testing and commissioning of our network equipment.\n  \nExperience/Knowledge and Skills:\n \nRegistered Electrician with a New Zealand qualification in Electricity Supply Power Technician\nCurrent practicing licence\nMinimum 3 years' experience working in a high voltage environment\nProven ability to test/commission control and protection systems relating to the high voltage industry\nProven ability to test/commission high voltage primary equipment, transformers, circuit breakers and associated control systems.\nAbility to work with Scada/RTU equipment, test and fault locate.\nCompetent with Microsoft Office Suite\nStrong numeracy and literacy skills\nBe innovative\nClass 1 New Zealand Drivers licence\nRespond to faults, problem solve and willingness to participate in an after-hours faults roster.\nOur Candidate:\n  \nThe successful candidate will be a highly motivated individual. You will need to be confident and be a team player and contributor. Your commitment and strong communication will see you do well in the industry along with a pragmatic, flexible and adaptable approach. We are looking for people who are up front and honest and really want to make a difference within a company that encourages growth and development and a can do attitude of \\"}