{"title":"HD Fitters | Heavy Duty Diesel Mechanics - Pilbara projects","salary":"$60 - $74.99 per hour + super + perks","dataCreated":"2021-03-22","city":"Auckland","area":"Manukau & East Auckland","employer":"Mining Pathways Pty Ltd","validThrough":"2021-04-21","type":"Full Time","description":"WE'RE YOUR PATHWAY TO GAIN EMPLOYMENT TO THE TOP TIER MINING PROVIDERS\nWe're actively hiring Diesel Mechanics with previous experience maintaining mobile plant in the following industries:\n \nMining\nCivil Construction\nForestry\nAgriculture\nPosition pre-requisites: \n \nHands on experience conducting planned maintenance, servicing, repairs, component rebuilds, breakdowns and/or diagnostic work on earthmoving machinery\nCertificate III in Automotive Mechanical Technology (Mobile Plant) / (Diesel Fitting) / (Heavy Equipment), Diesel Fitter or equivalent (AUS recognised)\nValid Driver's Licence\nAbility to pass a pre-employment medical and Drug and Alcohol Screen\nCurrent Rio Tinto / BHP / FMG inductions advantageous (allows for prompt mobilisation)\n*Trade upgrades on offer for those who hold a heavy commercial or heavy road transport trade with hands-on experience maintaining mobile plant.\nHOW\nSimply forward your resume, qualifications, driver's licence and any other supporting documentation to recruitment@miningpathways.com\nWe highly encourage applicants from all backgrounds and perspectives to apply, as we understand a workplace that promotes diversity, improves overall performance.  Find out why Mining Pathways are more than just recruitment and how partnering with us, is building a better future in mining for everyone. www.miningpathways.com\nOnly shortlisted applicants will be contacted.\nOn a daily basis, Mining Pathways receive vacancies for Heavy Duty Diesel Fitters | Plant Mechanics | HD Fitters | Heavy Equipment Maintenance Fitters (whatever your job title preference), OEM trained or fitters with previous experience maintaining CAT / Komatsu / Hitachi / Liebherr / Atlas Copco / Sandvik mobile equipment.  Therefore if this particular role is not for you, we encourage you to get in touch and let us know what you're ideally chasing in the job market as we may have that position currently available and if not, we will be in touch as soon as a position matches your preferences."}