{"title":"Network Programme and Delivery Manager","salary":"Not Found","dataCreated":"2021-04-19","city":"Canterbury","area":"Timaru & South Canterbury","employer":"Fluid Engineering","validThrough":"2021-05-19","type":"Full Time","description":"Alpine Energy is at an exciting stage of its transformational journey. Due to industry growth and a desire to seek continuous improvement, they are adding significant head count to their team. With the values of Integrity, Safety, Accountability all built on a Foundation of Respect underpinning their journey, Alpine is growing to improve work programme delivery and strengthening their asset management strategies. \nFluid Recruitment is proud to exclusively partner with Alpine Energy in their search for their Network Programme and Delivery Manager. \nLeading a newly created Network Programme and Delivery team, you will be responsible for ensuring the efficient and effective delivery of the annual works programme across the Alpine Network. You will be responsible for making the Asset Management Plan a reality by providing oversight and guidance to a team of Project Managers and support staff, including network procurement and vegetation management. You will be someone who embraces and drives improvement, putting the Network's interests first by developing new project management processes and building robust relationships with a range of contractors. Having licence be creative within an agile environment, you will work closely with a range of stakeholders across the business, including Asset Management, Network Operations and Executive Leadership teams.\nReporting to the General Manager of Service Delivery, you will be stepping into a senior leadership position and be across portfolio management, procurement of works, budgeting and forecasting. With a commercially savvy mindset, you will be able to spot opportunities and ensure work is carried out in a sustainable manner that minimises network outages. You will be someone who communication comes naturally to and have strong relationship management skills. You'll likely come from distribution or transmission with experience related to works programming and delivery. With an open mind, you may also come from another industry such as generation or other utility environment involving large scale contract management. \nAlpine Energy is at an exciting stage of its transformational journey making now a great time to jump on board. Within a modern office, you will be joining a modern working environment that fosters collaboration and productivity. With regular team events and a strong connection to the South Canterbury community, Alpine take a people first approach. A range of benefits are on offer including generous relocation support to help enable your move. \nFor a confidential discussion around this position please call Tom Stevens. Alternatively, please submit your resume and details the 'apply' button.\nAll shortlisted candidates will receive a full position description to review.\nTom Stevens \nConsultant - Energy \nFluid Recruitment \n03 467 7227 \nwww.fluidrecruitment.co.nz"}