{"title":"GAS Network Trainee","salary":"Not Found","dataCreated":"2021-04-19","city":"Auckland","area":"Manukau & East Auckland","employer":"Northpower Ltd","validThrough":"2021-05-20","type":"Full Time","description":"- Looking for your next role with a proven company and a great team?\n- Full training and support will be given towards a qualification in gas distribution.\n- An opportunity to join our team to work on various gas network projects!\nAbout us\nNorthpower is an electricity and fibre network provider for Whangarei and Kaipara, with more than 60,000 connected customers. We also provide contracting services to our partners – other network owners and operators across the North Island.We have over 1,300 staff working together across 13 locations to keep the power on and the lights going for our customers.\nThe role\nAs a GAS Network Trainee your duties will involve network construction, locating obstructions, excavating trenches, providing safeguards to protect environment &amp; public and other associated general labouring work.\nNorthpower is experiencing sustained growth and is looking to add to their experienced and established teams. You will receive support and training in this role while providing support to the team.\nWhat we’re offering\nFull support and training provided towards attaining qualifications in gas distribution construction.\nAn interesting role within a great team\nThe chance to work with a company who puts our people at the heart of the organisation and is committed to safety\nCompetitive remuneration, an in-house wellbeing programme and initiatives including group discounted medical insurance\nWho we’re looking for\nWe’re looking for a candidate who has passion and is seeking a new opportunity or a career within Gas Distribution. You will need to be good at planning and managing your time. We depend on these roles to give assistance to our supervisors and managers to ensure jobs get completed on time for our customers.\nYou will need to demonstrate the following:\nCommitment to a skilled career path\nGreat verbal and written communication skills\nA strong commitment to health and safety\nA great attitude and a willingness to be part of a team\nHave an excellent attitude towards safety\nHave the ability to follow instructions\nEnjoy working outside\nHold a full class one drivers licence\nGet in touch!\nWe’d love to hear from team players who fit the above and have a great ‘can do’ attitude.\nDue to current border restrictions, unfortunately applications from international candidates or those without the right to work in New Zealand cannot be considered. \nNorthpower has an in-house recruitment team who manage recruitment for all our vacancies.  If you're interested in a role with us we would encourage you to apply directly online to us, as we don't accept candidates via agency (unless the role is advertised by the agency at our request)."}