{"title":"Underground Shift Supervisor","salary":"Not Found","dataCreated":"2021-04-09","city":"Bay of Plenty","area":"Rest of Bay of Plenty","employer":"OceanaGold (New Zealand) Ltd","validThrough":"2021-05-09","type":"Full Time","description":"Waihi has a rare opportunity for an experienced Underground Shift Supervisor to join the crew. Reporting to the Underground Mine Foreman your primary responsibility is to ensure the underground mining operations equipment, production and utilisation targets are achieved in a cost effective, timely and safe manner.\nRole modelling our company values whilst ensuring industry best practice, following mining regulations and our approved procedures; you will bring to the role at least five years experience in underground metalliferous mining and previous experience in a supervisory role. You will be well skilled in achieving production targets, leading people, team building and performance management.\nKey tasks and responsibilities: \nLeading, coaching and developing your crew\nSupporting the Mine Foreman to achieve strategic objectives and required outputs\nLiaising with internal stakeholders and external contractors\nSupervising both production and development activities\nOverseeing pre-shift safety and toolbox safety meetings\nMonitoring operator compliance to our Company SOPs, conducting inspections and audits every swing\nGenerating ideas and solutions and supporting your crew to do the same\nTo be successful you will need the following:\nNew Zealand A or B Grade Tunnel Managers Certificate of Competency\nPrevious supervisory experience\nExtensive knowledge of practices and techniques applied in metalliferous underground mining\nAn intermediate level of computer literacy\nStrong communication skills\nThis is an exciting opportunity to join a team committed to achieving an injury free work environment, who have a high regard for personal safety, fitness for work, and the safety of their workmates.\nIf you are a Kiwi looking to return home or looking for a residential role whilst working in mining this could be just the role for you!\nOUR VALUES: \nRESPECT - \nONE TEAM - \nCONTRIBUTE - K\nNOWLEDGE\nApply online via \nwww.careers.oceanagold.com \nand you could be starting a new challenge very soon!\nApplications close Thursday, 22 April 2021. Shortlisting will commence immediately."}