{"title":"Geothermal Maintenance Technician - Mechanical","salary":"Not Found","dataCreated":"2021-04-08","city":"Bay of Plenty","area":"Rotorua","employer":"Mercury","validThrough":"2021-05-08","type":"Full Time","description":"Mercury is the most widely-owned business in New Zealand with core strengths in harnessing renewable energy and innovating for our customers. We're thinking boldly about the future and how we can use energy in wonderful ways to inspire Kiwis, creating a brighter future for our country and growing value for our owners.\nOur Opportunity:\nBased at our Kawerau Power Station, you'll be part of an integral team that maintains and operates Mercury's geothermal generation assets, from wellhead to turbine and back to wellhead. The station itself utilises geothermal steam to drive a single Fuji turbine, is a double flash process and generates over 100MW/h of electricity. The role works alongside staff from production, engineering, reliability and other Mercury generation sites to ensure that this process is optimised, reliable and safe. We are looking for an individual that is motivated, conscientious and able to work as a team and on their own.\nKey responsibilities include:\nScope, plan, schedule and manage maintenance tasks\nTroubleshoot and problem solve plant upsets and issues\nIdentify, share and implement continuous improvement initiatives\nCollect and document plant performance and maintenance history\nChampion a world class attitude to health and safety management\nWe are looking for:\nTrade qualification in Maintenance and Diagnostics or Mechanical Engineering Level 4. Advanced trade qualification or NZCE Level 6 is an advantage.\nPlant operations / process control or maintenance experience in heavy industry\nSkills in maintenance planning, contractor management and the use of CMMS (Computerised Maintenance Management Systems)\nConfident using computers\nEnthusiasm and passion for a job well done\nAt Mercury, you are offered:\nAdditional 5 days leave per annum (MyDays)\nFocus on health and wellbeing including $100 towards an annual health check\nOngoing development and excellent career opportunities\nDiscounted health insurance and free life and income insurance\nA full position description is attached below. Applications close 22nd April at 5:00pm.\nDue to New Zealand borders remaining closed, we are only able to accept applications from individuals either already in New Zealand, returning NZ Citizens and Permanent Residents or Australian Citizens."}