{"title":"Aircraft Refueler","salary":"Not Found","dataCreated":"2021-04-15","city":"Wellington","area":"Wellington Central","employer":"NES Fircroft","validThrough":"2021-05-15","type":"Full Time","description":"Aircraft Refueller\n \nEnergy Industry\n Fantastic opportunity to join one of the world’s leading Oil, Gas and Energy companies that have been operating in New Zealand for around 120 years. They are currently seeking an \nAircraft\nRefueller \nto join their Wellington based team. \n The role will be focused around the safe and correct handling, storage and movement of our client’s products including the refueling of planes and tankers. \n \nThis is an entry level position with full training provided so do not miss out to start your career with a world leader in the fueling industry. The intention will be for this person to also become involved in maintenance duties down the track also so if you are mechanically qualified this could be a fantastic new career path.\n \nRole Responsibility:\nMaintain product quality and complete daily product quality checks\nCorrect recording of all stock movement / sales\nCommitment to Health and Safety\nEnsure refueling is completed in timely fashion\nMaintain all necessary records on refueling / product quality activity\nAct as first line contact with customers and outside departments\nSkills and Qualifications:\nMUST have a strong work ethic and punctual\nPreferably trade qualified\nClass 4 License required\nDangerous Goods Endorsement\nStrong written language skills and numerical skills\nGood communicator\nGrab this awesome opportunity to take the next step in your career and break into a world-renowned organisation.\n This is an urgent requirement, so don’t delay, APPLY NOW.\n For a confidential chat on the role please phone Thomas on 0212477391 for further information.\nWith over 90 years' combined experience, NES Fircroft (NES) is proud to be the world's leading engineering staffing provider spanning the Oil &amp; Gas, Power &amp; Renewables, Infrastructure, Life Sciences, Mining, Automotive and Chemicals sectors worldwide.With more than 100 offices in 45 countries, we are able to provide our clients with the engineering and technical expertise they need, wherever and whenever it is needed. We offer contractors far more than a traditional recruitment service, supporting with everything from securing visas and work permits, to providing market-leading benefits packages and accommodation, ensuring they are safely and compliantly able to support our clients."}