{"title":"Project Manager","salary":"Not Found","dataCreated":"2021-04-20","city":"Canterbury","area":"Timaru & South Canterbury","employer":"Alpine Energy","validThrough":"2021-05-20","type":"Full Time","description":"Alpine Energy is at an exciting stage of its transformational journey.  Due to industry growth and a desire to seek continuous improvement, they are adding significant head count to their team.  With the values of Integrity, Safety, Accountability all built on a Foundation of Respect underpinning their journey, Alpine is growing to improve work programme delivery and strengthening their asset management strategies.\nWhat’s involved\nImproving project management, capability &amp; efficiencies this role is responsible for delivering Network Projects and Programmes. The Project Manager provides end-to-end project management for Alpine Energy ensuring completion of projects and programmes safely, on time, to agreed standards and within budget.\nYou will actively deliver projects with support from the project engineers, build and develop sustainable project management capability by role modelling best practice from draft to implementation and operational handover stages of the project.\nThe majority of time in this role will be spent on analysing performance, identifying issues and recommending solutions to the Service Delivery Management team.\nAlpine Energy is at an exciting stage of its transformational journey making now a great time to jump on board.  You will be joining a modern working environment that fosters collaboration and productivity.  With regular team events and a strong connection to the South Canterbury community, Alpine takes a people first approach.  A range of benefits are on offer including generous relocation support to help enable your move.\nFor a confidential discussion around this position please email Damien Whiffen (damien.whiffen@alpineenergy.co.nz).  Alternatively, please submit your covering letter and resume.  All applications will be treated with the strictest confidence. You must have the right to live and work in New Zealand.\nFor a copy of the Job Description visit <a href=\\"}