{"title":"Line Mechanic","salary":"Not Found","dataCreated":"2021-03-24","city":"Canterbury","area":"Rest of Canterbury","employer":"EA Networks","validThrough":"2021-04-24","type":"Full Time","description":"About EA Networks\n\\n\\n\nAt EA Networks, we are focused on ensuring our community has access to world class, reliable and affordable network infrastructure. We are the trusted infrastructure platform that delivers electrical energy to every home and business in our region. We own and operate our region's electricity distribution network and fibre optic communications network, which we continuously invest in to ensure that we keep the lights on and the web connected.\n\\n\\n\nAbout the Role\n\\n\\n\nYou will be an experienced and qualified Line Mechanic whose focus will be to install, repair and maintain the overhead electrical distribution within our network.\n\\n\\n\nAll the work you perform will be done while promoting and practising positive health and safety.\n\\n\\n\nRequired Skills &amp; Experience\n\\n\\n\n\\n\\t\nClass 1 drivers licence, additional licences would be an advantage.\n\\n\\t\nEWRB Distribution Line Mechanic registration and a current practising licence.\n\\n\\t\nExperience working on LV, 22, 33 and 66kV\n\\n\\t\nLive Line or Glove and Barrier experience would be great but not essential.\n\\n\\t\nA team player and good communication skills.\n\\n\n\\n\\n\nJoin us\n\\n\\n\nA competitive hourly rate is on offer for this role, as is the opportunity to work for a stable, trusted organisation at our modern, purpose-built business park premises. EA Networks has a strong focus on people, culture and a commitment to leading edge technology.\n\\n\\n\nIf you would like to pursue the opportunity presented by this dynamic role, please submit your CV and Covering Letter in confidence.\n\\n\\n\nPlease note\n: Applicants for this role must be legally entitled to work in New Zealand.\n\\n\\n\nFor more information about the role and EA Networks,\n\\nplease visit eanetworks.co.nz"}