{"title":"Line Mechanic roles available in Rotorua, Hastings and Dunedin","salary":"Not Found","dataCreated":"2021-04-07","city":"Bay of Plenty","area":"Rotorua","employer":"Unison Networks Limited","validThrough":"2021-05-08","type":"Full Time","description":"Unison Contracting Services Ltd\n - one of New Zealand's largest electrical distribution contractors, has recently expanded its operations and is looking for experienced Line Mechanics to join tour team and manage their rapid growth. We have positions available in Rotorua, Hastings, Taupo and Dunedin.\nIf you are interested in developing your career further with a company that is truly committed to growing a diverse and inclusive workforce, please read on.\nWe are currently looking to hire experienced line mechanics in all our regions.  With safety as our top priority you'll be working to industry best practices with modern tools and equipment.\nAs well as competitive rates of pay we also value career development and how we can ensure our employees are engaged and empowered. At Unison, you will always feel like your voice is being heard.\nTo be successful in this position you will need:\n \nA current New Zealand Electrical Registration as a Line Mechanic\nExperience working on lines up to and including 33kV\nBe 100% committed to Safe Working Practices\nExperience erecting poles both wooden and concrete\nExperience fault-finding on overhead equipment\nExcellent communication skills, interpersonal skills and a team player approach\nAvailable for standby roster and working away from home if required\nAt Unison we will provide:\n \nA safe and enjoyable workplace, where safety and wellbeing are our top priority\nPermanent positions with competitive remuneration package\nLife, trauma and income protection insurance\n$200 per year Wellbeing subsidy\nOnsite gym\nOpportunity for overtime and allowances\nModern tools &amp; equipment\nOngoing training and development\nNever has there been a more exciting time to be part of the distribution industry. If you are keen to apply please follow the link below.  In your cover letter, please state which region is of interest to you.\nUnison is proud to be an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We also understand that great performance comes from great people. As a valued team member, you will receive ongoing training and development as well as a host of benefits including great remuneration, health insurance, and subsidies to enjoy an active and healthy lifestyle."}