{"title":"Energy and Emissions Adviser","salary":"Not Found","dataCreated":"2021-04-07","city":"Taranaki","area":"New Plymouth","employer":"New Plymouth District Council","validThrough":"2021-05-07","type":"Full Time","description":"Do you want to make a difference in your community? \nDo you want to create a more sustainable community?\nWe are looking for an Energy and Emissions Adviser to help us tackle our climate change challenges. Do you understand the big picture and have good technical knowledge of energy consumption and emissions reduction? Do you also have a flare for communicating complex issues in a simple way?\nIn this role you will work across New Plymouth District Council on emissions reduction and will be a key contributor to NPDC's first Emissions Reduction Plan. You will be a people-focused person and will develop and maintain constructive relationships with Council's key energy suppliers. You will be a pragmatic, solution-orientated person who enjoys working in a collaborative team environment and can inspire others to think and act differently. You will have proven experience in emissions reduction and energy management and an understanding of how to drive culture change initiatives. A tertiary qualification in a related technical discipline is required.\nNew Plymouth District Council plays a key role in supporting community well-being, the economy, the environment and the overall quality of life in the New Plymouth District. Our Council vision is to build a lifestyle capital, and being part of our team means you will help make our district a better place to live and to work. At New Plymouth District Council, we embrace diversity and have a culture that is built on trust and respect. We offer flexible working (where available) and you get to work with a team of dedicated experts who share a passion for making a difference. We have put together an integrated Total Rewards framework that spans wellbeing, development, benefits, culture and recognition. The NPDC Total Rewards framework provides a diverse range of opportunities and benefits for our staff.\nApplications close on Wednesday, 21 April 2021."}