{"title":"Quality Assurance Officer","salary":"Not Found","dataCreated":"2021-04-16","city":"Otago","area":"Dunedin","employer":"Aurora Energy","validThrough":"2021-05-16","type":"Full Time","description":"About Us\nAurora Energy is New Zealand’s seventh-largest electricity distribution company, supplying power to more than 90,000 homes, schools, farms and businesses in Dunedin, Central Otago and Queenstown Lakes. We’re in a major phase of network renewal that touches nearly every part of the community.\nThe Role\nThis is a great opportunity to play a key role in monitoring contractor’s performance and work constructively with them to uphold network construction standards and ensure compliance with Aurora’s safety and risk, and quality standards. The role will involve a significant amount of field work and site audits including use of mobile technology platforms, along with continually reviewing documentation and regular reporting. This role may suit experienced technicians, line mechanics or other technically minded people within the industry who are looking for a new challenge and/or want to further their career.\nRole Requirements\nTo complement our current team and hit the ground running, we are really keen to hear from people who can demonstrate the following: \n  \nA current Electrical Registration with practical knowledge of hazard management controls within the electrical industry and willingness to undertake ongoing professional development.\n  \nHigh attention to detail and work standards, with a diligent focus on safety and risk requirements.\n  \nThe ability to constructively raise concerns, clearly communicate and hold others accountable whilst maintaining good relationships. \n  \nProficient in the use of the Microsoft Office suite with a willingness to learn new mobile technology devices and programmes.\n  \nA strong work ethic, including the ability to efficiently organise your day and follow-through on all on commitments. \n  \nA full driver’s licence\nApply\nWe see diversity as a strength and welcome applications from anyone who has what it takes, regardless of gender, ethnicity or background. If you think you are a good fit for the role click the ‘Apply Now’ button to submit your application. \nFor a copy of the Job Description visit <a href=\\"}