{"title":"Electrical Engineer (Primary) - Transmission & Distribution","salary":"Not Found","dataCreated":"2021-04-01","city":"Auckland","area":"Auckland Central","employer":"AECOM New Zealand Ltd","validThrough":"2021-05-02","type":"Full Time","description":"Put your innovative thinking, technical excellence and passion into high gear.  When you join a company that’s building a better world, your opportunities are unlimited.  At AECOM, we design, build, finance, operate and manage projects that unlock opportunities, protect our environment and improve people’s lives.  Every day our team explores new possibilities for a better world.  Cleaner transportation.  \nHealthier communities and environments.  Resilient cities. \nAs an Electrical Engineer within our highly successful Transmission &amp; Distribution team, you will be involved in the primary design of substation projects throughout Australia and NZ (ANZ).  You will be working with a wide range of high calibre clients on the preparation of SLDs, electrical layouts, sections and BoM, earthgrid design and lightning protection studies.\nAt AECOM, we enjoy and encourage learning in a supportive environment where professional development opportunities are actively encouraged.  This is a fantastic opportunity to be part of an innovative, highly motivated team of technical professionals and be instrumental in delivering key power related projects throughout NZ and Australia.\nDay to day responsibilities include:\n \nConcept and Detailed Design of indoor and outdoor substation primary systems for NZ clients\nEarthing design in CDEG0S and power cable design in CYMCAP (not essential, but preferable)\nSite visits, inspections and testing as required (e.g. soil resistivity testing)\nPreparing design reports, including cost estimates and project schedules\nManaging smaller projects or parts of larger projects\nInterfacing directly with clients on projects and new opportunities\nProviding technical expertise in accordance with project time, quality, and cost objectives\nAbout You\nYou will ideally have a background in primary electrical design working with a strong technical acumen and a desire to grow your career at AECOM.\n \nUniversity degree - BE Electrical/Electronic Engineering or equivalent\nMinimum of 3 years relevant experience in transmission and distribution substation design\nSite experience and/or experience in projects being constructed and commissioned\nExperience in suitable software packages\nExcellent organisation and communication skills\nSelf-motivated and keen to progress career\nStrong team player who collaborates easily with others across multiple disciplines\nWhat we Offer at AECOM\nAECOM recognises that balance is key to a successful career and that fluidity between work, family and play is characteristic of our times. Our approach is to help you make a difference not only in the workplace, but in your community and to those who matter most to you.\nYou will have access to a range of benefits:\n \nGenerous paid parental and partner leave\nPurchasing additional annual leave (up to four weeks)\nPaid volunteer leave\nHealth insurance\nLife insurance\nKiwi Saver – up to 4% employer contribution\nStudy assistance\nFlexible working options including working from home, part-time\nMobile phone inclusive of calls and internet\nWork from home kit\nFruit bowls, morning teas, social clubs and events\nProfessional development and ongoing career opportunities\n \nAECOM does not accept unsolicited resumes from recruiters or recruitment agencies. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM and in the absence of a signed Agreement, AECOM will not consider or agree to payment of any recruitment fee."}