{"title":"Network System Controller - West Coast","salary":"Not Found","dataCreated":"2021-03-31","city":"Canterbury","area":"Christchurch","employer":"Fluid Engineering","validThrough":"2021-05-01","type":"Full Time","description":"Fluid Recruitment is proud to exclusively partner with Westpower in their search for a new Network System Controller to join the Asset Management Team.\n \nThe Role\n Coming into a unique environment, you will be responsible for controlling both Westpower's distribution network and generation station, ensuring Westpower's customers enjoy a reliable supply of electricity. You will do so in a 'day control room', working normal business hours Monday to Friday as well as being part of the on-call roster.\n In controlling the distribution network, you will be involved in works planning, outage planning and fault response. In doing so, you will ensure that staff accessing the network do so in a way that ensures the safety of Westpower's contractors, customers and plant. This will see you communicating with a range of stakeholders including those in the field and keeping the public informed with various events.\n As part of a tight knit, Asset Management team there is the unique opportunity to not only collect data and insight but to contribute and provide input into the broader asset management of the network across all asset classes.\n \nAbout You\n With the opportunity for a Trainee Controller through to a Senior Controller, we are open minded as to your background and level of experience. What we do know, is that you will be someone with a good understanding of distribution or transmission networks and have a level of practical experience, whether it be in the field, the Control Room or in an engineering capacity.\n No matter your background, you will be a calm individual who works well under pressure and has strong communication skills with the ability to interact with your peers and those on the ground.\n \nThe Opportunity\n With its office in Greymouth, it is the perfect spot if you are looking to be close to the outdoors, with the likes of Arthurs Pass National Park and Franz Josef Glacier nearby. You will be joining a down to earth team who enjoy taking advantage of what is on offer in their backyard.\n As well as owning the distribution network and hydrogeneration station, Westpower is part of a broader business group, sitting alongside sister companies Mitton ElectroNet and ElectroNet Services.\n It is a great time to join Westpower as they implement their new ADMS, providing an opportunity to learn and grow with the business. You will be joining a mature network with modern equipment and one that invests in their people, with training and mentoring provided.\n If you are looking for a long-term career option or a change of lifestyle then this presents a unique opportunity, one not to be missed. Relocation support will be provided for the right candidate.\n \nApply\n If this opportunity sounds like it is for you then APPLY NOW. Alternatively, for a confidential discussion about this role please feel free to contact me.\n All shortlisted candidates will be provided with a position description and further information.\n \nTom Stevens\n \nConsultant - Energy\n \nFluid Recruitment\n \n03 467 7227\nwww.fluidrecruitment.co.nz"}