{"title":"Mine Operator- Experienced Driller","salary":"Not Found","dataCreated":"2021-04-20","city":"Otago","area":"Rest of Otago","employer":"OceanaGold (New Zealand) Ltd","validThrough":"2021-05-20","type":"Full Time","description":"Join Macraes- NZ largest gold mine\nEquipment Operator - experienced driller operating top-hole hammer and or med/large diameter blasthole rotary drills\nGreat lifestyle roster: rotating day/night roster\nThe Open Pit Blast Crew are currently looking for a Mine Operator experienced in drilling, to join their team. Previous experience operating either a variety of top-hole hammer blasthole drill rigs or Sandvik D45KS rotary drills is required but attitude and a willingness to learn further are also important attributes!\nThe position available is working on a 2/3 roster pattern: four days on, three nights on, four days off; three days on, four nights on, three days off\nKey tasks and responsibilities:\nOperate either a variety of top-hole hammer blasthole drill rigs or Sandvik D45KS rotary drills\nEnsure safe and efficient operation of equipment at all times\nAchieve agreed production and personal objectives\nCarry out pre-start and post operational checks as required\nTo be successful in this role you will have the following:\nHold a full, clean, current driver's licence and are confident driving a manual vehicle\nCan communicate within a team environment\nMinimum two years drilling experience\nHave an interest in heavy machinery\nBe a safety conscious individual committed to maintaining an excellent safety record­\nPass a pre-employment medical including drug and alcohol testing­­\nThis is a great opportunity to further your career in mining or continue to share your skills to our unique and scenic place within a positive team.\nAbout the company\nOceanaGold Corporation is a mid-tier, multinational gold producer with assets in the Philippines, New Zealand and the United States. On the North Island of New Zealand, the company operates the high-grade Waihi Gold Mine while on the South Island; the company operates the country’s largest gold mine, the Macraes Goldfield.\nAt OceanaGold, health and safety are paramount to the success of our business as are employees who engage in behaviours that align with our values.\nOGC VALUES\n:\nRESPECT|ONE TEAM|CONTRIBUTE|KNOWLEDGE\nOceanaGold is committed to providing equal employment opportunities.\nIf you share the same values and have what we are looking for, please apply online now via our website:www.careers.oceanagold.com\nApplications close Sunday, 2 May 2021. Shortlisting will commence immediately.\nApplicants must be eligible to work in New Zealand.\nDue to COVID 19 border restrictions in New Zealand we are unable to consider applicants outside of New Zealand who are not NZ citizens or permanent residents.\nNO APPLICATIONS FROM EMPLOYMENT AGENCIES WILL BE ACCEPTED"}