{"title":"Superintendent - Geology (Waihi Operation)","salary":"Not Found","dataCreated":"2021-04-07","city":"Bay of Plenty","area":"Rest of Bay of Plenty","employer":"OceanaGold (New Zealand) Ltd","validThrough":"2021-05-07","type":"Full Time","description":"Work for a world class mine \nLifestyle opportunity - Monday to Friday, close to the beautiful beaches of the Coromandel \nCompetitive salary, bonus, Southern Cross Health Insurance and relocation costs \nThe role\nWe are looking for a competent/qualified professional to join our Exploration and Geology team. As the Superintendent - Geology you will be responsible for the management of the Resource Development, Operations and Database Geological functions. The role will provide input into resource definition drilling programmes and oversee the geological modelling and resource estimation functions to maximise the resource development pipeline into scoping, prefeasibility and feasibility studies for advancement projects for OceanaGold Waihi.\nKey tasks and responsibilities: \nManagement and coordination of geological inputs and resource estimation services for scoping, prefeasibility, feasibility, development projects, consenting and operations\nManagement of resource development and grade control to meet the needs of the business and LOMP\nManagement and coordination of data and systems administration including distribution and prioritisation of workload to achieve database milestones\nEnsure that resource/grade control modelling and reconciliation are managed to ensure appropriate ore definition and extraction. Responsible for oversight of production monitoring systems to ensure variance is understood and responded to in a timely manner and business risk is appropriately managed.\nCollaboration with mining engineers and metallurgists to ensure the production of reserve estimates, budgets and integrated schedules and associated technical reports\nChampion value creation through the identification and framing of risk and opportunity within the mine and advanced project\nResponsibility for annual resource statements and accompanying reports\nThe successful candidate will have the following: \nUniversity Degree, B.Sc. or M.Sc. in Geosciences with knowledge of geological principles\nQualified to sign off for JORC and NI 43101 compliant resources\nMinimum 18 to 20 years in mine geology, production, project execution, geological and resource modelling\nMinimum six years supervisory experience\nStrong technical computing and project management skills (planning &amp; budget management)\nExperience and a good understanding of open pit and underground grade control, ore tracking, reconciliation, and reporting systems\nHigh level of competency in the use of modelling and estimation software (Vulcan, Minesight, Datamine, GSLIB, Supervisor, Leapfrog, Leapfrog EDGE) with a strong background in problem solving and 3D visualisation skills.\nGood understanding of geostatistical and classical estimation methods\nFull and current driver's licence, ability to drive manual vehicles is preferred\nAbout the company\nOceanaGold Corporation is a mid-tier, multinational gold producer with assets in the Philippines, New Zealand and the United States. On the North Island of New Zealand, the Company operates the high-grade Waihi Gold Mine while on the South Island; the Company operates the country’s largest gold mine, the Macraes Goldfield.\nAt OceanaGold, health and safety are paramount to the success of our business as are employees who engage in behaviours that align with our values.\nOGC VALUES\n:\n RESPECT | ONE TEAM | CONTRIBUTE | KNOWLEDGE\nOceanaGold is committed to providing equal employment opportunities.\nIf you share the same values and have what we are looking for, please apply online now via our website: www.careers.oceanagold.com\nApplications close Friday, 30 April 2021. Shortlisting will commence immediately.\nApplicants must be eligible to work in New Zealand.\nNO APPLICATIONS FROM EMPLOYMENT AGENCIES WILL BE ACCEPTED"}