{"title":"Specialist Major Hazards","salary":"Not Found","dataCreated":"2021-04-13","city":"Southland","area":"","employer":"Rio Tinto","validThrough":"2021-05-13","type":"Full Time","description":"Specialist Major Hazards\nBe part of a group that is safety driven and values inclusion\nPermanent opportunity with flexible work hours\nLocation is Invercargill, New Zealand\nAbout the role\nWe are looking for a Specialist Major Hazards to improve the inherent operability and integrity of assets and processes through the identification and improved understanding of the critical equipment, procedures and practices. The scope of our Major Hazards includes molten materials, LPG, hydrocarbon storage and other bulk hazardous substances. While we are not designated as a ‘major hazard facility’ in New Zealand, we apply the same principles to our operating standards.\nThis is a great opportunity for a safety focused leader to liaise closely with our onsite leadership teams to ensure the safety standards related to our Major Hazards are interpreted correctly and the requirements are understood to ensure our training packages and audits of our critical control functions are in place.\nIn addition to paying competitively and providing great benefits packages, we want you to live the lifestyle that is right for you and your family. And because of our size and scale, there are many opportunities to learn, grow and do more than you ever thought possible.\nEvery hour of every shift, your safety and wellbeing is our number one priority. We do the work only if it is safe, and we invest to make sure every member of the team has the quality tools they need to do their job.\nReporting to the Health, Safety &amp; Environment Manager and working in a collaborative community which extends across Australasia you will:\nMaintain and promote high standards in the areas of health, safety, risk assessment and risk management related to our major hazards\nWork with site leaders to interpret and understand the Rio Tinto standards required to manage our major hazards\nPerform audits of machinery, safety equipment and management programs to identify and correct potential hazards and to ensure safety compliance to regulations and standards\nParticipate in process safety incident investigations, including root cause analysis\nFacilitate Process Hazard Analysis workshops to identify critical controls and verification programmes\nDevelop and maintain a site process safety hazard risk register\nSolve complex risk and safety design issues\nWhat you’ll bring\nA commitment to the safety of yourself and the team\nA tertiary qualification in an Engineering or Applied Science discipline\nExperience in process safety management preferably in a high risk work environment\nSound knowledge of risk management, risk assessments and their application\nExposure to a range of control system hardware and software products\nAbility and willingness to coach others in process safety\nWhat we offer\nA safety-focused and inclusive working environment\nA competitive salary package with annual cash incentive awards (STIP)\nAccess to top tier family-friendly health and medical programs\nExcellent retirement plan\nA comprehensive leave policy that covers all moments that matter in life (vacation/annual, paid parental leave, short term sick leave, paid holidays)\nOngoing individual wellbeing support for you and your family for personal and professional matters\nGenerous Rio Tinto employee share program\nAbout Rio Tinto\nEvery idea, every innovation, every little thing the world calls ‘progress’ begins with a first step, and someone willing to take it: explorers, inventors, entrepreneurs. Pioneers.\nFor nearly 150 years, Rio Tinto has been a company of pioneers – generations of people spanning the globe, all with the grit and vision to produce materials essential to human progress.\nOur iron ore has shaped skylines from Shanghai to Sydney. Our aluminium – the world’s first to be certified “responsible” – helps planes fly and makes cars lighter. Our copper helps wind turbines power cities and our boron helps feed the world, and explore the universe. Our diamonds help us celebrate the best parts of life.\nWhere you’ll be working\nBased at Tiwai Point in New Zealand’s south, NZAS makes aluminium with one of the lowest carbon footprints in the world, and it is the only aluminium smelter to produce ultra-high purity metal using renewable hydroelectricity. Receiving the majority of its alumina from our Yarwun and Queensland Alumina Limited refineries in Gladstone, Australia, the smelter produces more than 335,000 tonnes of aluminium each year.\nIn January 2021, NZAS reached a new electricity agreement which will extend operations to December 2024. By joining us now, we will set you up for the future. Work is already underway to reskill and retrain our people, with skills transferrable to other industries.\nEvery Voice Matters\nAt Rio Tinto, we particularly welcome and encourage applications from Indigenous Peoples, women, the LGBTQIA+ community, mature workers, people with disabilities and people from different cultural backgrounds.\nWe are committed to an inclusive environment where people feel comfortable to be themselves. We want our people to feel that all voices are heard, all cultures respected and that a variety of perspectives are not only welcome – they are essential to our success. We treat each other fairly and with dignity regardless of race, gender, nationality, ethnic origin, religion, age, sexual orientation or anything else that makes us different.\nAdvert closes - 26 April 2021"}