{"title":"Line Mechanic","salary":"$30 - $35/hr + additional allowances if applicable","dataCreated":"2021-04-09","city":"Canterbury","area":"Timaru & South Canterbury","employer":"NETcon Limited","validThrough":"2021-05-09","type":"Full Time","description":"Reach new heights with us!\nAs a Line Mechanic, you will  be part of a team that builds and maintains the power lines as well as providing line fault repair services in Timaru, South Canterbury.\nIf you have experience in overhead line construction and maintenance, and a background in the electrical distribution industry, this could be a great move for you!\nNETcon is an industry leader when it comes to operating and maintaining electricity networks in the South Canterbury region.\nWe look after a dynamic network that covers the area between the Rangitata and Waitaki Rivers, from the coast inland to Mount Cook.\nWhat’s involved:\nInstall replace and maintain overhead electricity distribution equipment, poles and pole mounted equipment, i.e. transformers, fuses, switches, circuit breakers, conductors, insulators, terminations and connections etc.\nHave a great attitude to health and safety so we can maintain NETcon's record of working safely and going home to our families.\nSupport your mates in the field, creating a positive culture, sharing information, knowledge and expertise.\nBe part of a 24/7 fault response that helps keep the power on in Timaru.\nWe will be looking for someone who is:\nEWRB Registered Level 4 Line Mechanic with a current practicing license.\nExperienced in the electrical distribution industry.\nLive line, glove &amp; barrier qualifications and experience would be great.\nEligible to work in New Zealand, with New Zealand citizenship or New Zealand permanent residency.\nCurrent NZ Driver's License, Class 4 preferred (minimum Class 2).\nNETcon requires all successful applicants to complete pre-employment checks which include a medical test, drug and alcohol test and a Ministry of Justice check.\n Apply by submitting a covering letter and CV, telling us why this position should be yours.  All applications will be treated with the strictest confidence."}