{"title":"HSE - Senior Advisor","salary":"Not Found","dataCreated":"2021-04-16","city":"Auckland","area":"Manukau & East Auckland","employer":"Electrix Ltd","validThrough":"2021-05-16","type":"Full Time","description":"Electrix Limited is a high profile, long term leader in the Australasian electrical and gas contracting markets. Electrix Limited is also one of New Zealand's foremost electrical construction and maintenance companies and provides a wide range of services to the power, electricity, gas, industrial and commercial sectors.\n\\n\nWe are looking for an experienced HSE Senior Advisor who sees themselves as an influential leader with a strong collaborative focus, an analytical mind and someone who can think ahead to assist Electrix's safety and environmental culture.  This position is based at our Mt Wellington office.\n\\n\nAccountabilities of the position\n\\n\n\\n\nEnsure the Business Unit HSE operational risks are identified, communicated and managed\n\\n\nWork with the Business Unit key stakeholders to ensure the HSE relevant EMS requirements and HSE strategy initiatives are implemented and practiced to a high standard\n\\n\nContribute to operational HSE innovation to mitigate HSE risk in accordance with legislation, regulatory and industry guides\n\\n\nCommunicate and consult with the Perimeter HSE Manager and HSE advisors, HSE representatives, contract and project managers and field staff as required.\n\\n\nLead and influence the implementation of HSE practices across all levels of the Business Unit\n\\n\nSupport the Business unit with unforeseen HSE matters\n\\n\nEnsuring HSE technical control alignment with regulatory requirements, client requirements and consistency of good practice deployment across the Business Unit\n\\n\nCommunicating and consulting with the Perimeter HSE manager and HSE advisors, HSE representatives, contract and project managers and field staff as required.\n\\n\n\\n\nWhat you will need \n\\n\n\\n\nNational Certificate/Diploma (or equivalent) in Health, Safety and Environment is required\n\\n\nEngineering or trade qualification is preferred\n\\n\nA sound knowledge of the Health and Safety at Work Act and its application in the workplace\n\\n\nSite Safe training\n\\n\nHSE investigation training\n\\n\nEnvironmental compliance training/knowledge is preferred\n\\n\nAudit training\n\\n\n\\n\nWe are offering:\n\\n\nAt Electrix we strive to be an employer of choice and for the right candidates it can be the start of an interesting and varied career.  Additional to that:\n\\n\n\\n\nTraining and development opportunities\n\\n\nOpportunity to progress within the company\n\\n\nCompetitive remuneration package offered\n\\n\nIf eligible, we offer free medical insurance\n\\n\n\\n\nThe successful candidate will be entitled to a company vehicle in accordance with the Company Vehicle Policy since travel is an essential component of this job\n\\n\nIn accordance with the Company's Drug &amp; Alcohol Policy, the successful applicant will be required to undergo a pre-employment drug test and medical.\n\\n\nWe prefer online applications.  Once you click Apply you will be routed to our career website where you will be required to complete an on-line application. This may take a few minutes.\n\\n\nPreference will be given to NZ Citizens or those with a Residency or current Work Visa in place.\n\\n\nApplications close 14 May 2021"}