{"title":"Terminal Operator","salary":"Competitive salary!","dataCreated":"2021-04-14","city":"Wellington","area":"","employer":"PERSOLKELLY","validThrough":"2021-05-14","type":"Full Time","description":"Are you ready for a new challenge?\nFantastic opportunity to join one of the world's leading oil and gas companies.\nJoin our Wellington team, as we are on the hunt for a \nTerminal Operator.\nThe organization is the oldest and most renowned oil company in New Zealand, operating in over 150 locations all over the country.\nYou'll be a key part of the operations team to ensure the terminal runs efficiently, reliably, safely and cost effectively.\n \nYou'll be responsible for:\nPerforming activities related to the receipt and shipping of all products and additives\nPerforming functions relating to site operations, ensuring the reliability of equipment and the supply and delivery system sun smoothly \nOperate, maintain and repair site facilities in a safe, efficient, cost effective and environmentally sound manner\nManaging and coordinating contractors and drivers with respect to safety, orientation and compliance\nActs as main contact/liaison between the Control Centre, the TOU and site operations\nInterfaces directly with the measurement specialist, ISU, and third party personnel for inventory management and measurement\nAssists with mechanical and operational activities \nRecommends upgrades and adjustments to maintenance plans\nFlawless execution of the work permitting process\nAbout the role:\nFull time 40h a week\nBased in Seaview Terminal\nCompetitive hourly rate\nOngoing role-no end date\nGreat career opportunity\nWe're ideally seeking for:\nMinimum 5 years' experience as a Terminal Operator\nHigh-level working knowledge of measurement practices\nGood mechanical aptitude\nDemonstrated leadership skills\nStrong computer skills, including Excel and Word\nSecondary/ High School Diploma or college level degree\nMinimum 100% of assigned Stage 3 Training per GMT Standards\nIn depth knowledge of the applicable rules, regulations and standards for the operation\nVery good interpersonal skills\nExcellent negotiation and communication skills\nAbility to works independently\nValid Driver's License\nThis is an awesome opportunity to join a global team and take the next step in your career! \nIf this sounds like you, don't hesitate to\n APPLY NOW!\nAny queries or further information, please email: \nThania.kristiansen@persolkelly.co.nz\n with a copy of your CV.\nWho are we\nAt PERSOLKELLY, our passion is - and always has been - putting you first.\nWe propel our people forward by supporting their careers in fresh ways, backed by our expertise and capability.\nWe're committed to creating a safe and inclusive environment which values and respects diverse styles, backgrounds, experience and perspectives.\nWe welcome and encourage women, people of Aboriginal and Torres Strait Islander descent and people from diverse backgrounds to apply.\nSo it's over to you. If you would like to join our team, please APPLY now.\nTo learn more about working with PERSOLKELLY, we encourage you to visit our website."}