{"title":"Trainee Line Mechanic / Cable Jointer","salary":"Not Found","dataCreated":"2021-04-18","city":"Otago","area":"Rest of Otago","employer":"Network Electrical Servicing Ltd","validThrough":"2021-05-19","type":"Full Time","description":"NES Central Ltd has been working on a variety of projects providing electrical reticulation solutions in the Queenstown Lakes District and Central Otago region for over 20 years.  \n  \nWe are currently looking for someone who wants to undertake an apprenticeship to become a qualified line mechanic and cable joiner. This role requires someone with a ‘can do’ attitude, who enjoys working outdoors and is not afraid of heights. This is an exciting opportunity that will require approximately 4-years on-the-job training and classroom learning. \n  \nOur work predominantly involves upgrades on the Aurora Energy Limited electricity network and supplies to new subdivisions. We are a small, friendly team based in Cromwell dedicated to working hard and providing the best solutions to our clients. \n  \nThe successful applicant will be a team focused self-starter who is not afraid of hard work.  Working in a small team means you’ll be willing to assist in all areas of the business and enjoy a variety of work covering low-voltage and high-voltage installations.\n  \nThe successful applicant will:\n \nEnjoy working in a team environment\nBe physically fit, active and enjoy working outside \nHave excellent communication skills\nHave a good level of achievement in NCEA Level2\nHold a current clean class 1 drivers’ licence and be prepared to obtain class 2 &amp; 4\nUnderstand the principles of a good Health &amp; Safety culture\n \n  \nCromwell is well positioned in the middle of Central Otago with easy access to many exciting outdoor adventure pursuits. If this sound like you, please apply today by emailing your CV and a Cover Letter to admin@4nes.co.nz.  \n  \nFor more information, phone Greg Millane on 0274 359 741. \n  \nwww.nescentral.co.nz   \n  \n \n  \nLike us on Facebook NES Central Ltd | Facebook"}