{"title":"HSE Performance Data Analyst","salary":"Not Found","dataCreated":"2021-04-14","city":"Auckland","area":"Manukau & East Auckland","employer":"DOWNER NZ","validThrough":"2021-05-15","type":"Full Time","description":"Downer New Zealand has a proud history that can be traced back to 1870, and today we are NZ’s leading provider of integrated services.  Our commitment is building long term relationships and supporting our customers with high calibre services and solutions.  The key to our success is our people who, on a day-to-day basis, they stand and deliver the company's core values of Excellence, Courage, Collaboration &amp; Integrity across a diverse landscape of markets. We are proud of what we do, and that we support the well-being of the communities we work, live and play in.\n\\n\nAbout the role: \n\\n\nWe are experiencing rapid and exciting changes and have more information available at our fingertips than ever before.  Therefore, we need an experienced data and automation professional to help provide structured information, and meaningful, repeatable insights to our business.\n\\n\nThe national HSE support team has many internal customers and stakeholders. Our current state of reporting is in parallel need of back-end modernisation and a front-end refresh. This position provides an exciting opportunity for a data professional to transform HSE data into decision-making information and to see real benefits from your efforts recognised very quickly.\n\\n\nThis HSE Performance Data Analyst position has been established to:\n\\n\n\\n\nSupport the transformation of the current state operational reporting into a modern, staged, lean, and scalable reporting function.\n\\n\nSupport with transformation initiatives with meaningful and repeatable data insights, and well- presented information.\n\\n\nWork alongside internal stakeholders to understand current state, develop appropriate technical solutions, and to elicit reporting requirements from end-users.\n\\n\nContribute to enterprise Data Warehousing initiatives with requirements to ensure data governance principles are adhered to\n\\n\nWork with the Data Warehouse team to ensure data sets are moved into the environment to support real time reporting\n\\n\nProvide quality support and upskilling opportunities to various reporting SME’s in the business\n\\n\n\\n\nAbout you:\n\\n\nKey to the role is being analytically minded, and able to break down complex and unstructured information &amp; problems to identify underlying structures and relationships.  You must also have an appreciation for the value that high quality information and data standards can provide an organisation and the ability to operate in a busy and changing environment, showing sound judgement, a professional approach, all with a can-do attitude while working with independence and self-drive. \n\\n\nThe ideal candidate will have 3+ years’ intermediate experience required in a Data/Reporting Analyst capacity or similar and must have strong proficiency in MS SQL, MS PowerBI, and MS Excel, Azure preferable.  While practical experience with DBA fundamentals such as staging, translation, and design would be an advantage, it is however not essential for this position.  Experience in Sustainability reporting systems (e.g. ENVIZI) preferred but not required.\n\\n\nWhat we offer:\n\\n\nThis is an outstanding opportunity to work in our diverse business. The environment is challenging and rewarding. We offer the opportunity to join our diverse and inclusive culture, and be part of a great team working in a collaborative environment. We offer a competitive remuneration package, flexible working arrangements, and our focus for our people is training and development, so this gives excellent opportunities to enhance your skills and advance your career.  \n\\n\nIf this sounds like the opportunity for you, head to \nwww.downercareers.co.nz\n and enter reference number 580270 to apply. \n    \n\\n\nDowner NZ is an equal opportunity employer committed to creating a diverse and inclusive culture.\n \n\\n\nOur workplaces are drug and alcohol free - all successful applicants will be required to undertake a Pre-Employment drug test and medical.  \n\\n\nDue to the fast-paced nature of Downer, our vacancy close dates may be subject to change, so don't delay and make sure you apply as soon as possible."}