{"title":"Asset Assurance Engineer","salary":"Not Found","dataCreated":"2021-03-26","city":"Auckland","area":"Manukau & East Auckland","employer":"Electra","validThrough":"2021-04-25","type":"Full Time","description":"Varied role with fantastic scope for growth and responsibility\nManage our asset acceptance and public safety management system\nLevin or Paraparaumu based\nJoin a local, growing business in the electricity sector\nWe are Electra Limited, a dynamic, forward-thinking and innovative local business, part of a vibrant community in the Horowhenua and Kapiti regions of New Zealand. We have been servicing our customers and the community for more than 90 years and believe the key to our success is our people, the community support we receive, our product innovation and diversification into new industries. The Electra Group consists of Electra Ltd and Electra Services (trading as Securely). \nElectra is committed to living our values of Safety, Respect, Professional, Accountability and Integrity. We continually strive for excellence in everything that we do.  \nAs the business grows, and the work demands remain high, we’re looking to add to the team with a new Asset Acceptance Engineer into the fold.  This is a pivotal role within our business.\n \nThis role requires a combination of technical and people skills to be successful and requires exceptional stakeholder management skills coupled with technical nous.  This is a varied role, and you must be willing to roll up your sleeves and get your hands dirty one day out in the field, and the next remain office based to manage incredibly important standards.\n \nKey responsibilities include:\n \nOversight of Lines Business controlled documents including the Public Safety Management System, engineering standards, commissioning and asset acceptance.  Working with key stakeholders to ensure they are maintained and developed to manage risks and efficiencies and they are widely understood, adopted and applied by Electra and its contractors.\nConducting audits of assets, works and operations to ensure they fully comply with engineering, quality and legal standards and the PSMS\nReviewing project proposals, ensuring these systems meet or exceed safety, health and quality requirements, including coordination between parties and the suitability of personnel nominated for the work\nContractor accreditation and authorisation that includes collaboration, co-operation and communication with PCBUs i.e. conducting assessments on contracted PCBUs and their employees, audits, safety observations and providing guidance and support to ensure they meet or exceed our requirements.  \nInvestigation of incidents, accidents and failures relating to public safety in order to establish root causes, and incorporating findings into risk registers and procedures\nThis is a senior role, where you will be challenged and looked upon for guidance, your opinion and knowledge, to steer Electra in the right direction.\nYou’ll bring to this role:\n \nA trade qualification or degree in electricity distribution or related technical industry (power systems engineering etc)\nA minimum experience in a similar role of 5 years or more\nExcellent people and interpersonal skills\nExcellent software systems experience and a solid knowledge of MS Excel, at the minimum\nOperation of management systems for safety, quality and risk would be highly desirable\nExperience in delivering innovative improvement opportunities is paramount, we’re always looking for ways to grow\nWhats on offer?\nWe offer a competitive salary, a generous well-being package plus career and professional development, investment in training and your safety, plus a great bunch of people to work with."}