{"title":"Boilermaker - Maintenance Workshop","salary":"Not Found","dataCreated":"2021-04-11","city":"Waikato","area":"Rest of Waikato","employer":"Bt Mining Limited","validThrough":"2021-05-12","type":"Full Time","description":"About Us\n  \nBathurst Resources is New Zealand’s largest specialist coal company. We produce over 2.2 million tonnes of coal each year and proudly employ over 550 people.\n  \nOur Rotowaro mine is located 10km west of Huntly is set to increase production and we are looking for Boilermaker to assist in Maintenance Workshop our operation.\n  \nThe Role\n  \nThe purpose of the Boilermaker is to undertake boilermaker duties for the mobile maintenance workshop on mobile plant, equipment and facilities and is responsible for, light fabrication, general welding and repairs.\n  \nIn addition, completes inspections and routine minor maintenance of the mining fleets buckets, blades, frames and trays.   \n  \nSkills &amp; Requirements\n \nTrade qualified with a Certificate in Engineering Fabrication level 4 or similar industry qualification\nHolds current industry welding ticket/s for metal arc welding (MMA) in all positions\nMIG and TIG welding tickets\nMinimum 5 years post qualification experience in welding, engineering and fabrication work.\nPrevious mining industry experience in a fitter-welder or boilermaker role\nExperience repairing and maintaining mobile plant and equipment.\nFamiliar with non-destructive testing processes and crack identification in machine structures and attachments.\nSafety conscious\nMethodical and precise.\nCompetent with computer technology\nStrong organisation and planning skills\nA high level of energy and motivation with a desire to achieve results\nSomeone who lives or is willing to relocate near Huntly, i.e. Franklin, Hamilton.\nCulture &amp; Benefits\n \nMarket leading pay\nHealth and life insurance\nPermanent position with job security\nAn uncompromised commitment to H&amp;S and Zero Harm\nAbility and support to progress within the business\nHow to apply\n  \nTo apply for this role, please click the \n‘APPLY’\n button now.\n  \nPlease note successful candidates will be subject to preemployment drug and alcohol testing and a preemployment medical.\nApplicants for this position should have NZ residency or a valid NZ work visa."}