{"title":"Asset Recorder/ Cable Location Cadet","salary":"Not Found","dataCreated":"2021-04-19","city":"Hawkes Bay","area":"Hastings","employer":"Unison Networks Limited","validThrough":"2021-05-20","type":"Full Time","description":"At Unison, we have a vision to deliver world-class network and energy solutions to our customers. To achieve that, we need a team of people passionate about delivering excellence through innovation, coupled with superior customer service. We also believe that teamwork and integrity, together with a focus on the safety and wellbeing of our employees and communities will help us achieve our vision.\nWe are currently looking for a self motivated individual to join our busy Hastings team in the role of Asset Recorder/ Cable Location Cadet.\nThe successful applicant will be required to undertake appropriate training and education, as well as learn on the job under the direct supervision of a qualified and experienced professional.\nKey Responsibilities include:\n \nOperating Ground Penetrating Radar (GPR) equipment\nProviding cable locating services for internal and external stakeholders\nUndertaking site visits to locate, record and GPS new and existing assets\nProvide accurate information to other utilities to assist with design requirements\nProvide assistance in the maintenance of accurate records and plans\nKey skills and experience include:\n \nWhile a current practicing license (Electrician or Electrical Fitter) would be an advantage, competence in maths and report writing is a must.\nCurrent drivers license\nExcellent communication and customer service skills\nExceptional administration, as build skills and attention to detail\nStringent time management\nSound understanding of systems and hardware/software\nThis role offers a fantastic opportunity for the right individual to gain training and develop a career in an exciting and progressive industry.\nIf you tick all of the above boxes then we would love to hear from you.\nUnison is proud to be an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We also understand that great performance comes from great people. As a valued team member, you will receive ongoing training and development as well as a host of benefits including great remuneration, health insurance, and subsidies to enjoy an active and healthy lifestyle.\nApplications Close 4 May 2021"}