{"title":"Junior Systems Engineer","salary":"Not Found","dataCreated":"2021-03-25","city":"Taranaki","area":"New Plymouth","employer":"Todd Energy","validThrough":"2021-04-25","type":"Full Time","description":"We are looking for a Junior Systems Engineer with a high level of initiative to join our Digital Operations team. If you are motivated by working in a fast paced, dynamic environment, then we want to hear from you!\nYou\n You will have demonstrated experience in a broad range of on-premise and cloud systems, as well as the development and implementation of digital projects. You are a competent communicator who works well under pressure and has a keen interest in cybersecurity. You like the idea of working in a fast paced and productive team where you can work with experienced colleagues and use your high level of initiative to provide solutions and enhance your work.\n \nUs\n Todd Energy is a subsidiary of the Todd Corporation, a New Zealand owned organisation with diverse interests and a strong reputation nationally. We are a leading energy company operating natural gas fields in Taranaki. With our joint ventures, Todd is a major New Zealand gas producer responsible for generating 50% of the country‘s hydrocarbon energy production. You can learn more about us at: www.toddenergy.co.nz\nOur Location\n Our McKee Mangahewa and Kapuni Production Stations, along with our Kapuni Gas Treatment Plant are a short drive out of the city from our head office based in New Plymouth. This role will be based at our New Plymouth office, with travel to sites when required.\nThe Role\n This role involves collaborating with the Todd Energy Digital Team and Group IT staff, and support partners where appropriate, to ensure smooth and reliable operation of systems that support business objectives and process. This role is responsible for ensuring stability, integrity, and efficient operation of on-premise information systems that support the business and will hold a cybersecurity focus, ensuring the companies IT infrastructure including Desktop, Cloud, Server, Network and Applications are secure. Alongside configuring networks and digital solutions, this role is accountable for monitoring network performance and troubleshooting problem areas as needed.\n Suitable applicants must have:\n  \n \nPreferably Tertiary Qualified in computer science or Information Systems.\nCertifications in appropriate areas e.g. Microsoft, Cisco, Amazon, SANS etc.\n5 years work experience at least 2 of which is in complex technology environments.\nKnowledge of cybersecurity principles and operational cybersecurity.\nProven experience with networks design and implementation.\nExperience and knowledge of cloud, predominantly Microsoft Azure and Software as a Service (SaaS).\nProven experience with systems planning and general software management best practices.\nProven experience with general network management best practices.\nGood technical knowledge of current software protocols, and Internet standards, including extensive experience with core systems, including Microsoft Windows Server, Microsoft SQL Server, Microsoft Exchange and VMWare.\nHands-on hardware troubleshooting experience.\nAbility to conduct research into Systems, Desktop, Network and Cybersecurity issues and products as required.\nGood problem solving ability.\nAbility to analyse qualitative data.\nDemonstrates a strong customer orientation.\nDemonstrates cross-functional expertise and the ability to thrive in a highly complex environment.\nAbility to collaborate and work across teams to find optimal solutions.\n \nTo Apply\n Please visit Seek or online at: https://www.toddenergy.co.nz/ \n Applications close Sunday 11 April 2021"}