{"title":"HEAVY DUTY DIESEL MECHANIC | RAPID RESPONSE","salary":"$60 - $84.99 per hour + super on ALL hours","dataCreated":"2021-03-23","city":"Auckland","area":"Auckland Central","employer":"Rapid Response","validThrough":"2021-04-22","type":"Full Time","description":"***$5,000 start bonus for all Plant Mechanics who join our Rapid Response Team is now extended to include March***\nMader Rapid Response Team provides the very best Heavy Duty Diesel Mechanics across Australia to maintain our mining client's heavy equipment, year round. These roles are exclusive to those who come recommended, headhunted or selected via a stringent recruitment process.\nIt's made up of ONLY THE BEST and in exchange for the highest salary in the industry,\nYou must meet the following criteria:\nCert III in Automotive Mechanical Technology (Mobile Plant / Diesel Fitting / Plant Mechanic / Diesel Mechanic) or equivalent Australian recognised Trade Certificate\n5+ years post trade conducting breakdowns across a variety of heavy equipment including dump trucks, ancillary, excavators and drills. (CAT / Komatsu / Hitachi / Liebherr / Atlas Copco / Sandvik)\nCurrent Inductions at Rio Tinto, BHP, FMG, Roy Hill advantageous\nAbility to pass Medical and Drug Screen\nValid Manual Drivers Licence\n***WE'RE HERE TO HELP YOU THROUGH COVID LOCKDOWNS - ISOLATION ASSISTANCE PROVIDED***\nMADER QUICK FACTS\nFind our highly skilled trades personnel across every state in Australia with head offices in Perth and Brisbane\nMader have seen exceptional growth overseas including in their U.S., Canada and Hong Kong offices; with 10 HD Fitters deploying to the U.S. in March 2021.\nMader have recently locked in another 15 LV Mechanics to complete their trade upgrades in 2021.\n5 x lucky experienced plant mechanics have gained their equivalent Australian trade in the month of November alone.\nMader in Western Australia alone have 9 divisions - Rostered Maintenance, Field Service, Rapid Response, Metro, International,\nDrills Support, Shutdowns, HME Electrical, Goldfields and Ancillary\nEmploy over 1,400 personnel across the World yet never lose focus on every individual's welfare. The company structure ensures every member of the team has a close relationship with their coordinators and managers.\nSponsorships, bonuses, employee discounts, salary sacrifice, relocation assistance, frequent safety meetings, Mader Days, referral scheme, insurance, monthly social events and so much more.\nTo have a confidential conversation regarding the role please call Alia on 0438 127 622 [link removed] or email alia.qambari@madergroup.com.au [link removed]\n \nAPPLY TODAY!"}