{"title":"Fixed Plant Operator","salary":"Not Found","dataCreated":"2021-03-22","city":"West Coast","area":"Rest of West Coast","employer":"Bt Mining Limited","validThrough":"2021-04-22","type":"Full Time","description":"Bathurst Resources Ltd currently operates Stockton Opencast Mine which is located close to the coast on a plateau in the Buller coalfield, 35 km north of Westport. This is one of New Zealand's largest mines with a long history of coal production and produces high value coal for export to the world's leading steel makers.\nSituated in the heart of the Buller region our employees enjoy a balance of work and leisure with local pursuits including a variety of water sports, mountain-biking, tramping, fishing, community activities and much more\n. \nTo strengthen our Fixed Plant Team we are filling the position of:\nFixed Plant Operator\nStockton/Ngakawau\nWe are looking for a Fixed Plant Operator, with a proactive approach to site maintenance and plant operations. He/she will be an important member of our team responsible for operating and maintaining of all Fixed Plant including an aerial ropeway and modern Coal Handling Processing Plant.\nCurrent roster pattern is Monday to Friday, 45 hours per week, fixed or rotating Day/Night shift.  Ideally you will have a good knowledge of plant operations and maintenance.\nWe are keen to hear from you if you have;\n \nSecondary education\nMedium to high level of fitness\nPreferably a Maintenance Background\nBasic level of understanding of computers\nAbility to work well as part of a team\nGood communication skills\nWe are in an ideal position to support and develop careers for those looking to work in an exciting part of New Zealand's natural resources sector. In return we offer you an overriding commitment to safety and zero harm, a supportive work environment, a residential lifestyle (5/2) and a competitive remuneration package.\nPlease note that due to Covid19 border restrictions, we are only able to consider candidates either currently residing in New Zealand with full work eligibility or a NZ citizen or resident returning home.  If you are a NZ citizen or resident returning home, please be sure to include an explanatory note with your travel plans and timelines for being back in the country. \nApplications close: 6th April 2021\nPlease note successful candidates will be subject to pre-employment drug and alcohol testing and a pre-employment medical.\nYou must also have the right to legally live and work in New Zealand to be considered for this position."}