{"title":"Transmission Line Mechanic","salary":"Not Found","dataCreated":"2021-04-05","city":"Bay of Plenty","area":"Rotorua","employer":"Northpower Ltd","validThrough":"2021-05-06","type":"Full Time","description":"Looking for your next role with a proven company and a great team?\nWe’re looking for an experienced Transmission Line Mechanic to join our Rotorua team.\nAbout us\nNorthpower is an electricity and fibre network provider for Whangarei and Kaipara, with more than 60,000 connected customers. We also provide contracting services to our partners – other network owners and operators across the North Island.\nWe have over 1,300 staff working together across 13 locations to keep the power on and the lights going for our customers.\nThe role\nAs a Transmission Line Mechanic with Northpower, your safety and that of others around you is your number one priority. This role will see you playing a key part in the construction and maintenance of transmission lines to customer requirements. You’ll also assist with work plans and ensure that relevant field paperwork is completed as necessary.\nWhat we’re offering\nAn interesting role within a great team\nThe chance to work with a company who puts our people at the heart of the organisation and is committed to safety\nA company who puts our people at the heart of the organisation and is committed to safety leadership at all levels\nCompetitive remuneration, an in-house wellbeing programme and initiatives including group discounted medical insurance\nWho we’re looking for\nWe’re looking for an experienced Transmission Line Mechanic with up to date registration and competencies, who has at least a Class 2 drivers license.\nYou will need to demonstrate the following:\nProven experience in Transmission work environments\nGreat verbal and written communication skills\nA strong commitment to health and safety\nA great attitude and a willingness to be part of a team\nGet in touch!\nWe’d love to hear from team players who fit the above and have a great ‘can do’ attitude.\nDue to current border restrictions, unfortunately applications from international candidates or those without the right to work in New Zealand cannot be considered. \nNorthpower has an in-house recruitment team who manage recruitment for all our vacancies.  If you're interested in a role with us we would encourage you to apply directly online to us, as we don't accept candidates via agency (unless the role is advertised by the agency at our request)."}