{"title":"Tunnel Boring Machine (TBM) Crew (- City Rail Link)","salary":"Hourly Rate per Role + Allowances","dataCreated":"2021-04-08","city":"Auckland","area":"Auckland Central","employer":"Link Alliance - City Rail Link","validThrough":"2021-05-08","type":"Contract/Temp","description":"About the project\nThe City Rail Link (CRL) is a game-changer for Auckland. It’s NZ’s largest government funded transport infrastructure project ever and we are committed to boosting economic activity by providing jobs to Aucklanders in the wake of the COVID-19 pandemic.\nThe CRL is a 3.45km twin tunnel, transforming the dead-end station at Britomart, creating two new stations at Aotea and Karangahape Road and reconnecting to the network at a redeveloped Mt Eden station.\nOur Herrenknecht TBM is currently being assembled on our Mount Eden worksite and we are actively recruiting roles to commence between February to June 2021.\nWe have opportunities for specialist TBM positions on our Auckland CBD sites, as well as surface and logistics crews. If you have experience working with TBM's we want to hear from you.\nWe are seeking the below positions (but not limited to):\n \nTBM Shift Leaders\nTBM Foreman\nLifting Supervisor\nErector Operators\nRing Builders\nSegment Crane Operator\nGroutman\nBackup Miners\nMSV Driver\nSlinger Signaller/Dogman\nTBM Mechanics, Fitters/Welders &amp; Electricians\nTBM Labourer (Surface Crew)\nTelehandler Operator (Surface Crew)\nTower Crane Driver (Surface Crew)\n \nAbout you: \n \nSome positions will require experience working on TBM construction projects and advantageous if you have worked with EPB or Slurry TBM's\nExperience working with 2 component grouting is beneficial for any grout related position\nPhysically fit and able to work in shift and underground if required for your role\nHealth, Safety, Environmental &amp; Sustainability knowledge and focused\n Apply for this role to ensure your details can be shared with the construction management team who are hiring these positions.\nAll roles require a pre-employment Medical and Drug &amp; Alcohol test.\nPlease note, you may not hear back from us straight away as we are recruiting lots of roles over the next couple of months, however your details will be retained. You are also welcome to apply for other roles as they are advertised.\n*We have an in-house recruitment team that manage all our vacancies. Candidates presented through our registered agencies will also be considered for a selected number of roles advertised."}