{"title":"Network Controller (Marlborough based)","salary":"Not Found","dataCreated":"2021-04-06","city":"Otago","area":"","employer":"Talent Network","validThrough":"2021-05-06","type":"Full Time","description":"About us:\nLocated in Blenheim, we employ a team of over 140 diverse and committed staff. We are a “community-owned” electricity distribution business, being owned by the community elected Marlborough Electric Power Trust. We naturally have a strong connection with the Marlborough community and take pride in supplying a safe and reliable network for our consumers. \nWith a new CEO onboard, Marlborough Lines is entering an exciting period of change, including the goal of being a leader in the industry and an employer of choice.\nAbout the role:\nAs an experienced controller, you will understand exactly what we mean when we say no two days ever pose the same challenge! \nWith a focus on the safe and effective performance of our network, you will be an active member of our dedicated network operations team. Monitoring our network’s power and operational status, responding to faults or outages and assisting our customers in resolving issues in a timely and safe manner.  Working in a small and dedicated team gives you the natural opportunity to share your industry knowledge and experience and contribute to operational improvements and evolution. \nMarlborough also offers a great lifestyle option for you and your family with the outdoors at your fingertips and a safe and welcoming community. We have transitional housing support for you while you find the perfect home.\nAbout you - to be successful as a long-term member of our team you will:\n \nBe an experienced network controller with over 3+ years’ work experience within network operations and strong demonstrated knowledge in electrical distribution and electricity supply.\nHave a high level of experience and skills within ADMS / real-time systems.\nBe naturally analytical and have the ability to make informed decisions and resolve complex technical issues.\nHave a high level of interpersonal skills with a collaborative, inclusive and forward-thinking nature. \nHave a long-term focus on a career move and be seeking a network where you can grow and contribute. \nIf this sounds like you:\nIf you’re ready to make a move and join our organisation we would love to hear from you. \nPlease submit your resume and apply now - we will provide a full job description for all shortlisted candidates. \nTo have a confidential discussion around your background or for more detail, feel free to contact:\nSophie Te Huia- Recruitment Partner on: 027 333 3580."}