{"title":"Technical Works Programmer (Reticulation Support)","salary":"Not Found","dataCreated":"2021-04-12","city":"Canterbury","area":"Christchurch","employer":"Orion NZ Ltd","validThrough":"2021-05-12","type":"Full Time","description":"The Role\n  \nThis role supports the design, programme and scope of works from the overhead and underground reticulation projects and maintenance budgets for central Canterbury’s electricity network. This role will be a key interface during delivery of works, providing advice and monitoring completion of works against the scope, timeframe and budget.\n  \n \n  \nThe Candidate\n  \nTo be successful in this role you will be a natural communicator with a customer centric approach. You will be solutions focused and able to work alongside several different stakeholders to achieve outcomes. You will also identify with the Orion Groups strategic direction and be able to contribute positively to the way we work.\n  \nYou will also have:\n \nAt least 5 years’ experience with the construction and maintenance of overhead and underground power distribution systems\nExperience in the Electricity Distribution industry and extensive knowledge of and experience in applying the Supply Regulations\nKnowledge of the Resource Management Act\nLevel 6 NZ Diploma in Engineering or equivalent knowledge gained through practical experience is preferred\n \n  \nAbout Orion\n  \nOrion plays a vital role in supplying electricity to our communities in Canterbury. We seek diversity of thought and encourage an inclusive and flexible working environment.  This, together with our adaptable approach positions us well for the future. We are committed to the health, safety and wellbeing of our people and we seek to engage, build strong relationships and work together to create the best outcomes. With a strong commitment to our community, we continually strive towards a sustainable future that can be shared by all.\n  \nTo apply please click 'apply for this job' or visit www.oriongroup.co.nz and submit a cover letter along with your resume.\n  \nFor further information please contact Jade on 03 363 9815\n  \nClosing date: 2 May 2021"}