{"title":"STMS (SIte Traffic Management Supervisor) Coordinator","salary":"Not Found","dataCreated":"2021-03-26","city":"Bay of Plenty","area":"Rotorua","employer":"Unison Networks Limited","validThrough":"2021-04-25","type":"Full Time","description":"Unison Contracting Services is the contracting arm of Unison, one of New Zealand's largest electricity distribution businesses. Across Hawkes Bay, Taupo, Rotorua and Dunedin, we have a staff of qualified professionals who are skilled in the following areas:\n \ncable location\npower line audits, and power line upgrades\ntree trimming and removal\nfibre optic installation\ndirectional drilling\ntrenching\ntraffic management\ndirectional drilling\ntrenching\ntraffic management\nWe are looking for an experienced Site Traffic Management Supervisor (STMS) Coordinator. The purpose of this role is to provide high level competent STMS coordination, liaison and practical STMS duties to provide advanced traffic management services and support to Unison Contracting Services Limited\nKey Responsibilities:\nUndertake the full coordination and management of UCSL STMS responsibilities including the following duties;\n \nCoordination, planning and organisation of daily traffic management requirements: \nAssign and explain STMS site specific plan rationale to STMS staff and their expected duties in relation to the plan\nAssign other UCSL staff or subcontractors and equipment to undertake traffic management duties\n \nReview service requests: \nReactive call-outs\nUrgent and justified call-outs for the day and allocate resource\nPlanned service requests for projects\nUpdate Site Traffic Management Supervisor (STMS) calendar as required\n \nOn site traffic management duties:\nSet up traffic management as per approved plans\nModify on site set ups where required\nPrepare documentation which will include: \nCarrying out site visits before and during worksite operations and undertake modifications to plans to minimise risk as necessary\nPrepare Temporary Traffic Management Plans to submit to Road Controlling Authorities (RCA’s)\nPrepare and submit Corridor Access Requests (CAR’s) to RCA’s\nLiaise with person/s making the request/s\nLiaise with RCA’s for discussion and agreement of processes\n \nAuditing and monitoring: \nSite visits to check compliance and discuss issues with site personnel to enable understanding and buy in of STMS rationale as part of overall safety procedures\nThe ability to assert and implement the traffic management plan when they are not being adhered to\nMonitoring of all sites, attended and unattended\n \nManagement of Equipment: \nEnsure that equipment is clean and maintained for daily use\nOrdering of new equipment as required\nManagement of STMS equipment inventory on each vehicle\nUtilise trucks and trailer for daily use and call-outs\n \nPreparation of documentation for ongoing work: \nProject works\nCall-outs\n \nUndertake staff training: \nCoach staff on traffic management requirements\nCoach and mentor STMS &amp; TC staff\n \nWe welcome applications from those who have the immediate right to work in NZ. If you are interested, please apply online.\nUnison is proud to be an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We also understand that great performance comes from great people. As a valued team member, you will receive ongoing training and development as well as a host of benefits including great remuneration, health insurance, and subsidies to enjoy an active and healthy lifestyle."}