{"title":"Cable Jointer","salary":"Not Found","dataCreated":"2021-04-05","city":"Auckland","area":"Manukau & East Auckland","employer":"Northpower Ltd","validThrough":"2021-05-06","type":"Full Time","description":"Are you an experienced Cable Jointer or Electrician looking for a new challenge?\nKeen on a role with a proven company and a great team?\nWe have an amazing opportunity for you!\n​\nAbout us\nNorthpower is an electricity and fibre network provider for Whangarei and Kaipara, with more than 60,000 connected customers. We also provide contracting services to our partners – other network owners and operators across the North Island.\nWe have over 1,000 staff working together across 13 locations to keep the power on and the lights going for our customers.\nThe role\nAs a Cable Jointer with Northpower, this will see you working in a varied role where you will be undertaking cable location, fault location, testing of new and repaired cables and high voltage switching. Assist cable faults team and providing system information and cable locations as required.  You’ll be part of an on call roster carrying out standover duties.\nWhat we’re offering\nAn opportunity to gain new skills within the electricity distribution industry\nAn interesting role within a great team\nThe chance to work with a company who puts our people at the heart of the organisation and is committed to safety\nCompetitive remuneration, an in-house wellbeing programme and initiatives including group discounted medical insurance\nWho we’re looking for\nTo be considered for this role you’ll need to be an experienced Cable Jointer with EWRB registration and a current practising licence, along with a current drivers licence (Class 1).\nYou will need to demonstrate the following:\nExperience with Jointing XLPE / PILC and STA cables up to and including 33kV\nSound technical knowledge of cables and local network systems, procedures and standards\nGreat verbal and written communication skills, with basic technology knowledge\nA strong commitment to health and safety\nA great attitude and a willingness to be part of a team\nExperience with cable testing and/or switching at high voltage (desirable but not essential)\nExperience with Vector and/or Transpower networks (desirable but not essential)\nGet in touch!\nWe’d love to hear from team players who fit the above criteria and have a great ‘can do’ attitude\nDue to current border restrictions, unfortunately applications from international candidates or those without the right to work in New Zealand cannot be considered. \nNorthpower has an in-house recruitment team who manage recruitment for all our vacancies.  If you're interested in a role with us we would encourage you to apply directly online to us, as we don't accept candidates via agency (unless the role is advertised by the agency at our request)."}