{"title":"Power Technician","salary":"Not Found","dataCreated":"2021-03-30","city":"Bay of Plenty","area":"Tauranga","employer":"DOWNER NZ","validThrough":"2021-04-30","type":"Full Time","description":"Downer New Zealand is a leading provider of integrated services.  Our commitment to building long term relationships and supporting our customers with high calibre services and solutions; the talents of our people; and consistent excellence in operational delivery sets us apart. \n\\n\nDowner Power and Gas is a leading provider of end-to-end services, providing design, construction &amp; maintenance solutions for Power &amp; Gas distribution network owners.  Experiencing business success with strong project pipelines, we have a need for a number of great people to join our team.  Committed to meeting the highest regulatory standards we are aligned with some of NZ’s largest networks, covering up to 30,000kms.\n\\n\nThe Role:\n\\n\nOur Tauranga depot is looking a new Power Technician to join their high performing team.  Responsible for \nHV power, control systems, protection and substation equipment\n throughout the Taranaki region, you’ll also be involved with:\n\\n\n\\n\nInstalling and testing\n\\n\nMaintenance and commissioning\n\\n\nFault diagnosis\n\\n\nSCADA and Communications\n\\n\n\\n\nAbout You:\n\\n\nIdeally, you will be a skilled Power Technician with HV, substation or power transmission experience.  To really impress us, you will also have knowledge of SCADA Communications, however we will support further training to develop your career.  It is essential that you offer:\n\\n\n\\n\nEWRB Registration\n\\n\nCurrent Practicing licence\n\\n\nPower Technician Level 5 qualification, NZCE or equivalent\n\\n\nFull class 1 driver’s licence, and the ability to drive a manual vehicle\n\\n\nFault diagnosis\n\\n\nAdept at interpreting designs\n\\n\n\\n\nYour analytical nature will ensure that your work is of the highest quality with a key focus on safety.\n\\n\nWhat we offer:\n \n\\n\nA role with us can advance your career and expand your skills. We offer you the opportunity to join our diverse and inclusive culture, and be part of a great team, working in a collaborative environment. We provide comprehensive training to meet the stringent criteria of our industry, a competitive remuneration package reflective of your skills and experience, and all the tools of trade you need to do your job. \n\\n\nIf this sounds like the opportunity for you, head to \nwww.downercareers.co.nz\n and enter reference number 579733 to apply. \n    \n\\n\nDowner NZ is an equal opportunity employer committed to creating a diverse and inclusive culture.\n \n\\n\nOur workplaces are drug and alcohol free - all successful applicants will be required to undertake a Pre-Employment drug test and medical.  \n\\n\nDue to the fast-paced nature of Downer, our vacancy close dates may be subject to change, so don't delay and make sure you apply as soon as possible."}