{"title":"Trainee System Controller","salary":"Not Found","dataCreated":"2021-04-08","city":"Southland","area":"Invercargill","employer":"PowerNet","validThrough":"2021-05-08","type":"Full Time","description":"Trainee System Controller\nAt PowerNet, our people are committed to providing safe, efficient and reliable supply of electricity to businesses and communities across the lower South Island. We are an industry leader and as such, our progression and innovation is at the forefront of our business where we are committed to learning more about emerging technologies and the impact this will have on our customers, communities and network.\nWe have an outstanding opportunity to join the PowerNet team in the exciting and rewarding role of Trainee System Controller based out of our Invercargill Office in Racecourse Road.\nAs a Trainee System Controller you will play a critical role here at PowerNet and will be responsible for ensuring the network is effectively and reliably operated to ensure our employee’s, contractors and public safety is maintained at all times. Our System Control room is manned 24/7 so you will participate in a rotating shift roster.\nExperience/Knowledge and Skills:\nAbility to study towards the NZ Certificate or Diploma in Electricity Supply Network Operator\nAbility to understand and operate SCADA systems, permit management and ensuring quality of supply\nGood communication skills with strong English written and oral ability\nAnalytical and methodical\nBe able to work under pressure and stay calm\nAccurate recording of operating data\nBe adaptable to a changing environment where no two days are the same\nWork experience in the Electricity Distribution Industry would be desirable but not a prerequisite\nOur Candidate:\nIdeally you have control room experience within the electricity industry here in New Zealand, however if you have control room experience from an industry/mining sector background, we would love to hear from you.\nThe successful candidates will be highly motivated individuals who have a pragmatic, flexible and adaptable approach. They will be a unified team member who has a high attention to detail with solid communication skills. You will be someone who is up front and honest and really wants to make a difference within a company who encourages growth and development and a can do attitude of \\"}