{"title":"Trainee Line Mechanics- Kickstart your career!","salary":"Not Found","dataCreated":"2021-04-13","city":"Otago","area":"","employer":"Delta","validThrough":"2021-05-13","type":"Full Time","description":"Earn while you learn and gain a recognized qualification\nKick-start your career in the electricity supply and distribution industry\nJoin a fun working environment within a dedicated team\n Delta is your smart thinking infrastructure specialist. We construct, manage and maintain essential energy and environmental infrastructure. Every day we make a difference in the lives of New Zealanders. We make communities better for people to live, work and play in - keeping the lights on, the trees trimmed and the parks green. \n We have an exciting opportunity for two Trainee Line Mechanic in Wanaka and Queenstown for someone interested in pursuing a career within the Electrical Distribution industry. If you have a great attitude, a love of the outdoors (and heights), and are keen to learn the skills required to construct and maintain our energy network, then our Trainee Line Mechanic role is for you.\n As a Line Mechanic Apprentice, you will embark on a career path in an industry that provides certainty and security. You will be provided with the opportunity for personal and professional growth in an organization that recognizes and rewards individuals with the talent to become more.\n Trainees will undertake a training programme that involves a mixture of on-the-job training and theoretical ‘block’ courses for approximately 3 years in duration. You will work your way to becoming registered with the EWRB. Your role will involve installing, repairing and maintaining overhead power lines, essentially keeping the power on for our community. \n The selection process will be thorough as Delta needs enthusiastic trainees who want to develop their skills and are prepared to learn. lf you place teamwork, safety and providing a service at the top of your list of values then joining Delta as an apprentice is the right choice.\nAbout you:\n \nYou will enjoy working in the outdoors and be physically fit;\nYou will have a sound academic record with good achievement in NCEA Level 2/ equivalent\nYou’re highly motivated and keen to learn, with the ability to set and achieve goals;\nYou have excellent communication skills;\nYou have great attention to detail and problem solving skills;\nYou hold a current and clean class 1 Driver’s License;\nIf you’ve completed a pre-trade course or have relevant experience it may be an advantage \n \nWhat’s on offer:\n \nA role where you can be challenged and supported\nExtra contribution to Kiwisaver after your first year\nCommitment to safety, to make sure everyone gets home- every day\nRecognition for excellence and demonstrating Delta’s values\nWellness programmes, team activities, and social clubs\nProfessional development, training, and courses\nCorporate Social Responsibility programmes and initiatives\nA competitive remuneration package with all gear and equipment provided\nJoining a progressive and reputable South Island organization\n If this sounds like you, you have a positive attitude and want to be part of a great team, we want to hear from you. \nApply now!\nApplications close: 12 May 2021\nDelta is an equal opportunities employer, providing competitive remuneration and structured support for your career development. To apply, and to find more information on Delta please visit www.thinkdelta.co.nz or email us at careers@thinkdelta.co.nz\nSome things you need to know:\n \nWe will only consider applications from people currently residing in NZ and who hold a valid work visa.\nWhile we make every effort to respond to all applications, sometimes the volume we receive is so large it is not possible. Only shortlisted candidates will be contacted directly for this position; unsuccessful candidates will be notified via email"}