{"title":"SHE Manager - Hamilton","salary":"Not Found","dataCreated":"2021-03-29","city":"Auckland","area":"","employer":"Ecolab Pty Ltd","validThrough":"2021-04-29","type":"Full Time","description":"About ECOLAB:\nEcolab is the global leader in water, hygiene and energy technologies and services. Every day, we help make the world cleaner, safer and healthier – protecting people and vital resources.  A trusted partner at nearly three million customer locations, Ecolab is the global leader in water, hygiene and energy technologies and services that protect people and vital resources. Around the world, customers in foodservice, food processing, hospitality, healthcare, industrial, and oil and gas markets choose Ecolab products and services to keep their environment clean and safe, operate efficiently and achieve sustainability goals\nAbout the role:\nThis is a fantastic opportunity for an experienced Safety Health &amp; Environment (SHE) Manager to join our amazingly dedicated team on our journey to world class at our Hamilton facility.  Reporting directly to the NZ Supply Chain Manager, you will be responsible for ensuring that our plant and facilities are safe and compliant.\nYour responsibilities:\n•    Championing the Safety, Health and Environment agenda in a fast paced, progressive TPM environment\n•    Being a member of the Site Leadership Team and working alongside your operational colleagues to safely drive change \n•    Lifting our capability in personal safety and process safety through the development and execution of relevant initiatives and training programmes \n•    Working actively with external authorities to ensure all legal and regulatory requirements are being met\n•    Being the SHE advocate for Ecolab New Zealand including active participation with your peers across the Ecolab International Market division \nTechnically, you will have:\n•    Bachelor of Science (Chemistry) or equivalent\n•    Chemical manufacturing site experience ideally\n•    Minimum 5 years working as a Health and Safety professional or minimum 5 years in a senior operational role where you are able to demonstrate strong Health and Safety leadership\n•    Comfortable working on a high-risk site with varied activity\n•    Experience in developing and maintaining management systems frameworks\nBy nature, you will demonstrate:\n•    Ability to adapt communication and negotiation skills to suit a variety of audiences and stakeholders\n•    Proficient computer skills and ability to use MS Office programs\n•    Can write clearly and succinctly in a variety of communication settings and styles\nLife at ECOLAB:\nOur three behavioural shifts are People First, One United ANZ Ecolab Team and Owning the Outcome.  \nWe believe the best teams are diverse and inclusive, there is a world of opportunity that can be found within our growing company, and delivering results and demonstrating teamwork, drives advancement.\nSome of the benefits you can enjoy:\n•    Flexible working arrangements\n•    Rewarding company superannuation\n•    Health and Well-being Subsidy of $250 per year\n•    MY Days bonus leave program, giving employees an extra 5 days off per year!\n•    Rewarding bonus and incentive programs\n•    Attractive staff product discounts\n•    Access to the Ecolab holiday house in Lake Taupo NZ\n•    Employee stock purchase plan\nHow to apply:\nClick APPLY to submit your application.\nThe preferred applicant will be subject to employment screening by Ecolab or by their external third-party provider.\nGet social with us:\nEcolab is the global leader in water, hygiene and energy technologies and services. Every day, we help make the world cleaner, safer and healthier – protecting people and vital resources. If you would like to find out more about us, please find out more at https://en-au.ecolab.com/\nEcolab is an Equal Opportunity Employer, supporting a diverse work environment to drive innovation and growth."}