{"title":"Water Serviceperson","salary":"Not Found","dataCreated":"2021-03-23","city":"Manawatu","area":"Rest of Manawatu","employer":"DOWNER NZ","validThrough":"2021-04-23","type":"Full Time","description":"Downer New Zealand is a leading provider of integrated services.  Our commitment to building long term relationships and supporting our customers with high calibre services and solutions; the talents of our people; and consistent excellence in operational delivery sets us apart.\n\\n\nDowner maintains longstanding contracts and significant operational expertise to over a quarter of New Zealanders. We are proud to be working together with the Horowhenua District Council on the 3 Waters Alliance contract which manages the reticulation network, water and wastewater treatment plants, the annual 3 waters renewals programme and the capital projects for the Horowhenua region.\n\\n\nA bit about your role;\n\\n\nWe have opportunities for Water Servicepersons to join our team, supporting our Alliance contract in Horowhenua. The positions are available for either experienced water service people or candidates with a good understanding of the water industry, are keen to work, and enjoy using your practical skills ideally with relevant engineering, mechanical, or trade qualifications and/or experience.\n\\n\nA bit about you;\n\\n\nYou will have previous experience with the Water Industry and will bring with you;\n\\n\n\\n\nA full driver's licence and class 2 HT licence preferred\n\\n\nMinimum 2 years of civil construction, labouring, preferably involved in water, wastewater and stormwater would be an advantage\n\\n\nProven experience and an interest in Water Reticulation\n\\n\nExperience working with Water Mains and Service lines\n\\n\nTraffic management skills TC and or STMS trained would be an advantage\n\\n\nCurrent confined space entry trained would be an advantage\n\\n\nStrong focus on Health and Safety\n\\n\n\\n\nIf this sounds like the opportunity for you, head to www.downercareers.co.nz and enter reference number 573206 to apply.     \n\\n\nA role with the Downer Water Team can advance your career and expand your skills. We offer you the opportunity to join our diverse and inclusive culture, and be part of a great team, working in a collaborative environment. We provide comprehensive training to meet the stringent criteria of our industry, a competitive remuneration package reflective of your skills and experience, and all the tools of trade you need to do your job.\n\\n\nDowner NZ is an equal opportunity employer committed to creating a diverse and inclusive culture\n\\n\nOur workplaces are drug and alcohol free - all successful applicants will be required to undertake a pre-employment drug test and medical."}