{"title":"Field Services Team Leader","salary":"Not Found","dataCreated":"2021-03-26","city":"Bay of Plenty","area":"Rotorua","employer":"Unison Networks Limited","validThrough":"2021-04-25","type":"Full Time","description":"At Unison, we have a vision to deliver world-class network and energy solutions to our customers. To achieve that, we need a team of people passionate about delivering excellence through innovation, coupled with superior customer service. We also believe that teamwork and integrity, together with a focus on the safety and wellbeing of our employees and communities will help us achieve our vision.\nAn exciting opportunity has become available for a Field Services Team Leader to join the Rotorua team at Unison Contracting Services. The Field Services Team Leader is responsible for the overall performance and leadership of Lines Field Leaders, to ensure allocated works are completed in a safe and efficient (time, cost and quality) manner.  There is also a strong focus on Health and Safety.\n \nLeadership Responsibility\n \nLead designated staff to provide a safe and efficient service for all field work in accordance with Unison requirements.\nWork closely with the Service Delivery Team to ensure work is scheduled, planned and allocated to your designated staff.\nActively ensure that best practice HSE practices (regulatory, industry and company) are being adhered to.\nEnsure the performance (safety, efficiency and people development) of Lines Field Leaders is measured and developed,\nAssist with and ensure the delivery of performance plans for relevant Field staff\nAddress performance issues within the team\nScheduling and Coordination\n \nReview and monitor internal processes to ensure continuous improvement.\nMonitor and report on project progress against the schedule of works.\nEnsure worksite observations/audits are completed by designated staff to ensure best practice in all aspects of project delivery.\nNegotiate with external customers to ensure their requirements are met and their projects are completed within the set timeframes and budget.\nEnsure the asset recording process of new and existing Unison assets are undertaken and entered in a timely and legible format into the Unison system as appropriate.\nSubmit business reports, as required to the Operations Manager together with recommendations for continuous improvement.\nTrack and control the cost centre budget for the team. Provide feedback to various parties both internal and external with the objective of achieving continuous improvement, innovation and risk management.\nUndertake other responsibilities as reasonably required from time to time to meet the demands of the business.\nPeople Responsibilities\n \nModel the company values in your leadership actions, decisions and communications;\nEncourage and coach your team to apply the company values in their day to day work and challenge behaviours that do not match Unison's values;\nCommunicate clear performance expectations to your people in order for them to understand how their role contributes to the achievement of Unison's strategy and vision;\nCoach and support your team to identify their personal development needs, to formulate and implement an individual development plan and to assess its impact on results and relationships;\nInspire and motivate your team by leading, guiding and providing effective feedback to build a high performing team and individuals;\nCultivate an environment of continuous improvement, innovation and initiative by facilitating an open exchange of ideas;\nTake a long-term view and formulate effective strategies consistent with the business strategy; and\nDevelop and build relationships, engage in cross-functional activities, utilise contacts to build and strengthen internal processes\nWe welcome applications from those who have the immediate right to work in NZ.  If you are interested, please apply online.  \nUnison is proud to be an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We also understand that great performance comes from great people. As a valued team member, you will receive ongoing training and development as well as a host of benefits including great remuneration, health insurance, and subsidies to enjoy an active and healthy lifestyle. \nApplications close 4th April 2021.\nFor full details including a job description see http://www.unison.co.nz/tell-me-about/careers/current-vacancies"}