{"title":"Operator - Blast Crew","salary":"Not Found","dataCreated":"2021-04-13","city":"West Coast","area":"Rest of West Coast","employer":"Orica","validThrough":"2021-05-13","type":"Full Time","description":"We are Orica, the global leader in mining and civil blasting.\nIt’s an exciting time for us. Through digital and automated technologies, we’re transforming the drill and blast process to increase safety and productivity in mining.\nEvery day we embrace new ways of thinking and work closely together to deliver innovative technologies, to ensure we remain at the forefront of our industry. And we believe that our 11,500+ people around the world play the most important role in helping our customers find success.\nAbout the role:\nWe are delighted to announce that we are inviting applications for the fresh new career opportunity of Experienced or Trainee Operator MMU Operator.\nBased at Stockton Mine Site, the Operator will form part of a well-oiled, united, highly performing and supportive team of Blasting Professionals.\nAs an MMU Operator, you will be specifically trained and supported to operate an MMU (Mobile Manufacturing Unit), which is a highly advanced Heavy Rigid vehicle fitted with latest technologies and onboard computer systems. This vehicle is used to pump the explosive product into pre-drilled blast holes on our customer sites.\nThis really is an incredible opportunity to change career, and develop an exciting career path with a company who genuinely supports your ambitions.\nWhat you will be doing (once fully trained):\n \nOperating our MMU vehicle (Mobile Manufacturing Units) and other associated blasting plant and machinery;\nAssisting with preventative maintenance;\nAssist with the 'hands-on' delivery of explosive products down pre-drilled blast holes on bench;\nWorking in tight unison with your teammates to provide excellence in service to our valued customers;\nDemonstrating and setting the example of our key company value: 'Safety is our Priority, Always';\nAt all times acting with integrity and respect.\nWhat you bring:\n \nA current Class 4 drivers licence, or the ability to gain this prior to your commencement;\nAbility to pass all required security checks in which to obtain a CSL licence;\nAn excellent, positive and team based attitude where you look out for your mates;\nA basic mechanical comprehension is advantageous.\nWhat we offer:\n \nA diverse and inclusive workplace where your unique abilities and talents will be recognised, female applicants are encouraged to apply;\nThe opportunities, facilities and environment associated with working in an international organisation;\nTraining programs with ongoing support, career opportunities and initiatives to ensure your continued growth."}