{"title":"Programme Manager","salary":"Not Found","dataCreated":"2021-03-29","city":"Wellington","area":"Hutt Valley","employer":"RobLawMax Recruitment","validThrough":"2021-04-28","type":"Full Time","description":"International Infrastructure Services Company Ltd (NZ Branch) provides commercial and operational services to Wellington Electricity. Wellington Electricity is an electricity distributor - our core business is to manage the poles, overhead lines, underground cables and equipment that deliver electricity to homes and businesses in the Wellington, Porirua and Hutt Valley regions of New Zealand. RobLawMax Recruitment has exclusively partnered with Wellington Electricity in the search for a Programme Manager to join their Team.\n \nWith a desire to provide the best service possible, Wellington Electricity, through its infrastructure services provider, requires a high calibre Programme / Project Manager to manage the delivery of Capex and Opex work programmes including customer initiated works to time, quality, budget and agreed policy, regulatory and legislative standards.\n \nKey role responsibilities will include:\n \nManage and lead the delivery of Capex and maintenance projects and services including managing internal and sub-contract resources as required.\nPreparation, evaluation and issue of tenders for the engagement of consultancy services, construction works and the supply of major plant and / or materials.\nDetermine the design parameters, scope and resources required to complete customer projects.\nUtilise the Asset and Planning Team in order to investigate and develop the design for Customer requests and opportunities to combine asset maintenance with concurrent project works.\nManage the relationship with the Asset and Planning and Works Integration teams and all external customers to ensure all stakeholder requirements are met.\nEssential for the role is a tertiary qualification in Electrical Engineering, along with:\n \nExperience associated with electricity transmission / distribution networks or related contractors.\nA proven ability to manage projects, contractors and assess risks, opportunities, resource requirements and materials is required.\nDetailed knowledge of the concepts and principles of project and contractor management.\nKnowledge of SAP and other project management, estimating or management tools.\nGood understanding of electrical distribution systems along with asset inspection and maintenance activities.\nDemonstrate a disciplined approach towards H&amp;S, quality and risk management, ensuring this is maintained by the Field Service Providers.\nA sound commercial acumen and knowledge of the legal and regulatory environment in New Zealand.\nYou will have well developed interpersonal, communication and relationship management skills, relevant previous experience in programme / project / contract management, a pro active focus and an ability to deal with people at all levels. You will enjoy a challenge, be able to multi-task, think strategically and succeed in delivering your objectives.  On offer is an attractive remuneration package and a great career opportunity with an industry leader.\nIf you are currently in a similar role and seeking a change or ready for the 'next step' in your career then apply today.\n \nFor more information on this or other opportunities within the sector, phone in confidence, Juanel on +64 4 471 6985, apply online or email your CV to jobs@roblawmax.co.nz Ref: JV70999"}