{"title":"Operations Specialist","salary":"Not Found","dataCreated":"2021-04-13","city":"Wellington","area":"Wellington Central","employer":"Simply Energy Limited","validThrough":"2021-05-13","type":"Full Time","description":"About the role\nIn the role of Operations Specialist, you will effectively execute the Market Operations processes and be the go-to for any detailed or complicated questions in the Operations team. You’ll report to the Operations Team Lead and work closely with the Operations Analysts and the wider Billing, Pricing and Customer Care team to ensure the best outcome for our customers. With this role we promise variation so you can look forward to finessing your agility skills as you find yourself moving across many different tasks in any given day.\nWhat you'll do\nEffectively execute Market Operations processes including switching, new sites, reconnections, disconnections, reads, ICP set ups, ICP status changes, outage notifications etc and understand the detail of each of these processes.\nIdentifying and resolving any technical or process issues that place the organisation at risk of breaching the Electricity Code\nDeliver a high standard of field service management to internal and external customers and help manage the relationships with external field service providers to ensure we are receiving service as per our contracted position\nEnsure all industry and regulatory compliance obligations are met.\nMaintain up to date schedules and process documentation as well as training the Operations Analysts on any new or changed processes.\nPerform detailed analysis of operations issues to provide exceptional customer solutions, diagnose issues within our systems and recommend and design solutions.\nProvide backup and support for our Operations Analysts as required.\nIdentify opportunities for process and system improvement.\nParticipate or lead as required in projects and audits, ensuring action points are reviewed and completed within agreed timeframes.\nSkills you will bring to the role:\nUnderstanding of the New Zealand electricity and gas markets\nStrong technical understanding of metering, switching and billing.\nProven analytical skills.\nPositive, can do attitude.\nAbility to identify and recommend cost effective solutions.\nA sound understanding of complex operational processes and ability to effectively resolve issues.\nAdvanced Excel skills.\nIntegrity and high personal and professional standards.\nAdvanced communication skills, both verbal and written.\nRelevant professional qualification an advantage.\nSalesforce experience is an advantage.\nHow you'll be successful\nYou’ll be passionate about our purpose and excited to help our customers decarbonize sustainably.\nYour integrity and high personal and professional standards are noticeable and you have a willingness to do the right thing as opposed to the easy thing. You’re naturally curious and take a flexible approach, and respond well to new ideas which is demonstrated by a willingness to take on new challenges.\nYou’ll need a high level of initiative and self-management skills; you’ll be proactive, have a high ability to cope under pressure and use your proven analytical, problem solving and decision making skills to determine priorities for yourself and others.\nYou understand the importance of the industry regulations and are capable and willing to follow process – holding those responsibilities as your top priority.\nIf you enjoy working in the ‘grey’ as well as the black and white, this is the perfect role for you.\nWhat you'll get in return\nSimply Energy is an exciting company and working for us is not only an opportunity for you to make an impact on New Zealand and the climate, but you will be rewarded competitively for your contribution. \nWe exist to lead the energy sector to a low-carbon future. This is no easy task, but if you are up for the challenge we would love to hear from you.\nApplications close 5pm 27 April 2021"}