{"title":"Underground Geotechnical Engineer - Waihi Operation","salary":"Not Found","dataCreated":"2021-04-06","city":"Bay of Plenty","area":"Rest of Bay of Plenty","employer":"OceanaGold (New Zealand) Ltd","validThrough":"2021-05-06","type":"Full Time","description":"Competitive salary, bonus, medical insurance \nNine days on five days off roster \nGreat residential location\nThe role\nReporting to the Principal Geotechnical Engineer, you will have the opportunity to grow your skills in a complex and dynamic mine that is planned to extract ore in both virgin and remnant mining areas below an existing Open Pit. A good understanding of rock mechanics in relation to ground support design is a must. You will be responsible for identifying and managing geotechnical risks in the underground operations through reviews of short term mine designs, regular inspections of the underground workings, and the installation and monitoring of geotechnical instruments.\nKey tasks and responsibilities: \nEnsure geotechnical monitoring instruments are read and data bases maintained\nConduct regular inspections of all mining areas to monitor for geotechnical hazards\nCarry out audits of all mining sites to ensure that tunnel and stope support has been installed as per designs\nProvide geotechnical support services to mining operations on any day to day geotechnical problems\nAssist with the review and implementation of site Geotechnical Management Systems\nTo be successful in this role you will have the following: \nA relevant tertiary qualification in either Geomechanics, Geotechnical Engineering or Engineering Geology\nA minimum of two years' experience in underground mining is preferred\nExperience with rock mass classification systems, geotechnical analysis, structural mapping, ground support design and underground mining QA/QC programs\nA full and current driver's licence\nAbout the company\nOceanaGold Corporation is a mid-tier, multinational gold producer with assets in the Philippines, New Zealand and the United States. On the North Island of New Zealand, the company operates the high-grade Waihi Gold Mine while on the South Island; the company operates the country's largest gold mine, the Macraes Goldfield.\nAt OceanaGold, health and safety are paramount to the success of our business as are employees who engage in behaviours that align with our values.\nOGC VALUES\n:\n RESPECT | ONE TEAM | CONTRIBUTE | KNOWLEDGE\nOceanaGold is committed to providing equal employment opportunities.\nIf you share the same values and have what we are looking for, please apply online now via our website: www.careers.oceanagold.com\nApplications close Friday, 23 April 2021. Shortlisting will commence immediately.\nApplicants must be eligible to work in New Zealand.\nDue to COVID 19 border restrictions in New Zealand we are unable to consider applicants outside of New Zealand who are not NZ citizens or permanent residents.\nNO APPLICATIONS FROM EMPLOYMENT AGENCIES WILL BE ACCEPTED."}