{"title":"Team Leader","salary":"Not Found","dataCreated":"2021-03-31","city":"Auckland","area":"Papakura & Franklin","employer":"Counties Power Ltd","validThrough":"2021-05-01","type":"Full Time","description":"Are you an experienced Line Mechanic who is ready to step up and lead or a Team Leader with a couple years under your belt?  We are looking for a Team Leader to lead one of our dedicated Overhead lines crew!\nWith area growth sky rocketing, Counties Power has many exciting and rewarding projects happening now and in the future.  Joining us means joining a company with long standing history within the local community, friendly team environment and a company that sees health, safety, and wellbeing of everyone as at the forefront.  \nAs a Team Leader you will act in a frontline leadership capacity, take operational responsibility of allocated works, have a thorough understanding of health and safety and take complete ownership and accountability for the safe and efficient conduct of team members and contractors working with them.\nTo be successful in this role you will:\nHave at least 5 years Line Mechanic experience and be knowledgeable in both Underground and Overhead distribution environments,\nAt least a year or two experience in supervising and leading teams, or have demonstrated ability to step up when required,\nHave demonstrated strong communication skills and ability to establish effective working relationships,\nHave demonstrated confidence, resilience, a drive for success and a high level of respect within the electricity industry,\nDemonstrate capability in driving efficiency, continuous improvements, and a high performing safety culture.\nThis is a rare and exciting opportunity so if you think you have what it takes please apply!\nTo apply:\nApplications must include an up to date CV and cover letter.  \nApplications close Wednesday 14 April 2021.\nAs part of our recruitment process all candidates are required to undergo and pass a pre-employment medical check and drug test\n. \nPlease note that you may not receive notification of the outcome of your application until the vacancy has closed and we have completed the shortlisting process.\n(No recruitment agencies please)"}