{"title":"Commercial Analyst","salary":"Not Found","dataCreated":"2021-04-11","city":"Wellington","area":"Wellington Central","employer":"Powershop","validThrough":"2021-05-12","type":"Full Time","description":"Company Description\nPowershop is the world’s first online shop for electricity. For more than ten years we’ve worked hard to turn the industry on its head and have built a power company that people don’t like but actually love!\n• We pride ourselves on our office culture and want you to succeed here, so we encourage our crew to bring their whole selves to work, including the guilty pleasures \n• We don’t take ourselves too seriously, but we do take our work seriously\n• We celebrate the wins as a team. We have team goals and share in the success of each team member\nJob Description\nWe are looking for a switched on (get it?) commercial analyst to join our small but perfectly formed Commercial team. You’ll be integral to the success of our business, contributing across our wider Meridian Customer Team. You will help in creating and maintaining internal tools used for various processes – such as customer prospecting and revenue &amp; cost analysis, and will help ensure the accuracy of all customers’ pricing within our billing system.\nQualifications\nIt's a given that you will be commercially astute and will bring a background in analysis to this role. You will be a self-starter, who is ready for a new challenge and keen to learn. You will have excellent communication skills and be able to build rapport easily across the business. Attention to detail and good numerical and problem solving skills are key in this role. You’ll be an engaged team member, who thrives in a supportive, positive environment. We enjoy a flexible working environment, with at least two days in the office each week as a team so that we can stay well connected.\nAdditional Information\nIf you think you are an awesome fit, not only for our role but also for our team  – tell us why!  Include a cover letter with your CV and apply using the “Apply Now” button.  \nIf you require any more information, please contact Patrice Wilkin, Talent Business Partner, on 021 225 4994.\nApplications close on Monday 26/04/2021 (please note this is subject to change)"}