{"title":"Distribution Line Mechanics","salary":"Not Found","dataCreated":"2021-04-20","city":"Southland","area":"Rest of Southland","employer":"PowerNet","validThrough":"2021-05-20","type":"Full Time","description":"Want to work for a progressive, innovative company in the stunning southern region of NZ? Come and work for PowerNet.\nWe’re New Zealand’s fourth largest electricity network company. We manage five electricity networks across the diverse and spectacular lower South Island—the best part of New Zealand.\nWe pride ourselves on delivering safe, efficient, and reliable power to southern communities.\nOur field team play a significant part in our business. As a Distribution Line Mechanic based in our Balclutha, Gore, Te Anau or Invercargill Depots, you’ll be part of a dynamic and forward thinking distribution team who safely build and maintain reliable electricity for our customers throughout the network. You’ll be integral to our success.\nWe offer:\nCompetitive market rates\nConsistent overtime and regular standby rosters\nGreat benefits, including insurances and health and well-being programmes\nA fantastic team environment\nThe opportunity to build your professional career in a supportive environment.\nResponsibilities/Skills &amp; Experience:\nProvide Line maintenance, construction, and line fault repair services\nInstall, replace, and maintain overhead line equipment\nDemonstrate good working relationships with other team members, customers, and contractors\nQualified Line Mechanic with current EWRB registration\nAt least 2 years post-registration experience preferred\nCurrent working knowledge of the industry’s safety regulations\nThis is an exciting opportunity to contribute to a dynamic, challenging industry that’s critical to New Zealand’s future while living in southern New Zealand. Here you’ll be able to enjoy the wonderful lifestyle and community opportunities on offer, in one of New Zealand’s most affordable regions.\nOur people continually strive to do things better for our customers and communities. We support our teams to do well, growing a better future for our company and our employees. Come join us and share in our success!\nFor more information email us at careers@powernet.co.nz or to apply online visit https://careers.powernet.co.nz \nPlease attach an up-to-date CV and cover letter to support your application."}