{"title":"HSEQ Business Partner","salary":"Not Found","dataCreated":"2021-03-21","city":"Bay of Plenty","area":"Rest of Bay of Plenty","employer":"Technical Recruitment Solutions","validThrough":"2021-04-21","type":"Full Time","description":"Please Note: Due to the Covid-19 pandemic New Zealand's borders are closed to anyone not a citizen or resident. Because of this, we can only consider people already living and working in New Zealand.\nThe company and the job.\nBased in the Sunny Bay of Plenty, our client is involved in a number of industries and are looking for an experienced \nHSEQ Business Partner (Advisor) \nto join the team. You would be Whakatane based, but looking after branch operations in Rotorua and Tauranga as well. \nThe role will have you working to foster HSEQ understanding, use and to improve systems and processes within the organisation, etc. You will be our 'Subject Matter expert', the go-to person, for all things HSE&amp;Q.\nIn particular, you will:\n* Work with managers and field staff, to ensure they know what's required and can/are using the systems in place\n* Produce timely and accurate reports for your management and regulatory Authorities\n* Help the HSEQ Manager in preparing and rolling out new initiatives and training to ensure continual improvements \nWe need someone who's 'been there and done that', so you will know what's involved.\nThe person.\nWe're looking for a person:\n* Qualified with NZ Cert. in Workplace H&amp;S Practices and/or NEBOSH - Occupational Safety &amp; Health, or equivalent \n* Who can show us experience in managing Health &amp; Safety in complex manufacturing, construction type environments (Electrical understanding a definite advantage)\n* With great people skills and be a relationship builder and an 'Infulencer'\n* Who has above average report writing skills and strong MS Office skills and abilities\nYou will hold a full, clean, NZ Manual Drivers License and enjoy variety and challenge. Sound like you?\nIf you need a change and are good at getting people singing from 'your' HSE song book, let's talk.\nTo apply for this position please click on the relevant button below, alternatively for a confidential and discreet inquiry contact \nDaniel Hopkins\n on \n04 282 1563\n or \n027 700 0994 \nor email \ndaniel@trs.co.nz"}