{"title":"Water & Wastewater Operator - Central Otago","salary":"Not Found","dataCreated":"2021-04-07","city":"Otago","area":"","employer":"Fulton Hogan","validThrough":"2021-05-08","type":"Full Time","description":"Central Otago is renowned for its stunning scenery and popular attractions; surrounded by impressive mountains and the beautiful lakes. If you are looking for a role with a great lifestyle, this could be the opportunity that you've been waiting for!\n \nWhat you will be doing\n We are looking for a self-motivated individual who is keen to start or further a career in utilities. The role will see you involved in daily operation of the water treatment plants, maintenance of the waste water pump stations, routine inspection and maintenance, and grounds maintenance.\n This is a full time permanent opportunity to train and work in a variety of works with our Three Waters Crew in Central Otago and Queenstown Lakes. Working with the Crew Supervisor, you will be responsible for the following:\nSafe and efficient operation of our plant.\nVarious drainlaying, water and general labouring duties.\nAssisting with regular maintenance.\nYou will be required to work a minimum of 40 hours per week. Over 40 hours will be paid time and a half. PPE provided and all training will be given to the successful candidate.\n \nYou will bring to the role;\nExperience in water treatment plants and reticulation of water and waste water systems\nFull class 2 license and WTR endorsements\nSelf-motivation coupled with ability to problem solve\nStrong focus on safety and quality\nNational Certificate in Water Treatment (or working towards this) is preferable.\nFor the right candidate who is genuinely interested in this area of work, we will help you work towards your qualifications. This role involves being on-call at times, as part of a rotating roster so some flexibility is required.\n \nFulton Hogan Philosophy\n We build and maintain critical infrastructure that connects and enhances communities across New Zealand, Australia and the Pacific. Everything from roads and bridges, to airports and utilities. We're committed to ensuring the Good Work we do will make a positive difference to the quality of life for our people, our customers and the communities we all call home. Our continued success relies on generating new and diverse ideas, which is why our 'Good Work' culture encourages ownership and empowerment, while never forgetting the importance of balancing life's priorities.\n \nSound like you?\n If this sounds like you and you would like to help build on our Good Work culture, then we would like to hear from you.\n Apply online with your CV and cover letter. If you require further information please call 03 4400547."}