{"title":"Line Mechanic","salary":"Not Found","dataCreated":"2021-04-09","city":"Otago","area":"Rest of Otago","employer":"Connetics","validThrough":"2021-05-09","type":"Full Time","description":"This is an exciting opportunity to be part of an organisation with a local feel, that has the backing and support of a national organisation. Connetics head office is based in Christchurch, with our Northern region is based out of Wellington. We are excited to have secured long terms contracts in Central Otago and the opportunities that brings for us to contribute to the region.\nWe offer a modern working environment and flexible working practices that encourage work-life balance to make the most of living in the region. We also offer a competitive salary with added benefits such as Long Service Leave, professional development, and generous costs reimbursement if relocating.\nIf you're a registered line mechanic with significant experience in overhead line construction and maintenance and a background in distribution and supply, this is an opportunity that could really pay off for your career.\nWe provide (and pay for) all the training and licences you need to do your job plus any extra education you might need for professional development. You'll also find a great range of staff benefits, including long service leave, allowances, and an employer that understands you have a life outside work. If you're joining us from outside Otago, we'll even consider contributing to relocation costs.\nYou can look forward to joining a friendly, social team who have a great time together, look out for one another, and are absolutely committed to everyone's safety. And that's not to mention the lifestyle opportunities that Central Otago offers: between outdoorsy adventures and spending time with your family, life can be as fast or slow as you want. In our corner of the world, we guarantee more life in a day.\nYou'll bring strong written and oral English skills, an open mind, and confidence to bring new ideas to the table. You'll also be happy for some work-related travel - sometimes you'll have to go where you're needed to maintain and restore networks.\nThis isn't just about growing your career and living your best life. It's also about having more. More satisfaction, more opportunity, more innovation, more experiences - and more life in a day for the things and people that matter to you.\nPre-employment tests - Medical and Ministry of Justice\nConnetics require all successful applicants to complete a pre-employment medical test, which includes a drug and alcohol test and a pre-employment Ministry of Justice check.\nOverseas applicants\nDue to COVID-19 border restrictions we are currently unable to take applications from people based overseas unless you already have a travel exemption, and are eligible to work in this role in New Zealand.\nWant to enjoy more life in a day? Apply now at https://www.connetics.co.nz/careers/life-in-a-day\n\\n\\nTo see the Job Description file please copy and paste the URL below into your internet browser's address bar https://expressonline.haineslink.co.nz/pdfs/681262_jobdesc.pdf"}