{"title":"Project/Service Supervisor","salary":"Not Found","dataCreated":"2021-03-17","city":"Taranaki","area":"New Plymouth","employer":"ABB Power Grids NZ PTY LTD","validThrough":"2021-04-24","type":"Full Time","description":"Hitachi ABB Power Grids is a pioneering technology leader that is helping to increase access to affordable, reliable, sustainable and modern energy for all. We help to power your home, keep the factories running, and our hospitals and schools open. Come as you are and prepare to get better as you learn from others. Bring your passion, bring your energy, and plug into a team that appreciates a simple truth: Diversity + Collaboration = Great Innovation\n  \nThe Power Grids business offers power and automation products, systems, service and software solutions across the generation, transmission and distribution value chain. The Power Grids business offers power and automation products, systems, service and software solutions across the generation, transmission, and distribution value chain.\n  \nHitachi ABB Power Grid Integration support customers in creating stronger, smarter, and greener grids adapted to meet the needs of the changing power landscape. Our system solutions are designed and delivered to provide the highest lifecycle value with the lowest risk. We are hiring within the Grid Integration team and searching for an experienced Project/Service Supervisor for either our Hamilton or New Plymouth locations.\n  \nThe main focus for this role will be to Supervise a team on Project and Service, contributing to the execution of the business strategy and growth by focusing on delivering timely, high-quality, cost effective service offerings, solutions and projects for customers. Drive Project and Service achievements through effective planning and allocation of resources in accordance with standard processes, procedures and safety guidelines. Hitachi ABB Power Grid Integration support customers in creating stronger, smarter and greener grids adapted to meet the needs of the changing power landscape. Our system solutions are designed and delivered to provide the highest lifecycle value with the lowest risk.\n  \nWe are hiring within the Grid Integration team and searching for an experienced Service Supervisor for either our Hamilton or New Plymouth location. The main focus for this role will be to Supervise a team of Service Engineers and Service Technicians and contribute to the execution of the Service strategy and Service growth by focusing on delivering timely, high-quality, cost effective service offerings, solutions and projects (e.g. field service, repair) for customers. Drive Service achievements through effective planning and allocation of resources in accordance with standard processes, procedures and safety guidelines.\n  \nYour responsibilities\n \nPlans project and service on-site activities with the Project Manager including necessary local resources, equipment, and milestones.\nResponsible for coordinating all on-site activities ensuring the successful start-up, construction, erection, testing and commissioning activities in alignment with contract timeline, specifications, standards, and safety requirements.\nServes as an onsite project representative by building and maintaining effective relationships with customers, local authorities, and suppliers to ensure their active support of field activities.\nEnsures detailed and up-to-date Health &amp; Safety (H&amp;S) plan is in place for each work package, compliant with the Hitachi ABB Power Grids H&amp;S plan.\nEnsures all on-site resources are properly trained on company health, safety and environment policy and proactively promotes health and safety considerations to project partners throughout the project.\nEmpowered to suspend any activities on site (be it by Hitachi ABB Power Grids personnel or by subcontractors) in case of OHS violation and, if a situation arises, takes the necessary steps to ensure that Hitachi ABB Power Grids employees and other persons who may be present are not put at risk.\nEnsures correct handling, storage and installation of delivered equipment, coordinating on-site storage as well as shipment logistics to secure timely site delivery of equipment and material.\nManages Hitachi ABB Power Grids sub-contractors on site to ensure necessary quality and progress is achieved to meet delivery date and agreed standards.\nEnsures all documentation is modified and updated as necessary, the document handling system is maintained, and latest revisions are used for the construction work on site.\nLiving Power Grids core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business.\nYour background\n \nElectrical Registration, Level 4 (EWRB) NZ practicing license.\nPrevious project supervision experience in MV/HV industry is preferred.\nA minimum standard of on-site project work including MV-HV switchgear, circuit breaker refurbishment, transformers, installations &amp; upgrades is preferred.\nDemonstrates leadership capabilities.\nExperience working on &amp; understanding construction sites &amp; their related protocols.\nIntermediate level of computer literacy is preferred.\nA full clean driver’s license is required as the role will require driving a company vehicle.\nAbility to work at heights.\nAn eye for detail.\nA great attitude and a willingness to be a part of a team.\nMore about us\n  \nHitachi ABB Power Grids is a global technology leader with a combined heritage of almost 250 years, employing around 36,000 people in 90 countries. Headquartered in Switzerland, the business serves utility, industry and infrastructure customers across the value chain, and emerging areas like sustainable mobility, smart cities, energy storage and data centres. With a proven track record, global footprint and unparalleled installed base, Hitachi ABB Power Grids balances social, environmental and economic values, and is committed to powering good for a sustainable energy future, with pioneering and digital technologies, as the partner of choice for enabling a stronger, smarter and greener grid. www.hitachiabb-powergrids.com\n  \nDiversity and Inclusion Statement\n  \nPower Grids is committed to Equal Employment Opportunity and recognizes the importance of attracting the right people for the right job. We are actively seeking to increase the diversity of our team and encourage applications from people from culturally and linguistically diverse backgrounds, women, the LGBTQI+ community, people living with disability/ies and Aboriginal and Torres Strait Islander people."}