{"title":"Network Procurement & Contracts Lead","salary":"Not Found","dataCreated":"2021-04-20","city":"Canterbury","area":"Timaru & South Canterbury","employer":"Alpine Energy","validThrough":"2021-05-20","type":"Full Time","description":"Alpine Energy is at an exciting stage of its transformational journey.  Due to industry growth and a desire to seek continuous improvement, they are adding significant head count to their team.  With the values of Integrity, Safety, Accountability all built on a Foundation of Respect underpinning their journey, Alpine is growing to improve work programme delivery and strengthening their asset management strategies.\nWhat’s involved\nImproving procurement, capability &amp; efficiencies you will be responsible for overseeing best practice procurement processes and systems, ensuring optimal commercial supplier relationships and reliable access to services and assets across Alpine.\nYou will be responsible for purchasing decisions, providing forecasting and planning, this role is busy and varied.  With a natural interest in analysing information, you can make smart decisions and improve processes across the supply chain.\nThe majority of time in this role will be spent on analysing performance, identifying issues and recommending solutions to the Network Program &amp; Delivery team.\nAlpine Energy is at an exciting stage of its transformational journey making now a great time to jump on board.  You will be joining a modern working environment that fosters collaboration and productivity.  With regular team events and a strong connection to the South Canterbury community, Alpine takes a people first approach.  A range of benefits are on offer including generous relocation support to help enable your move.\nFor a confidential discussion around this position please  email Damien Whiffen (damien.whiffen@alpineenergy.co.nz).  Alternatively, please submit your covering letter and resume.  All applications will be treated with the strictest confidence. You must have the right to live and work in New Zealand.\nFor a copy of the Job Description visit <a href=\\"}