{"title":"Technical Officer","salary":"Not Found","dataCreated":"2021-04-20","city":"Wellington","area":"Wellington Central","employer":"WorkSafe New Zealand","validThrough":"2021-05-20","type":"Full Time","description":"\\n\nPassionate about improving electrical and gas safety? \n\\n\nWant to further your expertise in a regulatory role?\n\\n\nWe are recruiting for two permanent roles based in Wellington or Auckland \n\\n\n\\n\nWe are looking for individuals with significant experience in the electrical or gas industries to join our Energy Safety team in Wellington or Auckland (other locations may be considered for the right candidate).\n\\n\nWorkSafe's Energy Safety team is committed to promoting and ensuring the safe supply and use of electricity and gas. It works with industry to promote high safety and quality standards in networks, installations and products.\n\\n\nOur team of expert technical officers and advisors educate, advise on, investigate, audit, and ensure compliance (enforce) the safety and supply quality frameworks for electricity and gas established by legislation, standards and codes of practice.\n\\n\nAs part of this team, you'll liaise with the best in New Zealand industry. This role has a significant impact on electrical and gas safety through interventions which change industry and public behaviour.\n\\n\nThe successful candidate will have:\n\\n\n\\n\nA tertiary or professional, electrical trade, gas fitting or related occupation qualification and extensive relevant industry experience\n\\n\nHigh technical knowledge and a good understanding of industry issues and the wider stakeholder network\n\\n\nAbility and initiative to recognise where safety outcomes could be achieved\n\\n\nSound knowledge of the administration of regulatory frameworks including enforcement and compliance mechanisms\n\\n\nAbility to self-manage work portfolios and work well under pressure\n\\n\nDemonstrated interpersonal and communication skills\n\\n\nAbility to interpret and administer legislative requirements and write technical reports in \\"}