{"title":"Production Manager","salary":"Not Found","dataCreated":"2021-04-19","city":"Auckland","area":"Rodney & North Shore","employer":"Eziswap Gas","validThrough":"2021-05-19","type":"Full Time","description":"PRODUCTION MANAGER:\n  \nWe are proudly 100% New Zealand owned and operated and specialise in providing industrial gas products to thousands of customers across the country. Our team is at the heart of our success - we’re a team with a commitment to providing our kiwi customers with great products through an easy to use industrial gas system and industry leading customer service. \n  \nTHE OPPORTUNITY:\n  \nWe’re a growing business with strong demand for our products and we have an excellent opportunity for an experienced production manager to join our friendly North Shore based team.  \n  \nKEY TASKS:\n \nSupervision and management of staff in the production facility;\nScheduling and managing resources to meet supply demands;\nQuality control inspection of stock and stock components;\nControl, organise and order consumables for production facility and workshop;\nManage outgoing orders and product deliveries;\nEnsuring company Health &amp; Safety procedures and standards are upheld;\nOrganise and assist with MPI and Bio Security inspections and audits;\nEnsuring staff are trained and the proper records maintained;\nManaging periodic stock takes;\nProvide assistance in the production facility when required.\nKEY ATTRIBUTES:\n \n5 + years production planning and staff management experience;\nIdeally a background in industrial gas production, manufacturing or transport logistics environments;\nExperience in manufacturing process improvement;\nExperience implementing and following preventative maintenance programmes;\nExperience in implementing and enforcing health and safety policies and practices;\nConfident IT user of Microsoft Office with an ability to become proficient with new software;\nAbility to build and maintain strong internal and external customer relationships;\nHold both a Heavy Traffic (class 2 or class 4) and Forklift licence or have the ability to obtain both.\nYou will have a strong academic background with an understanding of ERP systems, manufacturing operations and logistics. \n  \nTO SUCCEED IN THIS ROLE:\n  \nYou will have a ‘can-do’ attitude and be comfortable managing a team. You will be a confident communicator with an inclusive approach and will:\n \nProvide leadership, coaching and direction to the team;\nDrive efficiencies and optimisation across manufacturing, supply chain and all site operations;\nProvide oversight and feedback to management to help ensure Best Practice decisions in the day-to-day running of the Plant;\nIdentify opportunities and implement continuous Improvement;\nChampion HSE and Zero Harm across the business;\nReport directly to the MD and work closely with our Technical Manager and Office Manager;\nConsistently monitor the quality process plant-wide to ensure high standards at all times;\nBe highly organised, self-motivated and passionate about delivering excellent results.\nAre you ready to take the lead? If this sounds like you we would love to hear from you!"}