{"title":"Distribution Line Mechanics","salary":"Not Found","dataCreated":"2021-04-01","city":"Otago","area":"Rest of Otago","employer":"Network Waitaki Ltd","validThrough":"2021-05-01","type":"Full Time","description":"Based in the vibrant coastal town of Oamaru with a team of 85 passionate and dedicated staff, our core business is bringing electricity from the national grid to over 13,000 connected customers in North Otago and parts of South Canterbury, providing innovative energy solutions to our customers, as well as providing electrical construction and maintenance services across New Zealand.\nWe are transforming our business into a modern, customer centric service provider and are strongly committed to supporting our people and providing a flexible environment where you can succeed and grow. \nAs part of this growth, we need experienced Line Mechanics to join our existing skilled team.  \nWhy Oamaru?\n \nAffordable housing\nGreat schools\nClose to the stunning outdoors – ski fields, rivers, lakes and mountains\nFriendly and supportive community\nNo traffic jams\nHow do you line up? We need\n \nRelevant experience with overhead and underground distribution assets up to and including 66kV\nCurrent NZ EWRB Registration as a Distribution Line Mechanic\nCurrent Glove and Barrier qualification desirable (but not essential)\nFull NZ Drivers License Class 1 required\nNZ Drivers Licenses Classes 2 through to 5 is beneficial but can be obtained ‘on the job’.\nWe are a 24/7 operation therefore this role will be required to be available for after hours and emergency situations as part of the role.\nExperience in using mobile devices\nTeam player and a commitment to safety in the workplace\nAble to undertake pre-employment medical and Ministry of Justice checks\nLegally able to work in New Zealand\nAnd we are looking for someone who:\nHas a great attitude to life, a team player, strong communicator and excellent problem solver and who aligns with our Values:\n \nWe care about our People\nWe are one Team\nWe love our Region\nWe are Future Thinking\nRelocation support will be provided for successful candidates as will competitive remuneration. We are also committed to providing you with a safe, social and supportive environment in which to grow your career.\nThe Application Process:\nFor enquires and/or a position description please email careers@networkwaitaki.co.nz.   \nPlease apply via SEEK.\nApplications close 16 April 2021."}