{"title":"Mechanical Generation Technicians","salary":"Not Found","dataCreated":"2021-04-08","city":"Waikato","area":"Taupo","employer":"Contact Energy","validThrough":"2021-05-08","type":"Full Time","description":"Company Description\nKo wai mātou | About us   \nOur purpose is to put our energy where it matters, to decarbonise the New Zealand energy sector and promote #changematters.    \nWe are committed to delivering market leading performance to shareholders and value to our customers. We will add value to the resources that we are stewards of, in turn ensuring the sustainability of our business.  We work closely with iwi, our neighbours, contractors and our local communities to develop projects that deliver wider benefits beyond the obvious.  \nTo support these aspirations, we are in a state of growth and introducing an exciting, industry first way of structuring our operational teams at our geothermal business unit.  This means reshaping how we work, what we work on and developing our people to be curious and empower them to make decisions in a high trust environment. In other word/s kaitiakitanga. \n \nJob Description\nTe Whiwhinga mahi | The opportunity \nThis role would suit an enthusiastic and self-motivated person. You’ll conduct and manage maintenance throughout the plant ensuring safety at the workplace and maintaining reliability maintenance standards. \nLet us paint a picture of some of the work you will be responsible for: \n \nPerform maintenance work and complex tasks such as time-based overhauls, replacements, technical repairs, calibrations, and inspections \nImplement RCM (Reliability Centred Maintenance) activities to improve Predictive and Preventive Maintenance practices \nMonitor plant condition, identify and report on defective plant and equipment, undertake preventive measures, and rectify problems where required \nEnsure that all activities and tasks are conducted in compliance with environmental consents, and within station and company environmental guidelines and procedures \nEnsure that safe working and occupational health principles and practices are known and observed, and that all safety rules and procedures are complied with by Contact and other personnel working on site \nMaintain up to date knowledge and skills of Quality Management System requirements, all relevant Health and Safety practices and procedures, and relevant legislative requirements\n \nQualifications\nKo wai koe | About you \nYou will be a natural influencer, be famous for your communication style and ability to take people on a journey and an agent for change; making sure we are always improving on what we do. Like any opportunity, there are some key attributes that we would like to add to our bench strength.  \nYou will have plenty of examples to tell us about: \n \nRelevant National Diploma/NZCE, Trade Certificate, or equivalent qualification in a specialist mechanical maintenance discipline, with sound experience in maintenance of power generation and/or heavy rotating mechanical plant and auxiliary equipment. \nMachining capability including lathe and milling experience would be desirable \nDemonstrated ability to build and maintain relationships with key stakeholders, including strengths in influencing, conflict management, and negotiation \nIntegrity and high personal and professional standards \nSkilled at identifying and recommending cost effective solutions \nSkilled in the effective resolution of complex issues and problems \nExposure to systematic maintenance strategies and experience in condition monitoring \nAbility to apply basic cost benefits analysis principles as part of project/modification considerations \nIn depth knowledge of some, or preferably all, of the following: mechanical plant, heavy rotating equipment, electrical plant, control and protection systems, boilers, gas turbine technology \n  \nAdditional Information\nHow to get involved?  \nAt Contact we are extremely fortunate to actively promote a new ways of working programme, essentially this means that the life/work balance actively present and working remotely is the norm.\nIf working for a progressive company is for you, apply now. Thanks and looking forward to the korero.  \nContact Energy is committed to being an inclusive employer. We want people to be themselves, after all, they can't be anyone else!\nPlease note, only candidates with the right to live and work in New Zealand will be considered for this role."}