{"title":"Terminal Operator","salary":"Not Found","dataCreated":"2021-04-20","city":"Tasman","area":"Nelson","employer":"Z Energy","validThrough":"2021-05-20","type":"Full Time","description":"We believe that if we want to be a world class Kiwi Company, we shouldn’t just employ people, divide them into functional departments and tell them what to do. Instead we give them a reason for belonging, the possibility of a bigger purpose, and a hunger for the extraordinary.\nTerminal storage operations are a key component in our bulk fuels Supply chain, we are the team that fuels the customer offer!  Product is supplied to the terminal via ship from the Port and is distributed from the terminal via truck deliveries from the gantry.\nWe now have an opportunity for a \nTerminal Operator - Ringahāpai Tumu Herenga Waka\n  to join our Nelson team.\nThis role is a great opportunity to start a new career, previous experience preferred but not essential, for the right candidate on the job training will be provided.\n \nYou will have the opportunity to\n \nWork with a close-knit team on site at the Terminal to carry out operational activities, including tasks such as: Tanker receipts (bulk fuel ship discharges), supervising delivery of fuel to vessels, tank gauging, truck loading observations, product sampling &amp; testing, product transfers, compliance checks and forklift operations.\nWork closely with internal and external stakeholders to ensure the Terminal is run in a safe and reliable way.\nTrain towards becoming a Work Permit Issuer and qualified gas tester.\nHelp to supervise &amp; coordinate maintenance activities and recording completed maintenance tasks in Z’s maintenance system. This includes checking work carried out by third parties and carrying out driver and contractor inductions.\nProvide administrative support with the day-to-day running of the Terminal. This includes things like daily stock inventory management, inward and outward stock movement through bulk storage tanks and purchasing activities related to Terminal operations.\nWork in line with Safety and Wellbeing policies, standards and procedures\nTake part in regular training and using the skills learned to complete day-to-day activities.\n  \n \nWhat you’ll bring to Z\n \nHigh level of communication and interpersonal skills to ensure positive relationships with key customers and stakeholders.\nMust be up for working outside and in all weather conditions.\nNormal work hours are Monday to Friday, the ability to be flexible for work after hours and on weekends will sometimes be required.\nBe a practical hands-on person.\nActively engaged in Safety &amp; Wellbeing meetings.\nGood work ethic and a great team player\nComputer literate with the ability to learn new systems.\nAnd of course, you’ll be passionate about what matters to Z and helping us deliver on our aspirations.\n \nWhat we can offer you\n \nThe opportunity to develop and grow in a dynamic organisation within a rapidly changing industry looking to the future.\nA competitive short-term incentive (bonus) plan.\nFully paid medical insurance for you &amp; your family (Southern Cross Regular Care).\n5% employer contribution for KiwiSaver.\nTwo days a year to do good in your hood.\nGenerous leave provisions including parental leave paid for 26 weeks and the option to buy extra leave.\n \nWhy Z?\nWe’re committed to reflecting the diversity of Aotearoa New Zealand with an inclusive culture that is built on our values. We are proud to have the Rainbow Tick, Gender Tick, promote flexible working, and hold strong connection and commitment to community.  Z is a dynamic and innovative Kiwi company that is not only providing for today but looking forward to our low-carbon future.\nBefore deciding to join us, please read \nOur Why\n. \n If Z feels like a good match for your head and your heart, come join us for one heck of a journey!\nPlease include a cover letter in your application, telling us why you are a great fit for Z.\nClick \\"}