{"title":"Project Officer - The Living Murray","salary":"Not Found","dataCreated":"2021-04-19","city":"Auckland","area":"Auckland Central","employer":"Forestry Corporation","validThrough":"2021-05-19","type":"Full Time","description":"Contribute to the recovery of our iconic Red River Gum Forest \nRewarding opportunity in the growing environmental water sector\nPermanent Position in Deniliquin (NSW Australia)\n \nAbout Us \nForestry Corporation of NSW (FCNSW) is the largest manager of commercial native and plantation forests in NSW. We manage more than two million hectares of forests for the economic, environmental and social benefit of the people of NSW and Australia.  FCNSW adheres to the values of respect, innovation, integrity and wellbeing. For more information about who we are and what we do visit forestrycorporation.com.au [link removed]\nThe Living Murray Program \nThe Living Murray is a joint initiative of the Australian Government and the governments of New South Wales, Victoria, South Australia and the Australian Capital Territory. It was initiated in response to compelling evidence of a long-term serious decline in the health of the Murray River system. Its primary goal is to achieve a healthy, working river for the benefit of all Australians. To this end, it focuses on improving the health of six important ‘icon sites’ along the river by increasing the flow of environmental water to benefit the plants, animals and communities that the river supports.\nAbout the Role\nWe currently have a fantastic opportunity for a Project Officer to support the great initiatives currently taking place.  The role will assist the TLM Program Manager to implement The Living Murray (TLM) program in the Koondrook and Perricoota State Forests by taking responsibility for the administration of external funding agreements and delivery of annual water projects. The position is part of the Red Gum district of Western Region (Hardwoods) and reports to the TLM Program Manager.\nAbout You \nThe ideal candidate for this role is strategic and collaborative and with a passion for Natural Resource Management.  You can communicate effectively with a wide range of stakeholders and you will demonstrate the following qualifications, skills and experience:\nTertiary qualifications in natural resource management, preferably ecology, forestry, agriculture or water;\nDemonstrated experience in the science, government or consulting sectors or equivalent;\nExcellent verbal and written communication skills;\nExperience and demonstrated ability to develop productive relationships with stakeholders;\nSound computer skills including word processing, spreadsheets, GIS or other mapping program;\nExperience delivering short term or annual projects, including procurement and management of service providers;\nExperience working with rural communities regarding natural resource management is ideal;\nExperience in Aboriginal/Traditional owner engagement is ideal.\n \nIf you are a recent sciences graduate looking for a unique opportunity to support the forefront of water resource management, we also encourage you to apply.\n \nThe Application Process:\nPlease apply with an updated copy of your resume [maximum five pages].  In your cover letter, tell us about why you are interested and what skills you can bring to the role.  Applicants should email their applications to jobapplications@fcnsw.com.au [link removed]\nPlease contact for a confidential discussion contact David Leslie on (m) 0455 330 098 | E: david.leslie@fcnsw.com.au [link removed]for more information about the role.\n \nApplications Close:  Sunday 9 May 2021\n \nForestry Corporation is an inclusive workplace which promotes diversity and encourages flexible working arrangements. \nThe successful applicant will be required to undergo a medical assessment and drug and alcohol screening as part of the recruitment process. As this role has frontline fire-fighting responsibilities a Task Based Assessment (TBA) at a standard of at least the Moderate Field Test is required. \nApplicants for this position should have Australian residency or current eligibility to work in Australia.\nWe are an EEO employer and encourage females and Aboriginal and Torres Strait Islander people to apply."}