{"title":"Water & Wastewater Treatment Supervisor","salary":"Not Found","dataCreated":"2021-04-06","city":"Otago","area":"","employer":"Fulton Hogan","validThrough":"2021-05-07","type":"Full Time","description":"Central Otago is renowned for its stunning scenery and popular attractions; surrounded by impressive mountains and the beautiful lakes. If you are looking for a role with a great lifestyle, this could be the opportunity that you've been waiting for!\n \nThe opportunity\n We are looking for a self-motivated individual who is keen to start or further a career in utilities. The role will see you involved in the planning and supervisor of the safe and successful day to day activities of water and wastewater treatment crews. You will lead the delivery of work in a efficient manner whilst complying with all appropriate legislation/standards, company policies and procedures and industry best practise.\n As a strong communicator, you will be someone who is pro-active with excellent problem-solving abilities and a safety focused mindset.\n \nWhat you will be doing\n This is a full time permanent opportunity to lead and develop the Three Waters Crew in Central Otago.\nExperience with waste water plant operation (Supervisor level)\nAppropriate licences (class 2 minimum)\nProblem solving skills\nAbility to train and empower your staff\nExperience in cost management regarding material and labour requirements to achieve production\nStrong focus on health and safety not only for yourself, your team but also the public\nSelf-motivated with a focus on excellence and continuous improvement\nAbility to cope with change and be able to think on your feet\nNational Certificate in Water Treatment (or working towards this) is preferable.\nYou will be required to work a minimum of 40 hours per week. Over 40 hours will be paid time and a half. PPE provided and all training will be given to the successful candidate.\n For the right candidate who is genuinely interested in this area of work, we will help you work towards your qualifications. This role involves being on-call at times, as part of a rotating roster so some flexibility is required.\n What's in it for you? We will offer you the opportunity to work amongst breathtaking scenery, to be part of a successful, dedicated team with a great attitude, the opportunity to train and develop your career, company benefits, a competitive rate package and medical insurance (after a qualifying period).\n \nFulton Hogan Philosophy\n We build and maintain critical infrastructure that connects and enhances communities across New Zealand, Australia and the Pacific. Everything from roads and bridges, to airports and utilities. We're committed to ensuring the Good Work we do will make a positive difference to the quality of life for our people, our customers and the communities we all call home. Our continued success relies on generating new and diverse ideas, which is why our 'Good Work' culture encourages ownership and empowerment, while never forgetting the importance of balancing life's priorities.\n \nSound like you?\n If this sounds like you and you would like to help build on our Good Work culture, then we would like to hear from you.\n Apply online with your CV and cover letter. If you require further information please call 03 440 0547."}