{"title":"Experienced Oil and Gas Drilling Solutions (DF) Field Specialist","salary":"Not Found","dataCreated":"2021-04-19","city":"Taranaki","area":"New Plymouth","employer":"Schlumberger New Zealand Limited","validThrough":"2021-05-19","type":"Full Time","description":"Schlumberger is the leading provider of technology and services to the energy industry across the world\n  \n \n  \n \n  \n \n  \nExperienced Oil and Gas Drilling Solutions (DF) Field Specialist\n  \n \n  \n \n  \nLocation: \nNew Plymouth, NZ\n  \nType of contract: \nPermanent\n  \n \n  \nSchlumberger is currently seeking to fill a \nPermanent Full Time\n position of \nDrilling Fluid Specialist (DFS)\n in \nNew Plymouth, NZ.\n  \n \n  \nThe MI Drilling Fluids Specialist is responsible for maintaining safe, efficient, and reliable PSD to Customers. The MI DFS identifies opportunities to improve service delivery, implements standard work, and manage, risk during service delivery.\n  \n \n  \nProvides onsite services to the operator by measuring, testing, and supervising the running of fluid mixing and pumping, including technical analysis and specific recommendations for controlling fluid properties. May serve as the lead drilling fluids specialist at a customer rig site, may accompany sales representative in customer presentations reconcile product usage with warehouse supplies. Train entry level drilling fluids specialists. Handles special projects, as designed.\n  \n \n  \nRequirements:\n \nMust reside in New Plymouth or New Zealand\nMust have the full right to live and work in \nNew Zealand\n including work offshore\nNo travel restrictions, open to relocation based on company’s requirement, and mobile within Australasia or New Zealand\nDiploma or Bachelor Degree in Engineering or other relevant technical discipline\nMinimum 5 years Oil and Gas proven experienced offshore and land as a Drilling Fluid Specialist/Mud Engineer\nAble to demonstrate strong organizational abilities and interpersonal skills, as well as solid technical competency\nGood computer skills\nValid offshore survival, OGUK medical and MSIC certification\nKnowledgeable on key M-I SWACO product properties, applications, and limitations\nKnowledgeable on the properties of the mud\nKnowledgeable on the effects of the products/systems on the mud chemistry\nKnowledgeable regarding drilling rig types, rig components and rig component functions\nKnowledgeable on drilling operations\nKnowledgeable on the drilling fluids circulation system, it's components, and each component's function\nAvailable soon\n \n  \n \n  \nApplication:\n  \nPlease apply via this advertisement and upload detailed resume and a cover letter outlining your qualifications and work experience.\n  \n \n  \nApplication is open from \n19-April-2021 \nuntil \n19-May-2021.\n  \nOnly successful applicants that meet the above criteria will be contacted.\n  \n \n  \nSchlumberger is an equal employment opportunity employer. Qualified applicants are considered without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or veteran status."}