{"title":"Billing Team Lead","salary":"Not Found","dataCreated":"2021-04-09","city":"Wellington","area":"Wellington Central","employer":"Simply Energy Limited","validThrough":"2021-05-09","type":"Full Time","description":"We’re looking for a Billing Team Leader to run one of our core functions.\nWe’re on a mission to create a better New Zealand by focusing on one thing – helping our commercial and industrial customers, with complex energy requirements, reduce their energy-related emissions. In a nutshell it’s about helping our customers utilise smart solutions that help them use less energy, use energy better, and use better energy.\nTaking on climate change is a huge challenge; and one that we can’t take on alone. So, we’re collaborating with our customers, partners, and industry and, looking for like-minded people to join our team to help us go further, faster.\nContext of the Role\nCore to what we want to do as a company is our customers trusting us and partnering with us as we go on the journey to decarbonise their business. To do that, we need to provide them with an exceptional customer experience and core to that is billing. \nWe have to make sure the core of what we do, we do better than anyone else. That is where you come in. In the role of Billing Team Lead, you will lead the Simply Energy Billing Team. You will oversee all aspects of our billing workflows, processes and systems. We need our billing team, systems and processes humming. You will be leading a billing offering that makes Simply Energy easy and hassle free to deal with and provides an excellent customer experience. \nBy doing that we can concentrate on the conversations that matter – how we can add value to our customers business. You will be the go-to for any detailed or complicated questions from the Billing Team. You’ll work closely with the Operations and Support Team Leads to ensure the best outcome for our customers. With this role we promise variation so you can look forward to finessing your agility skills as you find yourself moving across many different tasks in any given day.\nHow you'll work with us\n \nAs the owner of our billing functions, be accountable for the accuracy of our billing data and timeliness of delivery, ensuring that we meet our commitments (contractual, market, regulatory etc). This includes ensuring that all inputs that impact the quality of delivery align with the output needed.\nEffectively manage the Billing Team and the monthly billing processes to ensure all customers are billed timely and accurately.\nFoster an environment where the Billing Team is inspired and driven to continuously improve our billing process and systems.\nBe the go to person for all escalations with the Billing Team.\nContinuously improve our billing offering to internal and external stakeholders by identifying and implementing areas of process improvement within the billing area.\nCollaborate closely with the Operations and Support Leads to support the cross training of employees,  highlight areas of concern, identify areas of improvement and ensure you understand and feed into the complete customer journey.\nEnsure all industry and regulatory compliance obligations are met including key dashboards ensuring SLAs and KPIs are met and issues are resolved.\nMaintain up to date schedules and process documentation as well as training the Billing Team on any new or changed processes.\nPerform detailed analysis of billing issues to provide exceptional customer solutions, diagnose issues within our systems and raise as support requests internally or with external vendors as required.\nSupport loss management reporting, resolution, investigation, root cause identification and controls enhancement from a billing perspective \nProvide backup and support for our Billing Analysts as required.\nIdentify opportunities for process and system improvement.\nParticipate or lead as required in projects and audits, ensuring action points are reviewed and completed within agreed timeframes.\nWhat you'll bring to the role\n \nPrevious experience in the electricity industry in a billing, analysis and/or service management role.\nYou’ll be passionate about our purpose and excited to help our customers decarbonize sustainably.\nYour integrity and high personal and professional standards are noticeable and you have a willingness to do the right thing as opposed to the easy thing. You’re naturally curious and take a flexible approach, and respond well to new ideas which is demonstrated by a willingness to take on new challenges.\nYou’ll need a high level of initiative and self-management skills; you’ll be proactive, have a high ability to cope under pressure and use your proven analytical, problem solving and decision making skills to determine priorities for yourself and others.\nYou understand the importance of the industry regulations and are capable and willing to follow process – holding those responsibilities as your top priority.\nWhat you'll get in return\nAs well as being part of a dynamic team, working towards a better New Zealand and planet, we’ll reward you for your contribution in other ways, including competitive pay,  the flexibility to work from anywhere, additional KiwiSaver contributions, health care cover and a generous bonus scheme.\nIf the role sounds like you, and you’re up for the challenge, we’d love to hear from you.\nApplications close 9pm Monday 26 April 2021"}