{"title":"Wind Farm Technicians, Fitters and Labours","salary":"Not Found","dataCreated":"2021-04-08","city":"Manawatu","area":"Palmerston North","employer":"Smith Crane & Construction","validThrough":"2021-05-09","type":"Full Time","description":"Smith Crane and Construction is a national leader in Crane Hire and Construction with more than 250 employees, 300 major plant items with branches in Auckland, Christchurch, Queenstown and Invercargill, as well as international ties with sister companies in Australia, Guam &amp; Papa New Guinea. \nRecently awarded the Crane &amp; Installation Contract for Turitea Wind Farm, construction of a 221.4MW wind farm (33 x V112-3.6MW) and (27 x V112-3.8MW) comprising a total of sixty Vestas wind turbines generators, with three-bladed rotors and two tubular steel tower sections at a hub height of approximately 69 meters, mounted with a nacelle containing a generator, gearbox and electrical equipment. \nThe wind farm is located within the Tararua area, approximately 17 kilometers south-east of Palmerston North. \nSmith Crane and Construction is seeking to employ qualified technicians in the following fields for successful completion of this exciting project for 2022. Including but not limited too;\nMechanical fitters\nElectrical techs\nRigger / Rigger Dogman\nCrane Operators\nHaulage and Transport Operators\nGlobal Wind Organization (GWO) qualified technicians\nLabour and ground support crew\nCleaning and Painting crew\nCommitted to safe, drug and alcohol free workplace, successful applicants will be required to undergo and satisfactorily pass a full medical and drug test prior to employment. \nRemuneration will be in line with industry standard, dependent on the applicants qualifications role and experience.  Overtime, time and a half after 40 hours are on offer. \nPreference will be given to local applicants or those willing to relocate to the Palmerston North / Manawatu region for the project duration. \nWith the divisions in Cranage, Transport, Heavy Haulage, Civil, Precast, Marine, Pilin, Fabrication, Automotive, Coatings and many Wind Farms projects in the pipeline for NZ, Smith Crane and Construction is well positioned to take a stronghold on the market and this is a fantastic project and career development opportunity, with a pathway to future roles as our business continues to grow. \nFee free to contact Lawrence McBreen-Smith, Project Manager, 021 319 923 for a confidential discussion and visit our website www.smithcranes.co.nz [link removed] to find out more about our company. \nPositions available immediately. \nPlease submit applications as a cover letter and CV to recruitment@smithcranes.co.nz [link removed] and clearly state the following;\nGWO Qualification / Winda Number\nAvailability\nCurrent Location\nIf not local, confirm ability to relocate to Palmerston North area for the duration of the project or\nFly in Fly Out (FIFO) and \nCurrent NZ Visa Status."}