{"title":"Maintenance Scheduler","salary":"Not Found","dataCreated":"2021-04-16","city":"Southland","area":"","employer":"Rio Tinto","validThrough":"2021-05-16","type":"Full Time","description":"Maintenance Scheduler\nBe part of a group that is safety driven and values inclusion\nJoin an encouraging leadership group, committed to your growth and development\nExcellent opportunity to be part of an exciting and competent team\nRole based at Invercargill, New Zealand\nAbout the role\nAll progress begins with pioneers. At Rio Tinto, it begins with you.\nWe are looking for a Maintenance Scheduler to develop and implement maintenance tactics and improve the maintenance system for use in the preparation of weekly schedules.\nThis role is a great opportunity for a passionate and self-motivated individual who has exceptional communication and stakeholder management skills. You will have the ability to be flexible in a fast-paced environment and be able to effectively prioritise. \nIn addition to paying competitively and providing great benefits packages, we want you to live the lifestyle that is right for you and your family. And because of our size and scale, there are many opportunities to learn, grow and do more than you ever thought possible. Every hour of every shift, your safety and wellbeing is our number one priority. We do the work only if it is safe, and we invest to make sure every member of the team has the quality tools they need to do their job.\nReporting to the \nSuperintendent - Maintenance Planning\n and working in a challenging and exciting environment within asset management team, you will be:\nOptimising equipment maintenance strategies and maintaining the maintenance system by reviewing, analysing and developing amendments/modifications\nLiaising with supervisors to identify efficient and effective scheduling requirements\nProviding advice, training and support to team members in relation to the Asset Management Work Management Process\nCreating work orders from notifications using tasks lists, and add required planning information to the work orders\nWhat you’ll bring\nA commitment to the safety of yourself and your team\nA relevant trade qualification or equivalent\nA current C Class drivers licence\nDemonstrated skills in scheduling within the resources industry\nExperience utilising a Computerised Maintenance Management System (SAP experience will be highly regarded)\nIntermediate knowledge in Microsoft Office including Project and Excel\nWhat we offer\nBe recognised for your contribution, your thinking and your hard work, and go home knowing you’ve helped the world progress.\nA work environment where safety is always the number one priority\nA competitive base salary reflective of your skills and experience with annual incentive program\nComprehensive medical assistance scheme\nAttractive share ownership plan\nLeave for all of life’s reasons (vacation/annual, paid parental, sick leave) including long service leave\nAccess to transport assistance between Invercargill and Tiwai.\nCompetitive superannuation programme\nCareer development &amp; education assistance to further your technical or leadership ambitions\nAbout Rio Tinto\nEvery idea, every innovation, every little thing the world calls ‘progress’ begins with a first step, and someone willing to take it: explorers, inventors, entrepreneurs. Pioneers.\nFor nearly 150 years, Rio Tinto has been a company of pioneers – generations of people spanning the globe, all with the grit and vision to produce materials essential to human progress.\nOur iron ore has shaped skylines from Shanghai to Sydney. Our aluminium – the world’s first to be certified “responsible” – helps planes fly and makes cars lighter. Our copper helps wind turbines power cities and our boron helps feed the world, and explore the universe. Our diamonds help us celebrate the best parts of life.\nWhere you’ll be working\nRio Tinto Aluminium – Pacific Operations\nRio Tinto is a global leader in aluminium, one of the world’s most widely used metals.\nActive in the sector for more than 110 years, today we operate large-scale, high-quality bauxite mines and alumina refineries, and have the world’s most modern and competitive aluminium smelter portfolio.\nOur Pacific Operations sites are located along the east coast of Australia, at the tip of the Northern Territory and in New Zealand’s south. With more than 6,000 employees, we operate a full value chain approach—mining, refining and smelting. Our portfolio includes four bauxite mines, two refineries, four smelters and one power station, and is supported by technical experts located in our Brisbane hub, including a fully operational Operations Centre for our bauxite mines.\nEvery Voice Matters\nAt Rio Tinto, we particularly welcome and encourage applications from Indigenous people, women, the LGBTI+ community, mature workers, people with disabilities and people from different cultural backgrounds.\nWe are committed to an inclusive environment where people feel comfortable to be themselves. We want our people to feel that all voices are heard, all cultures respected and that a variety of perspectives are not only welcome – they are essential to our success. We treat each other fairly and with dignity regardless of race, gender, nationality, ethnic origin, religion, age, sexual orientation or anything else that makes us different."}